/*
 Navicat Premium Data Transfer

 Source Server         : qht
 Source Server Type    : MySQL
 Source Server Version : 90200 (9.2.0)
 Source Host           : localhost:3306
 Source Schema         : nutrition

 Target Server Type    : MySQL
 Target Server Version : 90200 (9.2.0)
 File Encoding         : 65001

 Date: 07/06/2025 16:02:23
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for allergen
-- ----------------------------
DROP TABLE IF EXISTS `allergen`;
CREATE TABLE `allergen`  (
  `id` int UNSIGNED NOT NULL AUTO_INCREMENT,
  `student_number` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '学号',
  `allergen` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `create_time` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 34 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '过敏原' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of allergen
-- ----------------------------
INSERT INTO `allergen` VALUES (6, '2331020130229', '伤心', '2025-05-26 12:08:38');
INSERT INTO `allergen` VALUES (7, '2331020130229', '炸药', '2025-05-26 12:08:38');
INSERT INTO `allergen` VALUES (8, '2331020130229', '子弹', '2025-05-26 12:08:38');
INSERT INTO `allergen` VALUES (9, '2333311220111', '杜甫', '2025-05-26 16:43:31');

-- ----------------------------
-- Table structure for app_user
-- ----------------------------
DROP TABLE IF EXISTS `app_user`;
CREATE TABLE `app_user`  (
  `id` int UNSIGNED NOT NULL AUTO_INCREMENT,
  `student_number` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '学号',
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '姓名',
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '登录密码',
  `avatar` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT 'https://ts3.tc.mm.bing.net/th/id/OIP-C.g5M-iZUiocFCi9YAzojtRAAAAA' COMMENT '头像',
  `height` double NULL DEFAULT NULL COMMENT '身高',
  `weight` double NULL DEFAULT NULL COMMENT '体重',
  `last_login_time` datetime NULL DEFAULT NULL COMMENT '上次登录时间',
  `create_time` datetime NULL DEFAULT NULL,
  `update_time` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `uk_student_number`(`student_number` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 528 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = 'app注册用户' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of app_user
-- ----------------------------
INSERT INTO `app_user` VALUES (1, '2331020130229', '覃惠通', '8347C73A13E73D841030A31D6E0DF86E', 'https://ts3.tc.mm.bing.net/th/id/OIP-C.g5M-iZUiocFCi9YAzojtRAAAAA', 190, 50, '2025-06-06 08:35:11', '2025-05-16 20:57:57', '2025-05-26 12:06:18');
INSERT INTO `app_user` VALUES (2, '2333311220111', '李白', '4b2ce66d1b326edf19bdc20aabca8efd', '/profile/upload/2025/05/26/red_oil_20250526163950A001.jpg', 170, 50, NULL, '2025-05-26 16:43:30', '2025-05-26 16:43:30');
INSERT INTO `app_user` VALUES (28, 'S00000001', '陈丽', '123456', 'https://picsum.photos/200/200?random=1', 150.4, 69.1, '2025-02-16 00:00:00', '2025-01-26 00:00:00', '2025-02-17 00:00:00');
INSERT INTO `app_user` VALUES (29, 'S00000002', '范涛', '123456', 'https://picsum.photos/200/200?random=2', 156.3, 83.4, '2025-02-15 00:00:00', '2025-01-18 00:00:00', '2025-02-14 00:00:00');
INSERT INTO `app_user` VALUES (30, 'S00000003', '邱旭', '123456', 'https://picsum.photos/200/200?random=3', 159.1, 51.7, '2025-04-25 00:00:00', '2025-04-06 00:00:00', '2025-04-22 00:00:00');
INSERT INTO `app_user` VALUES (31, 'S00000004', '姚玉梅', '123456', 'https://picsum.photos/200/200?random=4', 150.3, 72, '2025-03-02 00:00:00', '2025-02-27 00:00:00', '2025-03-19 00:00:00');
INSERT INTO `app_user` VALUES (32, 'S00000005', '李红梅', '123456', 'https://picsum.photos/200/200?random=5', 173.4, 40.7, '2025-03-11 00:00:00', '2025-02-13 00:00:00', '2025-03-03 00:00:00');
INSERT INTO `app_user` VALUES (33, 'S00000006', '杨鑫', '123456', 'https://picsum.photos/200/200?random=6', 178, 61.5, '2025-04-25 00:00:00', '2025-03-31 00:00:00', '2025-04-15 00:00:00');
INSERT INTO `app_user` VALUES (34, 'S00000007', '谢楠', '123456', 'https://picsum.photos/200/200?random=7', 183.1, 77.3, '2025-02-11 00:00:00', '2025-01-22 00:00:00', '2025-02-05 00:00:00');
INSERT INTO `app_user` VALUES (35, 'S00000008', '刘俊', '123456', 'https://picsum.photos/200/200?random=8', 176.5, 71.7, '2025-07-12 00:00:00', '2025-06-18 00:00:00', '2025-06-30 00:00:00');
INSERT INTO `app_user` VALUES (36, 'S00000009', '曹刚', '123456', 'https://picsum.photos/200/200?random=9', 163.7, 76.4, '2025-04-28 00:00:00', '2025-04-25 00:00:00', '2025-05-19 00:00:00');
INSERT INTO `app_user` VALUES (37, 'S00000010', '钟海燕', '123456', 'https://picsum.photos/200/200?random=10', 175.7, 88.2, '2025-04-15 00:00:00', '2025-04-13 00:00:00', '2025-04-14 00:00:00');
INSERT INTO `app_user` VALUES (38, 'S00000011', '姚伟', '123456', 'https://picsum.photos/200/200?random=11', 167.5, 83.3, '2025-02-04 00:00:00', '2025-01-08 00:00:00', '2025-01-13 00:00:00');
INSERT INTO `app_user` VALUES (39, 'S00000012', '李燕', '123456', 'https://picsum.photos/200/200?random=12', 167.6, 46.1, '2025-05-19 00:00:00', '2025-05-14 00:00:00', '2025-06-12 00:00:00');
INSERT INTO `app_user` VALUES (40, 'S00000013', '周鹏', '123456', 'https://picsum.photos/200/200?random=13', 157.3, 53, '2025-05-24 00:00:00', '2025-04-30 00:00:00', '2025-05-08 00:00:00');
INSERT INTO `app_user` VALUES (41, 'S00000014', '李秀珍', '123456', 'https://picsum.photos/200/200?random=14', 155.2, 55.3, '2025-03-21 00:00:00', '2025-02-24 00:00:00', '2025-02-26 00:00:00');
INSERT INTO `app_user` VALUES (42, 'S00000015', '张楠', '123456', 'https://picsum.photos/200/200?random=15', 177.1, 63.1, '2025-02-05 00:00:00', '2025-01-22 00:00:00', '2025-02-19 00:00:00');
INSERT INTO `app_user` VALUES (43, 'S00000016', '季淑珍', '123456', 'https://picsum.photos/200/200?random=16', 176.5, 88.4, '2025-01-26 00:00:00', '2025-01-20 00:00:00', '2025-01-25 00:00:00');
INSERT INTO `app_user` VALUES (44, 'S00000017', '何慧', '123456', 'https://picsum.photos/200/200?random=17', 153.2, 63, '2025-06-15 00:00:00', '2025-05-25 00:00:00', '2025-06-21 00:00:00');
INSERT INTO `app_user` VALUES (45, 'S00000018', '韦建华', '123456', 'https://picsum.photos/200/200?random=18', 159.6, 66.2, '2025-04-10 00:00:00', '2025-04-06 00:00:00', '2025-04-21 00:00:00');
INSERT INTO `app_user` VALUES (46, 'S00000019', '王桂珍', '123456', 'https://picsum.photos/200/200?random=19', 178.3, 86.7, '2025-05-29 00:00:00', '2025-05-02 00:00:00', '2025-05-20 00:00:00');
INSERT INTO `app_user` VALUES (47, 'S00000020', '龙建平', '123456', 'https://picsum.photos/200/200?random=20', 163.9, 48.1, '2025-06-11 00:00:00', '2025-05-28 00:00:00', '2025-06-11 00:00:00');
INSERT INTO `app_user` VALUES (48, 'S00000021', '刘英', '123456', 'https://picsum.photos/200/200?random=21', 179.4, 62.8, '2025-06-09 00:00:00', '2025-05-21 00:00:00', '2025-06-05 00:00:00');
INSERT INTO `app_user` VALUES (49, 'S00000022', '范淑兰', '123456', 'https://picsum.photos/200/200?random=22', 163.1, 48.9, '2025-07-02 00:00:00', '2025-06-07 00:00:00', '2025-06-29 00:00:00');
INSERT INTO `app_user` VALUES (50, 'S00000023', '陆军', '123456', 'https://picsum.photos/200/200?random=23', 170.6, 85.3, '2025-01-24 00:00:00', '2025-01-17 00:00:00', '2025-01-27 00:00:00');
INSERT INTO `app_user` VALUES (51, 'S00000024', '吴建华', '123456', 'https://picsum.photos/200/200?random=24', 171.3, 69.2, '2025-03-09 00:00:00', '2025-02-19 00:00:00', '2025-03-18 00:00:00');
INSERT INTO `app_user` VALUES (52, 'S00000025', '崔平', '123456', 'https://picsum.photos/200/200?random=25', 183.2, 74.3, '2025-04-11 00:00:00', '2025-03-27 00:00:00', '2025-04-20 00:00:00');
INSERT INTO `app_user` VALUES (53, 'S00000026', '张玉兰', '123456', 'https://picsum.photos/200/200?random=26', 159.3, 77.4, '2025-02-12 00:00:00', '2025-01-24 00:00:00', '2025-01-31 00:00:00');
INSERT INTO `app_user` VALUES (54, 'S00000027', '冯晶', '123456', 'https://picsum.photos/200/200?random=27', 179.8, 72.2, '2025-04-21 00:00:00', '2025-03-31 00:00:00', '2025-04-14 00:00:00');
INSERT INTO `app_user` VALUES (55, 'S00000028', '沈兵', '123456', 'https://picsum.photos/200/200?random=28', 171.4, 62, '2025-02-19 00:00:00', '2025-02-16 00:00:00', '2025-03-07 00:00:00');
INSERT INTO `app_user` VALUES (56, 'S00000029', '常丽丽', '123456', 'https://picsum.photos/200/200?random=29', 169.6, 77.9, '2025-07-18 00:00:00', '2025-06-25 00:00:00', '2025-07-22 00:00:00');
INSERT INTO `app_user` VALUES (57, 'S00000030', '刘秀华', '123456', 'https://picsum.photos/200/200?random=30', 154.2, 84.2, '2025-06-09 00:00:00', '2025-05-28 00:00:00', '2025-06-24 00:00:00');
INSERT INTO `app_user` VALUES (58, 'S00000031', '武建华', '123456', 'https://picsum.photos/200/200?random=31', 166.8, 48.8, '2025-03-29 00:00:00', '2025-03-10 00:00:00', '2025-03-25 00:00:00');
INSERT INTO `app_user` VALUES (59, 'S00000032', '任兵', '123456', 'https://picsum.photos/200/200?random=32', 154.6, 42.8, '2025-01-24 00:00:00', '2025-01-08 00:00:00', '2025-01-25 00:00:00');
INSERT INTO `app_user` VALUES (60, 'S00000033', '方洋', '123456', 'https://picsum.photos/200/200?random=33', 180.4, 65.7, '2025-07-13 00:00:00', '2025-06-26 00:00:00', '2025-07-17 00:00:00');
INSERT INTO `app_user` VALUES (61, 'S00000034', '丁建军', '123456', 'https://picsum.photos/200/200?random=34', 188.6, 79, '2025-03-12 00:00:00', '2025-02-14 00:00:00', '2025-03-12 00:00:00');
INSERT INTO `app_user` VALUES (62, 'S00000035', '李玉', '123456', 'https://picsum.photos/200/200?random=35', 176.1, 75.8, '2025-07-22 00:00:00', '2025-06-29 00:00:00', '2025-07-27 00:00:00');
INSERT INTO `app_user` VALUES (63, 'S00000036', '李涛', '123456', 'https://picsum.photos/200/200?random=36', 156.9, 84.8, '2025-02-08 00:00:00', '2025-01-11 00:00:00', '2025-01-18 00:00:00');
INSERT INTO `app_user` VALUES (64, 'S00000037', '石坤', '123456', 'https://picsum.photos/200/200?random=37', 179.8, 86.2, '2025-05-30 00:00:00', '2025-05-10 00:00:00', '2025-05-29 00:00:00');
INSERT INTO `app_user` VALUES (65, 'S00000038', '徐琴', '123456', 'https://picsum.photos/200/200?random=38', 187.3, 41.5, '2025-06-27 00:00:00', '2025-06-03 00:00:00', '2025-06-13 00:00:00');
INSERT INTO `app_user` VALUES (66, 'S00000039', '罗玉英', '123456', 'https://picsum.photos/200/200?random=39', 168.5, 54.1, '2025-03-09 00:00:00', '2025-02-28 00:00:00', '2025-03-25 00:00:00');
INSERT INTO `app_user` VALUES (67, 'S00000040', '周芳', '123456', 'https://picsum.photos/200/200?random=40', 155.5, 87.2, '2025-05-09 00:00:00', '2025-04-17 00:00:00', '2025-04-24 00:00:00');
INSERT INTO `app_user` VALUES (68, 'S00000041', '赵博', '123456', 'https://picsum.photos/200/200?random=41', 168.6, 61.9, '2025-02-23 00:00:00', '2025-02-17 00:00:00', '2025-03-02 00:00:00');
INSERT INTO `app_user` VALUES (69, 'S00000042', '梁龙', '123456', 'https://picsum.photos/200/200?random=42', 170.8, 62.4, '2025-04-22 00:00:00', '2025-04-08 00:00:00', '2025-05-06 00:00:00');
INSERT INTO `app_user` VALUES (70, 'S00000043', '曾静', '123456', 'https://picsum.photos/200/200?random=43', 163.9, 42.2, '2025-06-26 00:00:00', '2025-06-10 00:00:00', '2025-07-01 00:00:00');
INSERT INTO `app_user` VALUES (71, 'S00000044', '钟阳', '123456', 'https://picsum.photos/200/200?random=44', 175.4, 73.4, '2025-01-10 00:00:00', '2025-01-03 00:00:00', '2025-01-28 00:00:00');
INSERT INTO `app_user` VALUES (72, 'S00000045', '刘建', '123456', 'https://picsum.photos/200/200?random=45', 168.7, 72, '2025-03-07 00:00:00', '2025-02-20 00:00:00', '2025-03-20 00:00:00');
INSERT INTO `app_user` VALUES (73, 'S00000046', '刘雷', '123456', 'https://picsum.photos/200/200?random=46', 176.2, 74.4, '2025-03-26 00:00:00', '2025-02-26 00:00:00', '2025-03-24 00:00:00');
INSERT INTO `app_user` VALUES (74, 'S00000047', '刘洁', '123456', 'https://picsum.photos/200/200?random=47', 187.8, 84.1, '2025-04-28 00:00:00', '2025-04-13 00:00:00', '2025-05-04 00:00:00');
INSERT INTO `app_user` VALUES (75, 'S00000048', '陈凤英', '123456', 'https://picsum.photos/200/200?random=48', 158.8, 68.9, '2025-07-03 00:00:00', '2025-06-30 00:00:00', '2025-07-27 00:00:00');
INSERT INTO `app_user` VALUES (76, 'S00000049', '王秀英', '123456', 'https://picsum.photos/200/200?random=49', 177.3, 59.7, '2025-06-20 00:00:00', '2025-06-01 00:00:00', '2025-06-06 00:00:00');
INSERT INTO `app_user` VALUES (77, 'S00000050', '刘兵', '123456', 'https://picsum.photos/200/200?random=50', 161, 53.3, '2025-02-13 00:00:00', '2025-02-05 00:00:00', '2025-02-15 00:00:00');
INSERT INTO `app_user` VALUES (78, 'S00000051', '汪晶', '123456', 'https://picsum.photos/200/200?random=51', 150.7, 83.5, '2025-06-21 00:00:00', '2025-06-12 00:00:00', '2025-06-26 00:00:00');
INSERT INTO `app_user` VALUES (79, 'S00000052', '田秀梅', '123456', 'https://picsum.photos/200/200?random=52', 178.1, 44.3, '2025-06-23 00:00:00', '2025-05-30 00:00:00', '2025-06-05 00:00:00');
INSERT INTO `app_user` VALUES (80, 'S00000053', '聂海燕', '123456', 'https://picsum.photos/200/200?random=53', 177.7, 70.6, '2025-05-29 00:00:00', '2025-05-20 00:00:00', '2025-06-16 00:00:00');
INSERT INTO `app_user` VALUES (81, 'S00000054', '谢玉梅', '123456', 'https://picsum.photos/200/200?random=54', 180.7, 40.9, '2025-03-01 00:00:00', '2025-02-13 00:00:00', '2025-02-28 00:00:00');
INSERT INTO `app_user` VALUES (82, 'S00000055', '杜志强', '123456', 'https://picsum.photos/200/200?random=55', 155.5, 69, '2025-06-01 00:00:00', '2025-05-02 00:00:00', '2025-05-17 00:00:00');
INSERT INTO `app_user` VALUES (83, 'S00000056', '傅龙', '123456', 'https://picsum.photos/200/200?random=56', 166.1, 50.6, '2025-03-19 00:00:00', '2025-03-07 00:00:00', '2025-03-17 00:00:00');
INSERT INTO `app_user` VALUES (84, 'S00000057', '董淑珍', '123456', 'https://picsum.photos/200/200?random=57', 154.6, 42, '2025-01-31 00:00:00', '2025-01-15 00:00:00', '2025-01-26 00:00:00');
INSERT INTO `app_user` VALUES (85, 'S00000058', '王伟', '123456', 'https://picsum.photos/200/200?random=58', 165, 76.6, '2025-05-30 00:00:00', '2025-05-04 00:00:00', '2025-05-20 00:00:00');
INSERT INTO `app_user` VALUES (86, 'S00000059', '陈玉英', '123456', 'https://picsum.photos/200/200?random=59', 167.7, 50.1, '2025-05-05 00:00:00', '2025-04-15 00:00:00', '2025-04-20 00:00:00');
INSERT INTO `app_user` VALUES (87, 'S00000060', '赵军', '123456', 'https://picsum.photos/200/200?random=60', 170.4, 50, '2025-07-18 00:00:00', '2025-06-19 00:00:00', '2025-07-11 00:00:00');
INSERT INTO `app_user` VALUES (88, 'S00000061', '康鹏', '123456', 'https://picsum.photos/200/200?random=61', 173.5, 51.1, '2025-06-07 00:00:00', '2025-05-28 00:00:00', '2025-05-29 00:00:00');
INSERT INTO `app_user` VALUES (89, 'S00000062', '李燕', '123456', 'https://picsum.photos/200/200?random=62', 155.3, 55.1, '2025-05-13 00:00:00', '2025-05-06 00:00:00', '2025-05-25 00:00:00');
INSERT INTO `app_user` VALUES (90, 'S00000063', '陈荣', '123456', 'https://picsum.photos/200/200?random=63', 150.2, 52.6, '2025-05-08 00:00:00', '2025-04-14 00:00:00', '2025-04-20 00:00:00');
INSERT INTO `app_user` VALUES (91, 'S00000064', '张建军', '123456', 'https://picsum.photos/200/200?random=64', 152.8, 88, '2025-04-11 00:00:00', '2025-04-04 00:00:00', '2025-04-05 00:00:00');
INSERT INTO `app_user` VALUES (92, 'S00000065', '张桂芳', '123456', 'https://picsum.photos/200/200?random=65', 181.8, 67.7, '2025-04-21 00:00:00', '2025-04-02 00:00:00', '2025-04-08 00:00:00');
INSERT INTO `app_user` VALUES (93, 'S00000066', '胡海燕', '123456', 'https://picsum.photos/200/200?random=66', 163.3, 58.6, '2025-02-03 00:00:00', '2025-01-10 00:00:00', '2025-01-22 00:00:00');
INSERT INTO `app_user` VALUES (94, 'S00000067', '张平', '123456', 'https://picsum.photos/200/200?random=67', 167.2, 50.5, '2025-03-09 00:00:00', '2025-03-06 00:00:00', '2025-03-08 00:00:00');
INSERT INTO `app_user` VALUES (95, 'S00000068', '牛秀英', '123456', 'https://picsum.photos/200/200?random=68', 157.9, 75, '2025-05-10 00:00:00', '2025-04-24 00:00:00', '2025-05-12 00:00:00');
INSERT INTO `app_user` VALUES (96, 'S00000069', '朱玉英', '123456', 'https://picsum.photos/200/200?random=69', 186.9, 83.2, '2025-03-25 00:00:00', '2025-02-26 00:00:00', '2025-03-04 00:00:00');
INSERT INTO `app_user` VALUES (97, 'S00000070', '李梅', '123456', 'https://picsum.photos/200/200?random=70', 185.2, 72.8, '2025-05-19 00:00:00', '2025-05-02 00:00:00', '2025-05-09 00:00:00');
INSERT INTO `app_user` VALUES (98, 'S00000071', '袁兵', '123456', 'https://picsum.photos/200/200?random=71', 185.7, 86.3, '2025-06-17 00:00:00', '2025-06-12 00:00:00', '2025-07-06 00:00:00');
INSERT INTO `app_user` VALUES (99, 'S00000072', '李强', '123456', 'https://picsum.photos/200/200?random=72', 189.9, 52.8, '2025-02-25 00:00:00', '2025-02-12 00:00:00', '2025-02-14 00:00:00');
INSERT INTO `app_user` VALUES (100, 'S00000073', '朱秀珍', '123456', 'https://picsum.photos/200/200?random=73', 175.9, 73.1, '2025-03-29 00:00:00', '2025-03-10 00:00:00', '2025-04-08 00:00:00');
INSERT INTO `app_user` VALUES (101, 'S00000074', '林波', '123456', 'https://picsum.photos/200/200?random=74', 170.8, 69.3, '2025-01-30 00:00:00', '2025-01-18 00:00:00', '2025-02-15 00:00:00');
INSERT INTO `app_user` VALUES (102, 'S00000075', '陈俊', '123456', 'https://picsum.photos/200/200?random=75', 169.1, 64.8, '2025-05-15 00:00:00', '2025-05-14 00:00:00', '2025-05-25 00:00:00');
INSERT INTO `app_user` VALUES (103, 'S00000076', '高秀兰', '123456', 'https://picsum.photos/200/200?random=76', 167.5, 46.1, '2025-03-12 00:00:00', '2025-03-09 00:00:00', '2025-04-02 00:00:00');
INSERT INTO `app_user` VALUES (104, 'S00000077', '王丽', '123456', 'https://picsum.photos/200/200?random=77', 166, 53.1, '2025-07-25 00:00:00', '2025-06-28 00:00:00', '2025-07-16 00:00:00');
INSERT INTO `app_user` VALUES (105, 'S00000078', '徐淑兰', '123456', 'https://picsum.photos/200/200?random=78', 167.6, 50.6, '2025-07-10 00:00:00', '2025-06-18 00:00:00', '2025-06-19 00:00:00');
INSERT INTO `app_user` VALUES (106, 'S00000079', '姜莉', '123456', 'https://picsum.photos/200/200?random=79', 181.8, 49.5, '2025-02-19 00:00:00', '2025-01-31 00:00:00', '2025-02-17 00:00:00');
INSERT INTO `app_user` VALUES (107, 'S00000080', '金华', '123456', 'https://picsum.photos/200/200?random=80', 178.6, 64.3, '2025-02-06 00:00:00', '2025-01-17 00:00:00', '2025-01-26 00:00:00');
INSERT INTO `app_user` VALUES (108, 'S00000081', '胡兵', '123456', 'https://picsum.photos/200/200?random=81', 188.5, 82.8, '2025-04-26 00:00:00', '2025-04-07 00:00:00', '2025-05-05 00:00:00');
INSERT INTO `app_user` VALUES (109, 'S00000082', '孙建平', '123456', 'https://picsum.photos/200/200?random=82', 164.9, 61.4, '2025-05-15 00:00:00', '2025-05-14 00:00:00', '2025-05-30 00:00:00');
INSERT INTO `app_user` VALUES (110, 'S00000083', '王龙', '123456', 'https://picsum.photos/200/200?random=83', 155.4, 83.2, '2025-07-22 00:00:00', '2025-06-27 00:00:00', '2025-07-20 00:00:00');
INSERT INTO `app_user` VALUES (111, 'S00000084', '王玉珍', '123456', 'https://picsum.photos/200/200?random=84', 173.4, 52.1, '2025-03-08 00:00:00', '2025-03-06 00:00:00', '2025-03-18 00:00:00');
INSERT INTO `app_user` VALUES (112, 'S00000085', '刘杰', '123456', 'https://picsum.photos/200/200?random=85', 150.2, 61.1, '2025-07-04 00:00:00', '2025-06-20 00:00:00', '2025-06-22 00:00:00');
INSERT INTO `app_user` VALUES (113, 'S00000086', '鲍玉', '123456', 'https://picsum.photos/200/200?random=86', 181.6, 76.2, '2025-01-18 00:00:00', '2025-01-08 00:00:00', '2025-01-12 00:00:00');
INSERT INTO `app_user` VALUES (114, 'S00000087', '刘欢', '123456', 'https://picsum.photos/200/200?random=87', 180.9, 51.8, '2025-06-03 00:00:00', '2025-05-21 00:00:00', '2025-05-31 00:00:00');
INSERT INTO `app_user` VALUES (115, 'S00000088', '伍颖', '123456', 'https://picsum.photos/200/200?random=88', 176.5, 55.6, '2025-07-08 00:00:00', '2025-06-09 00:00:00', '2025-06-21 00:00:00');
INSERT INTO `app_user` VALUES (116, 'S00000089', '鞠帅', '123456', 'https://picsum.photos/200/200?random=89', 153.2, 47.8, '2025-06-13 00:00:00', '2025-06-01 00:00:00', '2025-06-19 00:00:00');
INSERT INTO `app_user` VALUES (117, 'S00000090', '王桂英', '123456', 'https://picsum.photos/200/200?random=90', 156, 67.6, '2025-06-17 00:00:00', '2025-06-04 00:00:00', '2025-06-21 00:00:00');
INSERT INTO `app_user` VALUES (118, 'S00000091', '陈秀梅', '123456', 'https://picsum.photos/200/200?random=91', 153.2, 47.7, '2025-03-06 00:00:00', '2025-02-16 00:00:00', '2025-02-18 00:00:00');
INSERT INTO `app_user` VALUES (119, 'S00000092', '张华', '123456', 'https://picsum.photos/200/200?random=92', 168.2, 79.5, '2025-03-25 00:00:00', '2025-03-22 00:00:00', '2025-04-21 00:00:00');
INSERT INTO `app_user` VALUES (120, 'S00000093', '赵平', '123456', 'https://picsum.photos/200/200?random=93', 189.8, 60.4, '2025-06-04 00:00:00', '2025-05-23 00:00:00', '2025-05-25 00:00:00');
INSERT INTO `app_user` VALUES (121, 'S00000094', '周欣', '123456', 'https://picsum.photos/200/200?random=94', 171.3, 87.1, '2025-04-18 00:00:00', '2025-03-24 00:00:00', '2025-04-21 00:00:00');
INSERT INTO `app_user` VALUES (122, 'S00000095', '周明', '123456', 'https://picsum.photos/200/200?random=95', 181.3, 45.9, '2025-04-20 00:00:00', '2025-04-13 00:00:00', '2025-04-23 00:00:00');
INSERT INTO `app_user` VALUES (123, 'S00000096', '曹兰英', '123456', 'https://picsum.photos/200/200?random=96', 175.9, 45.9, '2025-05-13 00:00:00', '2025-05-06 00:00:00', '2025-05-17 00:00:00');
INSERT INTO `app_user` VALUES (124, 'S00000097', '应宇', '123456', 'https://picsum.photos/200/200?random=97', 166.5, 63.3, '2025-05-27 00:00:00', '2025-05-04 00:00:00', '2025-05-28 00:00:00');
INSERT INTO `app_user` VALUES (125, 'S00000098', '张红霞', '123456', 'https://picsum.photos/200/200?random=98', 154.3, 87.5, '2025-05-27 00:00:00', '2025-05-05 00:00:00', '2025-05-06 00:00:00');
INSERT INTO `app_user` VALUES (126, 'S00000099', '张辉', '123456', 'https://picsum.photos/200/200?random=99', 151.9, 55.5, '2025-02-19 00:00:00', '2025-01-23 00:00:00', '2025-02-08 00:00:00');
INSERT INTO `app_user` VALUES (127, 'S00000100', '刘艳', '123456', 'https://picsum.photos/200/200?random=100', 184.5, 84.9, '2025-06-24 00:00:00', '2025-06-20 00:00:00', '2025-07-05 00:00:00');
INSERT INTO `app_user` VALUES (128, 'S00000101', '李淑兰', '123456', 'https://picsum.photos/200/200?random=101', 175, 52.2, '2025-01-11 00:00:00', '2025-01-01 00:00:00', '2025-01-28 00:00:00');
INSERT INTO `app_user` VALUES (129, 'S00000102', '张海燕', '123456', 'https://picsum.photos/200/200?random=102', 188, 79.8, '2025-06-23 00:00:00', '2025-06-05 00:00:00', '2025-06-23 00:00:00');
INSERT INTO `app_user` VALUES (130, 'S00000103', '唐辉', '123456', 'https://picsum.photos/200/200?random=103', 175.4, 45.3, '2025-07-07 00:00:00', '2025-06-30 00:00:00', '2025-07-27 00:00:00');
INSERT INTO `app_user` VALUES (131, 'S00000104', '姚飞', '123456', 'https://picsum.photos/200/200?random=104', 164, 86.6, '2025-03-27 00:00:00', '2025-03-12 00:00:00', '2025-04-02 00:00:00');
INSERT INTO `app_user` VALUES (132, 'S00000105', '毛志强', '123456', 'https://picsum.photos/200/200?random=105', 154.5, 44.9, '2025-04-25 00:00:00', '2025-04-06 00:00:00', '2025-04-18 00:00:00');
INSERT INTO `app_user` VALUES (133, 'S00000106', '杜建国', '123456', 'https://picsum.photos/200/200?random=106', 172.4, 71.5, '2025-03-03 00:00:00', '2025-02-08 00:00:00', '2025-02-28 00:00:00');
INSERT INTO `app_user` VALUES (134, 'S00000107', '徐波', '123456', 'https://picsum.photos/200/200?random=107', 170.3, 68.9, '2025-03-25 00:00:00', '2025-03-05 00:00:00', '2025-03-18 00:00:00');
INSERT INTO `app_user` VALUES (135, 'S00000108', '张凯', '123456', 'https://picsum.photos/200/200?random=108', 166.3, 71, '2025-05-21 00:00:00', '2025-05-16 00:00:00', '2025-05-27 00:00:00');
INSERT INTO `app_user` VALUES (136, 'S00000109', '姜燕', '123456', 'https://picsum.photos/200/200?random=109', 178.6, 52.6, '2025-03-01 00:00:00', '2025-02-14 00:00:00', '2025-02-25 00:00:00');
INSERT INTO `app_user` VALUES (137, 'S00000110', '王东', '123456', 'https://picsum.photos/200/200?random=110', 151.5, 44.1, '2025-02-02 00:00:00', '2025-01-24 00:00:00', '2025-02-13 00:00:00');
INSERT INTO `app_user` VALUES (138, 'S00000111', '胡秀英', '123456', 'https://picsum.photos/200/200?random=111', 173.2, 52.5, '2025-07-16 00:00:00', '2025-06-29 00:00:00', '2025-07-11 00:00:00');
INSERT INTO `app_user` VALUES (139, 'S00000112', '李淑兰', '123456', 'https://picsum.photos/200/200?random=112', 155.4, 60.6, '2025-06-22 00:00:00', '2025-05-24 00:00:00', '2025-06-06 00:00:00');
INSERT INTO `app_user` VALUES (140, 'S00000113', '李玉梅', '123456', 'https://picsum.photos/200/200?random=113', 162.5, 53.2, '2025-03-04 00:00:00', '2025-02-24 00:00:00', '2025-03-03 00:00:00');
INSERT INTO `app_user` VALUES (141, 'S00000114', '吴玉珍', '123456', 'https://picsum.photos/200/200?random=114', 186.7, 51.5, '2025-05-28 00:00:00', '2025-05-09 00:00:00', '2025-05-28 00:00:00');
INSERT INTO `app_user` VALUES (142, 'S00000115', '李明', '123456', 'https://picsum.photos/200/200?random=115', 155.2, 82.4, '2025-04-14 00:00:00', '2025-03-30 00:00:00', '2025-04-10 00:00:00');
INSERT INTO `app_user` VALUES (143, 'S00000116', '鲁玉华', '123456', 'https://picsum.photos/200/200?random=116', 177.7, 64, '2025-07-01 00:00:00', '2025-06-02 00:00:00', '2025-06-19 00:00:00');
INSERT INTO `app_user` VALUES (144, 'S00000117', '吉瑞', '123456', 'https://picsum.photos/200/200?random=117', 154.3, 77.8, '2025-06-11 00:00:00', '2025-06-05 00:00:00', '2025-06-24 00:00:00');
INSERT INTO `app_user` VALUES (145, 'S00000118', '姚红霞', '123456', 'https://picsum.photos/200/200?random=118', 152.3, 54.8, '2025-05-25 00:00:00', '2025-05-18 00:00:00', '2025-05-25 00:00:00');
INSERT INTO `app_user` VALUES (146, 'S00000119', '洪秀梅', '123456', 'https://picsum.photos/200/200?random=119', 151.2, 59.6, '2025-06-12 00:00:00', '2025-05-19 00:00:00', '2025-05-22 00:00:00');
INSERT INTO `app_user` VALUES (147, 'S00000120', '焦淑兰', '123456', 'https://picsum.photos/200/200?random=120', 176.3, 76.1, '2025-03-31 00:00:00', '2025-03-13 00:00:00', '2025-03-20 00:00:00');
INSERT INTO `app_user` VALUES (148, 'S00000121', '张欢', '123456', 'https://picsum.photos/200/200?random=121', 155.6, 78.7, '2025-04-23 00:00:00', '2025-04-09 00:00:00', '2025-05-03 00:00:00');
INSERT INTO `app_user` VALUES (149, 'S00000122', '曹欢', '123456', 'https://picsum.photos/200/200?random=122', 188.9, 55.8, '2025-06-01 00:00:00', '2025-05-07 00:00:00', '2025-05-10 00:00:00');
INSERT INTO `app_user` VALUES (150, 'S00000123', '张桂芳', '123456', 'https://picsum.photos/200/200?random=123', 160.8, 85.8, '2025-06-28 00:00:00', '2025-06-08 00:00:00', '2025-07-08 00:00:00');
INSERT INTO `app_user` VALUES (151, 'S00000124', '罗伟', '123456', 'https://picsum.photos/200/200?random=124', 166.7, 40.7, '2025-06-21 00:00:00', '2025-05-29 00:00:00', '2025-06-12 00:00:00');
INSERT INTO `app_user` VALUES (152, 'S00000125', '朱帅', '123456', 'https://picsum.photos/200/200?random=125', 155.8, 57.4, '2025-05-01 00:00:00', '2025-04-28 00:00:00', '2025-05-26 00:00:00');
INSERT INTO `app_user` VALUES (153, 'S00000126', '杨鑫', '123456', 'https://picsum.photos/200/200?random=126', 189.6, 78, '2025-06-26 00:00:00', '2025-06-04 00:00:00', '2025-06-29 00:00:00');
INSERT INTO `app_user` VALUES (154, 'S00000127', '李帅', '123456', 'https://picsum.photos/200/200?random=127', 177.7, 41.5, '2025-02-26 00:00:00', '2025-02-01 00:00:00', '2025-02-17 00:00:00');
INSERT INTO `app_user` VALUES (155, 'S00000128', '刘秀兰', '123456', 'https://picsum.photos/200/200?random=128', 164.6, 71, '2025-06-17 00:00:00', '2025-05-25 00:00:00', '2025-06-01 00:00:00');
INSERT INTO `app_user` VALUES (156, 'S00000129', '江晨', '123456', 'https://picsum.photos/200/200?random=129', 151.6, 50.2, '2025-06-17 00:00:00', '2025-05-28 00:00:00', '2025-06-10 00:00:00');
INSERT INTO `app_user` VALUES (157, 'S00000130', '常丽', '123456', 'https://picsum.photos/200/200?random=130', 161.9, 67, '2025-03-15 00:00:00', '2025-03-14 00:00:00', '2025-04-11 00:00:00');
INSERT INTO `app_user` VALUES (158, 'S00000131', '杨旭', '123456', 'https://picsum.photos/200/200?random=131', 157.2, 63.7, '2025-01-17 00:00:00', '2025-01-04 00:00:00', '2025-01-12 00:00:00');
INSERT INTO `app_user` VALUES (159, 'S00000132', '张秀梅', '123456', 'https://picsum.photos/200/200?random=132', 178.6, 85.2, '2025-03-23 00:00:00', '2025-02-21 00:00:00', '2025-03-20 00:00:00');
INSERT INTO `app_user` VALUES (160, 'S00000133', '阎洁', '123456', 'https://picsum.photos/200/200?random=133', 189.8, 62.3, '2025-03-14 00:00:00', '2025-02-16 00:00:00', '2025-02-23 00:00:00');
INSERT INTO `app_user` VALUES (161, 'S00000134', '余桂英', '123456', 'https://picsum.photos/200/200?random=134', 180.7, 55.4, '2025-02-05 00:00:00', '2025-02-04 00:00:00', '2025-02-24 00:00:00');
INSERT INTO `app_user` VALUES (162, 'S00000135', '傅旭', '123456', 'https://picsum.photos/200/200?random=135', 174.7, 49.2, '2025-03-12 00:00:00', '2025-03-09 00:00:00', '2025-04-07 00:00:00');
INSERT INTO `app_user` VALUES (163, 'S00000136', '王刚', '123456', 'https://picsum.photos/200/200?random=136', 188.3, 66.3, '2025-04-02 00:00:00', '2025-03-14 00:00:00', '2025-03-20 00:00:00');
INSERT INTO `app_user` VALUES (164, 'S00000137', '尚刚', '123456', 'https://picsum.photos/200/200?random=137', 158.5, 78.4, '2025-05-22 00:00:00', '2025-05-03 00:00:00', '2025-05-24 00:00:00');
INSERT INTO `app_user` VALUES (165, 'S00000138', '封强', '123456', 'https://picsum.photos/200/200?random=138', 183, 88, '2025-03-27 00:00:00', '2025-03-23 00:00:00', '2025-03-31 00:00:00');
INSERT INTO `app_user` VALUES (166, 'S00000139', '张瑞', '123456', 'https://picsum.photos/200/200?random=139', 185.6, 89.3, '2025-04-10 00:00:00', '2025-04-07 00:00:00', '2025-04-18 00:00:00');
INSERT INTO `app_user` VALUES (167, 'S00000140', '周冬梅', '123456', 'https://picsum.photos/200/200?random=140', 165.7, 88.1, '2025-04-20 00:00:00', '2025-03-24 00:00:00', '2025-04-17 00:00:00');
INSERT INTO `app_user` VALUES (168, 'S00000141', '马志强', '123456', 'https://picsum.photos/200/200?random=141', 166.3, 58.3, '2025-05-03 00:00:00', '2025-04-08 00:00:00', '2025-04-21 00:00:00');
INSERT INTO `app_user` VALUES (169, 'S00000142', '高鑫', '123456', 'https://picsum.photos/200/200?random=142', 165.8, 61, '2025-07-06 00:00:00', '2025-06-15 00:00:00', '2025-06-27 00:00:00');
INSERT INTO `app_user` VALUES (170, 'S00000143', '顾丽华', '123456', 'https://picsum.photos/200/200?random=143', 183.1, 69.9, '2025-04-22 00:00:00', '2025-03-25 00:00:00', '2025-04-22 00:00:00');
INSERT INTO `app_user` VALUES (171, 'S00000144', '李明', '123456', 'https://picsum.photos/200/200?random=144', 188.1, 50.9, '2025-04-15 00:00:00', '2025-04-01 00:00:00', '2025-04-08 00:00:00');
INSERT INTO `app_user` VALUES (172, 'S00000145', '高杰', '123456', 'https://picsum.photos/200/200?random=145', 168.8, 59, '2025-06-11 00:00:00', '2025-05-24 00:00:00', '2025-05-26 00:00:00');
INSERT INTO `app_user` VALUES (173, 'S00000146', '周晶', '123456', 'https://picsum.photos/200/200?random=146', 168, 43.6, '2025-05-07 00:00:00', '2025-05-06 00:00:00', '2025-05-07 00:00:00');
INSERT INTO `app_user` VALUES (174, 'S00000147', '贾玉兰', '123456', 'https://picsum.photos/200/200?random=147', 169.7, 44.6, '2025-04-30 00:00:00', '2025-04-08 00:00:00', '2025-04-26 00:00:00');
INSERT INTO `app_user` VALUES (175, 'S00000148', '张建军', '123456', 'https://picsum.photos/200/200?random=148', 157.4, 83.1, '2025-07-09 00:00:00', '2025-06-18 00:00:00', '2025-06-24 00:00:00');
INSERT INTO `app_user` VALUES (176, 'S00000149', '庞东', '123456', 'https://picsum.photos/200/200?random=149', 156.8, 87.7, '2025-06-27 00:00:00', '2025-06-24 00:00:00', '2025-06-26 00:00:00');
INSERT INTO `app_user` VALUES (177, 'S00000150', '赵玉梅', '123456', 'https://picsum.photos/200/200?random=150', 181.9, 85.7, '2025-05-08 00:00:00', '2025-04-21 00:00:00', '2025-05-16 00:00:00');
INSERT INTO `app_user` VALUES (178, 'S00000151', '李波', '123456', 'https://picsum.photos/200/200?random=151', 180.8, 74.2, '2025-07-09 00:00:00', '2025-06-14 00:00:00', '2025-07-03 00:00:00');
INSERT INTO `app_user` VALUES (179, 'S00000152', '李畅', '123456', 'https://picsum.photos/200/200?random=152', 163.5, 71.8, '2025-04-24 00:00:00', '2025-04-10 00:00:00', '2025-04-16 00:00:00');
INSERT INTO `app_user` VALUES (180, 'S00000153', '费强', '123456', 'https://picsum.photos/200/200?random=153', 187.9, 87.4, '2025-04-25 00:00:00', '2025-04-19 00:00:00', '2025-04-22 00:00:00');
INSERT INTO `app_user` VALUES (181, 'S00000154', '邓秀梅', '123456', 'https://picsum.photos/200/200?random=154', 188, 50.5, '2025-02-05 00:00:00', '2025-01-15 00:00:00', '2025-01-22 00:00:00');
INSERT INTO `app_user` VALUES (182, 'S00000155', '单海燕', '123456', 'https://picsum.photos/200/200?random=155', 181.2, 54.1, '2025-05-12 00:00:00', '2025-04-28 00:00:00', '2025-05-26 00:00:00');
INSERT INTO `app_user` VALUES (183, 'S00000156', '陈杰', '123456', 'https://picsum.photos/200/200?random=156', 166.7, 56.8, '2025-03-11 00:00:00', '2025-02-14 00:00:00', '2025-03-07 00:00:00');
INSERT INTO `app_user` VALUES (184, 'S00000157', '程慧', '123456', 'https://picsum.photos/200/200?random=157', 158.1, 56, '2025-02-21 00:00:00', '2025-02-06 00:00:00', '2025-02-28 00:00:00');
INSERT INTO `app_user` VALUES (185, 'S00000158', '陈静', '123456', 'https://picsum.photos/200/200?random=158', 178.1, 41.6, '2025-04-09 00:00:00', '2025-04-01 00:00:00', '2025-04-21 00:00:00');
INSERT INTO `app_user` VALUES (186, 'S00000159', '项畅', '123456', 'https://picsum.photos/200/200?random=159', 164.7, 50.9, '2025-06-11 00:00:00', '2025-06-04 00:00:00', '2025-06-27 00:00:00');
INSERT INTO `app_user` VALUES (187, 'S00000160', '陈成', '123456', 'https://picsum.photos/200/200?random=160', 167.8, 59.4, '2025-06-16 00:00:00', '2025-05-27 00:00:00', '2025-06-01 00:00:00');
INSERT INTO `app_user` VALUES (188, 'S00000161', '陈雷', '123456', 'https://picsum.photos/200/200?random=161', 167.8, 54.3, '2025-04-19 00:00:00', '2025-04-01 00:00:00', '2025-04-20 00:00:00');
INSERT INTO `app_user` VALUES (189, 'S00000162', '邱燕', '123456', 'https://picsum.photos/200/200?random=162', 174.2, 62.4, '2025-03-29 00:00:00', '2025-03-15 00:00:00', '2025-03-21 00:00:00');
INSERT INTO `app_user` VALUES (190, 'S00000163', '吕欣', '123456', 'https://picsum.photos/200/200?random=163', 161, 54.6, '2025-05-02 00:00:00', '2025-04-07 00:00:00', '2025-05-04 00:00:00');
INSERT INTO `app_user` VALUES (191, 'S00000164', '徐平', '123456', 'https://picsum.photos/200/200?random=164', 176, 41.7, '2025-06-28 00:00:00', '2025-06-18 00:00:00', '2025-07-13 00:00:00');
INSERT INTO `app_user` VALUES (192, 'S00000165', '张超', '123456', 'https://picsum.photos/200/200?random=165', 156.3, 74, '2025-06-01 00:00:00', '2025-05-14 00:00:00', '2025-06-08 00:00:00');
INSERT INTO `app_user` VALUES (193, 'S00000166', '蒋畅', '123456', 'https://picsum.photos/200/200?random=166', 158.5, 88, '2025-04-22 00:00:00', '2025-04-05 00:00:00', '2025-04-08 00:00:00');
INSERT INTO `app_user` VALUES (194, 'S00000167', '崔颖', '123456', 'https://picsum.photos/200/200?random=167', 177.5, 87.3, '2025-03-13 00:00:00', '2025-02-22 00:00:00', '2025-03-21 00:00:00');
INSERT INTO `app_user` VALUES (195, 'S00000168', '丁明', '123456', 'https://picsum.photos/200/200?random=168', 166, 58.3, '2025-04-15 00:00:00', '2025-03-27 00:00:00', '2025-04-15 00:00:00');
INSERT INTO `app_user` VALUES (196, 'S00000169', '张小红', '123456', 'https://picsum.photos/200/200?random=169', 153.3, 87.5, '2025-05-07 00:00:00', '2025-04-26 00:00:00', '2025-05-23 00:00:00');
INSERT INTO `app_user` VALUES (197, 'S00000170', '曾博', '123456', 'https://picsum.photos/200/200?random=170', 160.4, 70.2, '2025-05-26 00:00:00', '2025-05-03 00:00:00', '2025-06-01 00:00:00');
INSERT INTO `app_user` VALUES (198, 'S00000171', '施辉', '123456', 'https://picsum.photos/200/200?random=171', 178, 55.6, '2025-06-13 00:00:00', '2025-06-08 00:00:00', '2025-07-05 00:00:00');
INSERT INTO `app_user` VALUES (199, 'S00000172', '谢建', '123456', 'https://picsum.photos/200/200?random=172', 156.4, 54.3, '2025-03-21 00:00:00', '2025-02-22 00:00:00', '2025-03-07 00:00:00');
INSERT INTO `app_user` VALUES (200, 'S00000173', '李娜', '123456', 'https://picsum.photos/200/200?random=173', 174, 47.7, '2025-03-06 00:00:00', '2025-03-02 00:00:00', '2025-03-22 00:00:00');
INSERT INTO `app_user` VALUES (201, 'S00000174', '郭芳', '123456', 'https://picsum.photos/200/200?random=174', 159.6, 68.9, '2025-05-16 00:00:00', '2025-04-22 00:00:00', '2025-05-06 00:00:00');
INSERT INTO `app_user` VALUES (202, 'S00000175', '王欢', '123456', 'https://picsum.photos/200/200?random=175', 156.1, 75.2, '2025-07-13 00:00:00', '2025-06-13 00:00:00', '2025-06-21 00:00:00');
INSERT INTO `app_user` VALUES (203, 'S00000176', '王倩', '123456', 'https://picsum.photos/200/200?random=176', 164.7, 40.1, '2025-07-06 00:00:00', '2025-06-20 00:00:00', '2025-07-07 00:00:00');
INSERT INTO `app_user` VALUES (204, 'S00000177', '刘秀英', '123456', 'https://picsum.photos/200/200?random=177', 184.1, 64.6, '2025-02-03 00:00:00', '2025-01-08 00:00:00', '2025-01-25 00:00:00');
INSERT INTO `app_user` VALUES (205, 'S00000178', '常峰', '123456', 'https://picsum.photos/200/200?random=178', 160.8, 41.1, '2025-02-12 00:00:00', '2025-02-10 00:00:00', '2025-03-01 00:00:00');
INSERT INTO `app_user` VALUES (206, 'S00000179', '白慧', '123456', 'https://picsum.photos/200/200?random=179', 185.7, 47, '2025-01-13 00:00:00', '2025-01-03 00:00:00', '2025-01-04 00:00:00');
INSERT INTO `app_user` VALUES (207, 'S00000180', '韩鑫', '123456', 'https://picsum.photos/200/200?random=180', 176.2, 65.6, '2025-04-29 00:00:00', '2025-04-21 00:00:00', '2025-04-22 00:00:00');
INSERT INTO `app_user` VALUES (208, 'S00000181', '宋慧', '123456', 'https://picsum.photos/200/200?random=181', 150.6, 50, '2025-01-08 00:00:00', '2025-01-05 00:00:00', '2025-01-27 00:00:00');
INSERT INTO `app_user` VALUES (209, 'S00000182', '马杰', '123456', 'https://picsum.photos/200/200?random=182', 182.1, 73.1, '2025-04-03 00:00:00', '2025-03-05 00:00:00', '2025-03-23 00:00:00');
INSERT INTO `app_user` VALUES (210, 'S00000183', '常丹', '123456', 'https://picsum.photos/200/200?random=183', 154.6, 67.2, '2025-05-02 00:00:00', '2025-04-22 00:00:00', '2025-05-20 00:00:00');
INSERT INTO `app_user` VALUES (211, 'S00000184', '滕霞', '123456', 'https://picsum.photos/200/200?random=184', 153.1, 54.7, '2025-03-13 00:00:00', '2025-02-26 00:00:00', '2025-03-11 00:00:00');
INSERT INTO `app_user` VALUES (212, 'S00000185', '陈辉', '123456', 'https://picsum.photos/200/200?random=185', 167.5, 84.7, '2025-05-28 00:00:00', '2025-05-03 00:00:00', '2025-05-13 00:00:00');
INSERT INTO `app_user` VALUES (213, 'S00000186', '万秀荣', '123456', 'https://picsum.photos/200/200?random=186', 184.2, 71.9, '2025-03-28 00:00:00', '2025-03-17 00:00:00', '2025-03-30 00:00:00');
INSERT INTO `app_user` VALUES (214, 'S00000187', '张志强', '123456', 'https://picsum.photos/200/200?random=187', 165.9, 73, '2025-02-28 00:00:00', '2025-02-11 00:00:00', '2025-03-09 00:00:00');
INSERT INTO `app_user` VALUES (215, 'S00000188', '徐鹏', '123456', 'https://picsum.photos/200/200?random=188', 162.3, 44.3, '2025-02-06 00:00:00', '2025-01-19 00:00:00', '2025-01-27 00:00:00');
INSERT INTO `app_user` VALUES (216, 'S00000189', '戴玉珍', '123456', 'https://picsum.photos/200/200?random=189', 183.5, 48.9, '2025-04-17 00:00:00', '2025-04-14 00:00:00', '2025-04-25 00:00:00');
INSERT INTO `app_user` VALUES (217, 'S00000190', '苏红梅', '123456', 'https://picsum.photos/200/200?random=190', 189.6, 89.9, '2025-04-01 00:00:00', '2025-03-09 00:00:00', '2025-03-23 00:00:00');
INSERT INTO `app_user` VALUES (218, 'S00000191', '郭琴', '123456', 'https://picsum.photos/200/200?random=191', 155.5, 74.5, '2025-07-12 00:00:00', '2025-06-17 00:00:00', '2025-07-13 00:00:00');
INSERT INTO `app_user` VALUES (219, 'S00000192', '赵丽', '123456', 'https://picsum.photos/200/200?random=192', 189.1, 77.8, '2025-01-23 00:00:00', '2025-01-20 00:00:00', '2025-02-18 00:00:00');
INSERT INTO `app_user` VALUES (220, 'S00000193', '裴刚', '123456', 'https://picsum.photos/200/200?random=193', 162.9, 48.9, '2025-05-14 00:00:00', '2025-05-09 00:00:00', '2025-05-25 00:00:00');
INSERT INTO `app_user` VALUES (221, 'S00000194', '马晨', '123456', 'https://picsum.photos/200/200?random=194', 155, 86.4, '2025-07-23 00:00:00', '2025-06-30 00:00:00', '2025-07-13 00:00:00');
INSERT INTO `app_user` VALUES (222, 'S00000195', '李丹', '123456', 'https://picsum.photos/200/200?random=195', 164.4, 53.1, '2025-04-05 00:00:00', '2025-03-22 00:00:00', '2025-03-25 00:00:00');
INSERT INTO `app_user` VALUES (223, 'S00000196', '刘桂兰', '123456', 'https://picsum.photos/200/200?random=196', 179.4, 65.9, '2025-03-27 00:00:00', '2025-03-01 00:00:00', '2025-03-22 00:00:00');
INSERT INTO `app_user` VALUES (224, 'S00000197', '尚燕', '123456', 'https://picsum.photos/200/200?random=197', 153.7, 89.6, '2025-03-26 00:00:00', '2025-03-21 00:00:00', '2025-04-15 00:00:00');
INSERT INTO `app_user` VALUES (225, 'S00000198', '黄红梅', '123456', 'https://picsum.photos/200/200?random=198', 175.5, 56.6, '2025-03-27 00:00:00', '2025-03-19 00:00:00', '2025-04-12 00:00:00');
INSERT INTO `app_user` VALUES (226, 'S00000199', '蒲玉英', '123456', 'https://picsum.photos/200/200?random=199', 176.3, 50.1, '2025-03-07 00:00:00', '2025-03-01 00:00:00', '2025-03-02 00:00:00');
INSERT INTO `app_user` VALUES (227, 'S00000200', '王璐', '123456', 'https://picsum.photos/200/200?random=200', 181.7, 86.3, '2025-03-22 00:00:00', '2025-02-25 00:00:00', '2025-03-21 00:00:00');
INSERT INTO `app_user` VALUES (228, 'S00000201', '朱秀英', '123456', 'https://picsum.photos/200/200?random=201', 164.8, 57.3, '2025-03-05 00:00:00', '2025-02-11 00:00:00', '2025-02-22 00:00:00');
INSERT INTO `app_user` VALUES (229, 'S00000202', '林婷婷', '123456', 'https://picsum.photos/200/200?random=202', 189.8, 47.3, '2025-06-16 00:00:00', '2025-05-30 00:00:00', '2025-06-06 00:00:00');
INSERT INTO `app_user` VALUES (230, 'S00000203', '谢凯', '123456', 'https://picsum.photos/200/200?random=203', 153.3, 87.6, '2025-06-06 00:00:00', '2025-05-15 00:00:00', '2025-06-04 00:00:00');
INSERT INTO `app_user` VALUES (231, 'S00000204', '朱红', '123456', 'https://picsum.photos/200/200?random=204', 171.2, 41.2, '2025-02-13 00:00:00', '2025-01-19 00:00:00', '2025-02-10 00:00:00');
INSERT INTO `app_user` VALUES (232, 'S00000205', '顾秀华', '123456', 'https://picsum.photos/200/200?random=205', 158.1, 70.5, '2025-03-15 00:00:00', '2025-03-03 00:00:00', '2025-03-24 00:00:00');
INSERT INTO `app_user` VALUES (233, 'S00000206', '程楠', '123456', 'https://picsum.photos/200/200?random=206', 172.8, 46.3, '2025-06-23 00:00:00', '2025-06-11 00:00:00', '2025-06-29 00:00:00');
INSERT INTO `app_user` VALUES (234, 'S00000207', '展晨', '123456', 'https://picsum.photos/200/200?random=207', 157.8, 71.2, '2025-01-27 00:00:00', '2025-01-07 00:00:00', '2025-01-10 00:00:00');
INSERT INTO `app_user` VALUES (235, 'S00000208', '路凤兰', '123456', 'https://picsum.photos/200/200?random=208', 168.2, 70.5, '2025-04-03 00:00:00', '2025-03-06 00:00:00', '2025-04-05 00:00:00');
INSERT INTO `app_user` VALUES (236, 'S00000209', '浦成', '123456', 'https://picsum.photos/200/200?random=209', 154.9, 81.7, '2025-03-09 00:00:00', '2025-02-14 00:00:00', '2025-02-20 00:00:00');
INSERT INTO `app_user` VALUES (237, 'S00000210', '吴淑珍', '123456', 'https://picsum.photos/200/200?random=210', 186.5, 60.1, '2025-04-09 00:00:00', '2025-03-28 00:00:00', '2025-04-26 00:00:00');
INSERT INTO `app_user` VALUES (238, 'S00000211', '施玉华', '123456', 'https://picsum.photos/200/200?random=211', 150.1, 53.4, '2025-03-31 00:00:00', '2025-03-24 00:00:00', '2025-04-11 00:00:00');
INSERT INTO `app_user` VALUES (239, 'S00000212', '张雪', '123456', 'https://picsum.photos/200/200?random=212', 160.6, 73.3, '2025-01-23 00:00:00', '2025-01-18 00:00:00', '2025-02-10 00:00:00');
INSERT INTO `app_user` VALUES (240, 'S00000213', '卢瑜', '123456', 'https://picsum.photos/200/200?random=213', 156.4, 64.5, '2025-06-24 00:00:00', '2025-06-03 00:00:00', '2025-06-07 00:00:00');
INSERT INTO `app_user` VALUES (241, 'S00000214', '张明', '123456', 'https://picsum.photos/200/200?random=214', 150.2, 57.1, '2025-03-03 00:00:00', '2025-02-24 00:00:00', '2025-03-12 00:00:00');
INSERT INTO `app_user` VALUES (242, 'S00000215', '谭辉', '123456', 'https://picsum.photos/200/200?random=215', 171, 87.3, '2025-06-21 00:00:00', '2025-06-03 00:00:00', '2025-06-06 00:00:00');
INSERT INTO `app_user` VALUES (243, 'S00000216', '钟芳', '123456', 'https://picsum.photos/200/200?random=216', 168.5, 65.1, '2025-07-10 00:00:00', '2025-06-15 00:00:00', '2025-06-18 00:00:00');
INSERT INTO `app_user` VALUES (244, 'S00000217', '祁荣', '123456', 'https://picsum.photos/200/200?random=217', 174.9, 76.3, '2025-06-16 00:00:00', '2025-05-17 00:00:00', '2025-05-19 00:00:00');
INSERT INTO `app_user` VALUES (245, 'S00000218', '贾艳', '123456', 'https://picsum.photos/200/200?random=218', 165.5, 83.7, '2025-03-19 00:00:00', '2025-03-01 00:00:00', '2025-03-14 00:00:00');
INSERT INTO `app_user` VALUES (246, 'S00000219', '吴岩', '123456', 'https://picsum.photos/200/200?random=219', 150.5, 86, '2025-03-03 00:00:00', '2025-02-27 00:00:00', '2025-03-14 00:00:00');
INSERT INTO `app_user` VALUES (247, 'S00000220', '陈磊', '123456', 'https://picsum.photos/200/200?random=220', 161.8, 67.3, '2025-05-07 00:00:00', '2025-04-19 00:00:00', '2025-04-24 00:00:00');
INSERT INTO `app_user` VALUES (248, 'S00000221', '李帆', '123456', 'https://picsum.photos/200/200?random=221', 155.1, 58.9, '2025-07-06 00:00:00', '2025-06-15 00:00:00', '2025-06-19 00:00:00');
INSERT INTO `app_user` VALUES (249, 'S00000222', '何荣', '123456', 'https://picsum.photos/200/200?random=222', 171.1, 68.5, '2025-07-11 00:00:00', '2025-06-30 00:00:00', '2025-07-04 00:00:00');
INSERT INTO `app_user` VALUES (250, 'S00000223', '王建国', '123456', 'https://picsum.photos/200/200?random=223', 189, 67, '2025-03-16 00:00:00', '2025-03-02 00:00:00', '2025-03-08 00:00:00');
INSERT INTO `app_user` VALUES (251, 'S00000224', '徐想', '123456', 'https://picsum.photos/200/200?random=224', 169, 72.2, '2025-04-09 00:00:00', '2025-03-26 00:00:00', '2025-04-03 00:00:00');
INSERT INTO `app_user` VALUES (252, 'S00000225', '顾燕', '123456', 'https://picsum.photos/200/200?random=225', 161.9, 74.3, '2025-02-22 00:00:00', '2025-02-19 00:00:00', '2025-02-26 00:00:00');
INSERT INTO `app_user` VALUES (253, 'S00000226', '王建军', '123456', 'https://picsum.photos/200/200?random=226', 163.2, 48.7, '2025-05-25 00:00:00', '2025-05-16 00:00:00', '2025-06-07 00:00:00');
INSERT INTO `app_user` VALUES (254, 'S00000227', '高云', '123456', 'https://picsum.photos/200/200?random=227', 189.4, 40.7, '2025-03-22 00:00:00', '2025-02-24 00:00:00', '2025-03-23 00:00:00');
INSERT INTO `app_user` VALUES (255, 'S00000228', '刘颖', '123456', 'https://picsum.photos/200/200?random=228', 153.3, 84.9, '2025-02-15 00:00:00', '2025-01-28 00:00:00', '2025-02-06 00:00:00');
INSERT INTO `app_user` VALUES (256, 'S00000229', '苏冬梅', '123456', 'https://picsum.photos/200/200?random=229', 178.4, 61.7, '2025-06-26 00:00:00', '2025-06-07 00:00:00', '2025-07-02 00:00:00');
INSERT INTO `app_user` VALUES (257, 'S00000230', '黄明', '123456', 'https://picsum.photos/200/200?random=230', 163.5, 74.8, '2025-03-06 00:00:00', '2025-02-12 00:00:00', '2025-02-28 00:00:00');
INSERT INTO `app_user` VALUES (258, 'S00000231', '陈玉梅', '123456', 'https://picsum.photos/200/200?random=231', 161.9, 81.2, '2025-04-10 00:00:00', '2025-04-06 00:00:00', '2025-04-18 00:00:00');
INSERT INTO `app_user` VALUES (259, 'S00000232', '关桂荣', '123456', 'https://picsum.photos/200/200?random=232', 187, 47.6, '2025-06-03 00:00:00', '2025-05-24 00:00:00', '2025-05-30 00:00:00');
INSERT INTO `app_user` VALUES (260, 'S00000233', '李秀芳', '123456', 'https://picsum.photos/200/200?random=233', 179.6, 60.2, '2025-07-06 00:00:00', '2025-06-06 00:00:00', '2025-07-01 00:00:00');
INSERT INTO `app_user` VALUES (261, 'S00000234', '朱婷', '123456', 'https://picsum.photos/200/200?random=234', 169.3, 41.6, '2025-06-23 00:00:00', '2025-05-24 00:00:00', '2025-06-10 00:00:00');
INSERT INTO `app_user` VALUES (262, 'S00000235', '高丽丽', '123456', 'https://picsum.photos/200/200?random=235', 177.2, 83.8, '2025-03-11 00:00:00', '2025-03-06 00:00:00', '2025-03-21 00:00:00');
INSERT INTO `app_user` VALUES (263, 'S00000236', '周荣', '123456', 'https://picsum.photos/200/200?random=236', 164, 77.7, '2025-04-19 00:00:00', '2025-03-20 00:00:00', '2025-03-30 00:00:00');
INSERT INTO `app_user` VALUES (264, 'S00000237', '丁玉珍', '123456', 'https://picsum.photos/200/200?random=237', 177.5, 83.4, '2025-05-05 00:00:00', '2025-04-15 00:00:00', '2025-05-09 00:00:00');
INSERT INTO `app_user` VALUES (265, 'S00000238', '郭军', '123456', 'https://picsum.photos/200/200?random=238', 169.6, 42.7, '2025-03-03 00:00:00', '2025-02-07 00:00:00', '2025-02-26 00:00:00');
INSERT INTO `app_user` VALUES (266, 'S00000239', '刘兵', '123456', 'https://picsum.photos/200/200?random=239', 179.8, 61.1, '2025-02-27 00:00:00', '2025-02-12 00:00:00', '2025-02-13 00:00:00');
INSERT INTO `app_user` VALUES (267, 'S00000240', '安涛', '123456', 'https://picsum.photos/200/200?random=240', 160.5, 64.6, '2025-05-17 00:00:00', '2025-05-15 00:00:00', '2025-06-01 00:00:00');
INSERT INTO `app_user` VALUES (268, 'S00000241', '白桂兰', '123456', 'https://picsum.photos/200/200?random=241', 169.6, 49.7, '2025-01-23 00:00:00', '2025-01-11 00:00:00', '2025-01-30 00:00:00');
INSERT INTO `app_user` VALUES (269, 'S00000242', '侯利', '123456', 'https://picsum.photos/200/200?random=242', 172.3, 70.7, '2025-05-27 00:00:00', '2025-05-23 00:00:00', '2025-06-03 00:00:00');
INSERT INTO `app_user` VALUES (270, 'S00000243', '孙琳', '123456', 'https://picsum.photos/200/200?random=243', 169.7, 82.3, '2025-06-04 00:00:00', '2025-05-05 00:00:00', '2025-05-12 00:00:00');
INSERT INTO `app_user` VALUES (271, 'S00000244', '王婷婷', '123456', 'https://picsum.photos/200/200?random=244', 164.4, 67.3, '2025-04-03 00:00:00', '2025-03-05 00:00:00', '2025-04-04 00:00:00');
INSERT INTO `app_user` VALUES (272, 'S00000245', '邹佳', '123456', 'https://picsum.photos/200/200?random=245', 178.4, 48.3, '2025-07-04 00:00:00', '2025-06-30 00:00:00', '2025-07-14 00:00:00');
INSERT INTO `app_user` VALUES (273, 'S00000246', '李帅', '123456', 'https://picsum.photos/200/200?random=246', 185.5, 80, '2025-06-14 00:00:00', '2025-05-31 00:00:00', '2025-06-14 00:00:00');
INSERT INTO `app_user` VALUES (274, 'S00000247', '余颖', '123456', 'https://picsum.photos/200/200?random=247', 162.3, 82.9, '2025-03-28 00:00:00', '2025-03-20 00:00:00', '2025-03-25 00:00:00');
INSERT INTO `app_user` VALUES (275, 'S00000248', '苏婷', '123456', 'https://picsum.photos/200/200?random=248', 169.7, 41.2, '2025-06-12 00:00:00', '2025-05-22 00:00:00', '2025-06-07 00:00:00');
INSERT INTO `app_user` VALUES (276, 'S00000249', '岳林', '123456', 'https://picsum.photos/200/200?random=249', 185.3, 63.4, '2025-01-14 00:00:00', '2025-01-05 00:00:00', '2025-01-15 00:00:00');
INSERT INTO `app_user` VALUES (277, 'S00000250', '赵玉英', '123456', 'https://picsum.photos/200/200?random=250', 188.5, 51.7, '2025-02-03 00:00:00', '2025-01-14 00:00:00', '2025-02-09 00:00:00');
INSERT INTO `app_user` VALUES (278, 'S00000251', '漆兰英', '123456', 'https://picsum.photos/200/200?random=251', 189, 86.1, '2025-01-17 00:00:00', '2025-01-07 00:00:00', '2025-02-04 00:00:00');
INSERT INTO `app_user` VALUES (279, 'S00000252', '黄梅', '123456', 'https://picsum.photos/200/200?random=252', 159.1, 67.9, '2025-06-11 00:00:00', '2025-05-19 00:00:00', '2025-06-01 00:00:00');
INSERT INTO `app_user` VALUES (280, 'S00000253', '任伟', '123456', 'https://picsum.photos/200/200?random=253', 150.6, 64.4, '2025-03-07 00:00:00', '2025-02-24 00:00:00', '2025-03-19 00:00:00');
INSERT INTO `app_user` VALUES (281, 'S00000254', '栗文', '123456', 'https://picsum.photos/200/200?random=254', 171.5, 49, '2025-04-27 00:00:00', '2025-04-26 00:00:00', '2025-05-22 00:00:00');
INSERT INTO `app_user` VALUES (282, 'S00000255', '郑桂英', '123456', 'https://picsum.photos/200/200?random=255', 171.4, 44.4, '2025-04-01 00:00:00', '2025-03-19 00:00:00', '2025-04-01 00:00:00');
INSERT INTO `app_user` VALUES (283, 'S00000256', '李明', '123456', 'https://picsum.photos/200/200?random=256', 162.1, 44.8, '2025-02-27 00:00:00', '2025-01-31 00:00:00', '2025-02-15 00:00:00');
INSERT INTO `app_user` VALUES (284, 'S00000257', '李宁', '123456', 'https://picsum.photos/200/200?random=257', 158.8, 76.9, '2025-05-17 00:00:00', '2025-04-23 00:00:00', '2025-05-12 00:00:00');
INSERT INTO `app_user` VALUES (285, 'S00000258', '宋秀云', '123456', 'https://picsum.photos/200/200?random=258', 151.3, 70, '2025-07-07 00:00:00', '2025-06-14 00:00:00', '2025-07-12 00:00:00');
INSERT INTO `app_user` VALUES (286, 'S00000259', '王萍', '123456', 'https://picsum.photos/200/200?random=259', 161.7, 57.2, '2025-04-10 00:00:00', '2025-03-21 00:00:00', '2025-04-01 00:00:00');
INSERT INTO `app_user` VALUES (287, 'S00000260', '吴英', '123456', 'https://picsum.photos/200/200?random=260', 151.5, 45.7, '2025-07-03 00:00:00', '2025-06-18 00:00:00', '2025-07-17 00:00:00');
INSERT INTO `app_user` VALUES (288, 'S00000261', '周彬', '123456', 'https://picsum.photos/200/200?random=261', 166.2, 47.3, '2025-07-05 00:00:00', '2025-06-11 00:00:00', '2025-07-01 00:00:00');
INSERT INTO `app_user` VALUES (289, 'S00000262', '陈玉英', '123456', 'https://picsum.photos/200/200?random=262', 170.8, 84.4, '2025-04-23 00:00:00', '2025-04-18 00:00:00', '2025-05-13 00:00:00');
INSERT INTO `app_user` VALUES (290, 'S00000263', '周晶', '123456', 'https://picsum.photos/200/200?random=263', 151.2, 42.2, '2025-04-23 00:00:00', '2025-04-04 00:00:00', '2025-04-08 00:00:00');
INSERT INTO `app_user` VALUES (291, 'S00000264', '高帅', '123456', 'https://picsum.photos/200/200?random=264', 161.2, 44.6, '2025-04-16 00:00:00', '2025-03-29 00:00:00', '2025-04-25 00:00:00');
INSERT INTO `app_user` VALUES (292, 'S00000265', '周玉', '123456', 'https://picsum.photos/200/200?random=265', 187.6, 60.8, '2025-05-23 00:00:00', '2025-05-09 00:00:00', '2025-05-24 00:00:00');
INSERT INTO `app_user` VALUES (293, 'S00000266', '杜琴', '123456', 'https://picsum.photos/200/200?random=266', 168.7, 51.3, '2025-03-31 00:00:00', '2025-03-01 00:00:00', '2025-03-07 00:00:00');
INSERT INTO `app_user` VALUES (294, 'S00000267', '杨娟', '123456', 'https://picsum.photos/200/200?random=267', 150.8, 72.4, '2025-01-30 00:00:00', '2025-01-09 00:00:00', '2025-01-27 00:00:00');
INSERT INTO `app_user` VALUES (295, 'S00000268', '汪丽华', '123456', 'https://picsum.photos/200/200?random=268', 165.9, 89.4, '2025-03-06 00:00:00', '2025-02-16 00:00:00', '2025-03-08 00:00:00');
INSERT INTO `app_user` VALUES (296, 'S00000269', '蔡桂荣', '123456', 'https://picsum.photos/200/200?random=269', 185.8, 86.3, '2025-05-03 00:00:00', '2025-04-29 00:00:00', '2025-05-06 00:00:00');
INSERT INTO `app_user` VALUES (297, 'S00000270', '陈秀芳', '123456', 'https://picsum.photos/200/200?random=270', 161.3, 61.8, '2025-07-23 00:00:00', '2025-06-26 00:00:00', '2025-07-09 00:00:00');
INSERT INTO `app_user` VALUES (298, 'S00000271', '熊鑫', '123456', 'https://picsum.photos/200/200?random=271', 189.4, 51.8, '2025-01-24 00:00:00', '2025-01-12 00:00:00', '2025-01-27 00:00:00');
INSERT INTO `app_user` VALUES (299, 'S00000272', '郭丽娟', '123456', 'https://picsum.photos/200/200?random=272', 151.9, 57.4, '2025-01-27 00:00:00', '2025-01-18 00:00:00', '2025-02-07 00:00:00');
INSERT INTO `app_user` VALUES (300, 'S00000273', '王娜', '123456', 'https://picsum.photos/200/200?random=273', 151.4, 80.3, '2025-04-22 00:00:00', '2025-03-25 00:00:00', '2025-04-09 00:00:00');
INSERT INTO `app_user` VALUES (301, 'S00000274', '王桂珍', '123456', 'https://picsum.photos/200/200?random=274', 184.7, 48.7, '2025-02-13 00:00:00', '2025-01-30 00:00:00', '2025-02-04 00:00:00');
INSERT INTO `app_user` VALUES (302, 'S00000275', '包超', '123456', 'https://picsum.photos/200/200?random=275', 187.4, 48.4, '2025-06-18 00:00:00', '2025-06-10 00:00:00', '2025-06-13 00:00:00');
INSERT INTO `app_user` VALUES (303, 'S00000276', '黄佳', '123456', 'https://picsum.photos/200/200?random=276', 184.3, 77.5, '2025-07-05 00:00:00', '2025-06-23 00:00:00', '2025-07-16 00:00:00');
INSERT INTO `app_user` VALUES (304, 'S00000277', '宁志强', '123456', 'https://picsum.photos/200/200?random=277', 171.5, 84.8, '2025-07-19 00:00:00', '2025-06-24 00:00:00', '2025-07-13 00:00:00');
INSERT INTO `app_user` VALUES (305, 'S00000278', '魏颖', '123456', 'https://picsum.photos/200/200?random=278', 155, 53.1, '2025-03-01 00:00:00', '2025-02-09 00:00:00', '2025-02-28 00:00:00');
INSERT INTO `app_user` VALUES (306, 'S00000279', '刘斌', '123456', 'https://picsum.photos/200/200?random=279', 152.9, 63, '2025-04-16 00:00:00', '2025-03-29 00:00:00', '2025-04-05 00:00:00');
INSERT INTO `app_user` VALUES (307, 'S00000280', '徐宁', '123456', 'https://picsum.photos/200/200?random=280', 184.6, 80.8, '2025-06-15 00:00:00', '2025-06-12 00:00:00', '2025-06-30 00:00:00');
INSERT INTO `app_user` VALUES (308, 'S00000281', '卢楠', '123456', 'https://picsum.photos/200/200?random=281', 179.1, 42.2, '2025-04-29 00:00:00', '2025-04-16 00:00:00', '2025-05-02 00:00:00');
INSERT INTO `app_user` VALUES (309, 'S00000282', '张红', '123456', 'https://picsum.photos/200/200?random=282', 160, 62.9, '2025-06-07 00:00:00', '2025-05-11 00:00:00', '2025-06-09 00:00:00');
INSERT INTO `app_user` VALUES (310, 'S00000283', '邵亮', '123456', 'https://picsum.photos/200/200?random=283', 165.6, 54.3, '2025-05-31 00:00:00', '2025-05-26 00:00:00', '2025-05-29 00:00:00');
INSERT INTO `app_user` VALUES (311, 'S00000284', '李云', '123456', 'https://picsum.photos/200/200?random=284', 189.4, 79.9, '2025-06-09 00:00:00', '2025-05-27 00:00:00', '2025-06-12 00:00:00');
INSERT INTO `app_user` VALUES (312, 'S00000285', '周梅', '123456', 'https://picsum.photos/200/200?random=285', 178.1, 67.5, '2025-03-02 00:00:00', '2025-02-01 00:00:00', '2025-02-07 00:00:00');
INSERT INTO `app_user` VALUES (313, 'S00000286', '尹玉兰', '123456', 'https://picsum.photos/200/200?random=286', 170.7, 43.3, '2025-06-06 00:00:00', '2025-05-24 00:00:00', '2025-05-27 00:00:00');
INSERT INTO `app_user` VALUES (314, 'S00000287', '陈明', '123456', 'https://picsum.photos/200/200?random=287', 182.5, 65.5, '2025-04-16 00:00:00', '2025-04-04 00:00:00', '2025-04-13 00:00:00');
INSERT INTO `app_user` VALUES (315, 'S00000288', '宋桂荣', '123456', 'https://picsum.photos/200/200?random=288', 165.1, 48.4, '2025-04-29 00:00:00', '2025-04-09 00:00:00', '2025-04-28 00:00:00');
INSERT INTO `app_user` VALUES (316, 'S00000289', '李洋', '123456', 'https://picsum.photos/200/200?random=289', 173.9, 82, '2025-02-04 00:00:00', '2025-01-29 00:00:00', '2025-02-10 00:00:00');
INSERT INTO `app_user` VALUES (317, 'S00000290', '胡芳', '123456', 'https://picsum.photos/200/200?random=290', 189, 80.7, '2025-03-23 00:00:00', '2025-03-05 00:00:00', '2025-03-18 00:00:00');
INSERT INTO `app_user` VALUES (318, 'S00000291', '许秀荣', '123456', 'https://picsum.photos/200/200?random=291', 189, 61.3, '2025-06-24 00:00:00', '2025-06-05 00:00:00', '2025-06-28 00:00:00');
INSERT INTO `app_user` VALUES (319, 'S00000292', '周楠', '123456', 'https://picsum.photos/200/200?random=292', 182.5, 75.9, '2025-04-23 00:00:00', '2025-04-03 00:00:00', '2025-04-28 00:00:00');
INSERT INTO `app_user` VALUES (320, 'S00000293', '刘建军', '123456', 'https://picsum.photos/200/200?random=293', 155.9, 87.2, '2025-05-20 00:00:00', '2025-05-15 00:00:00', '2025-06-08 00:00:00');
INSERT INTO `app_user` VALUES (321, 'S00000294', '荆勇', '123456', 'https://picsum.photos/200/200?random=294', 162.6, 53.6, '2025-04-03 00:00:00', '2025-03-22 00:00:00', '2025-04-05 00:00:00');
INSERT INTO `app_user` VALUES (322, 'S00000295', '覃艳', '123456', 'https://picsum.photos/200/200?random=295', 168.2, 58.6, '2025-03-15 00:00:00', '2025-03-14 00:00:00', '2025-03-20 00:00:00');
INSERT INTO `app_user` VALUES (323, 'S00000296', '宋瑞', '123456', 'https://picsum.photos/200/200?random=296', 156.1, 45.2, '2025-05-02 00:00:00', '2025-04-18 00:00:00', '2025-04-24 00:00:00');
INSERT INTO `app_user` VALUES (324, 'S00000297', '蔡秀芳', '123456', 'https://picsum.photos/200/200?random=297', 158.9, 87.7, '2025-06-23 00:00:00', '2025-05-26 00:00:00', '2025-06-25 00:00:00');
INSERT INTO `app_user` VALUES (325, 'S00000298', '李佳', '123456', 'https://picsum.photos/200/200?random=298', 164.1, 75.7, '2025-03-16 00:00:00', '2025-03-09 00:00:00', '2025-03-20 00:00:00');
INSERT INTO `app_user` VALUES (326, 'S00000299', '宋秀芳', '123456', 'https://picsum.photos/200/200?random=299', 174.3, 50.4, '2025-06-13 00:00:00', '2025-05-25 00:00:00', '2025-05-29 00:00:00');
INSERT INTO `app_user` VALUES (327, 'S00000300', '王东', '123456', 'https://picsum.photos/200/200?random=300', 189.6, 79, '2025-04-10 00:00:00', '2025-04-05 00:00:00', '2025-05-05 00:00:00');
INSERT INTO `app_user` VALUES (328, 'S00000301', '吴淑珍', '123456', 'https://picsum.photos/200/200?random=301', 168.4, 68, '2025-01-18 00:00:00', '2025-01-10 00:00:00', '2025-01-22 00:00:00');
INSERT INTO `app_user` VALUES (329, 'S00000302', '李丽丽', '123456', 'https://picsum.photos/200/200?random=302', 171.8, 48.3, '2025-01-31 00:00:00', '2025-01-02 00:00:00', '2025-02-01 00:00:00');
INSERT INTO `app_user` VALUES (330, 'S00000303', '刘雪', '123456', 'https://picsum.photos/200/200?random=303', 162.9, 74.6, '2025-06-23 00:00:00', '2025-06-02 00:00:00', '2025-06-12 00:00:00');
INSERT INTO `app_user` VALUES (331, 'S00000304', '宋燕', '123456', 'https://picsum.photos/200/200?random=304', 159.7, 63.5, '2025-02-20 00:00:00', '2025-01-29 00:00:00', '2025-02-25 00:00:00');
INSERT INTO `app_user` VALUES (332, 'S00000305', '顾玲', '123456', 'https://picsum.photos/200/200?random=305', 164.8, 40.4, '2025-03-10 00:00:00', '2025-02-14 00:00:00', '2025-03-08 00:00:00');
INSERT INTO `app_user` VALUES (333, 'S00000306', '银晶', '123456', 'https://picsum.photos/200/200?random=306', 173.4, 59.2, '2025-03-04 00:00:00', '2025-02-24 00:00:00', '2025-03-23 00:00:00');
INSERT INTO `app_user` VALUES (334, 'S00000307', '廖建军', '123456', 'https://picsum.photos/200/200?random=307', 180.5, 50.5, '2025-05-19 00:00:00', '2025-04-23 00:00:00', '2025-05-02 00:00:00');
INSERT INTO `app_user` VALUES (335, 'S00000308', '秦冬梅', '123456', 'https://picsum.photos/200/200?random=308', 189.1, 69.3, '2025-05-27 00:00:00', '2025-05-20 00:00:00', '2025-05-21 00:00:00');
INSERT INTO `app_user` VALUES (336, 'S00000309', '王洁', '123456', 'https://picsum.photos/200/200?random=309', 186.1, 86.2, '2025-05-21 00:00:00', '2025-05-12 00:00:00', '2025-05-24 00:00:00');
INSERT INTO `app_user` VALUES (337, 'S00000310', '方梅', '123456', 'https://picsum.photos/200/200?random=310', 186.8, 47.8, '2025-05-30 00:00:00', '2025-05-05 00:00:00', '2025-05-14 00:00:00');
INSERT INTO `app_user` VALUES (338, 'S00000311', '萧海燕', '123456', 'https://picsum.photos/200/200?random=311', 153.8, 88.6, '2025-04-29 00:00:00', '2025-04-23 00:00:00', '2025-05-10 00:00:00');
INSERT INTO `app_user` VALUES (339, 'S00000312', '贾帆', '123456', 'https://picsum.photos/200/200?random=312', 184.9, 86.3, '2025-01-28 00:00:00', '2025-01-06 00:00:00', '2025-01-16 00:00:00');
INSERT INTO `app_user` VALUES (340, 'S00000313', '柳艳', '123456', 'https://picsum.photos/200/200?random=313', 158.2, 69.4, '2025-05-10 00:00:00', '2025-04-28 00:00:00', '2025-05-03 00:00:00');
INSERT INTO `app_user` VALUES (341, 'S00000314', '梁秀芳', '123456', 'https://picsum.photos/200/200?random=314', 163.5, 56.5, '2025-05-23 00:00:00', '2025-05-05 00:00:00', '2025-05-28 00:00:00');
INSERT INTO `app_user` VALUES (342, 'S00000315', '陈娟', '123456', 'https://picsum.photos/200/200?random=315', 153.9, 42, '2025-01-28 00:00:00', '2025-01-08 00:00:00', '2025-02-03 00:00:00');
INSERT INTO `app_user` VALUES (343, 'S00000316', '赵倩', '123456', 'https://picsum.photos/200/200?random=316', 168.6, 71.6, '2025-01-11 00:00:00', '2025-01-05 00:00:00', '2025-01-28 00:00:00');
INSERT INTO `app_user` VALUES (344, 'S00000317', '韦秀云', '123456', 'https://picsum.photos/200/200?random=317', 151.7, 43.5, '2025-04-17 00:00:00', '2025-04-12 00:00:00', '2025-05-02 00:00:00');
INSERT INTO `app_user` VALUES (345, 'S00000318', '李霞', '123456', 'https://picsum.photos/200/200?random=318', 156.2, 56.2, '2025-04-03 00:00:00', '2025-03-25 00:00:00', '2025-04-17 00:00:00');
INSERT INTO `app_user` VALUES (346, 'S00000319', '卢燕', '123456', 'https://picsum.photos/200/200?random=319', 164.6, 80.5, '2025-07-27 00:00:00', '2025-06-27 00:00:00', '2025-06-28 00:00:00');
INSERT INTO `app_user` VALUES (347, 'S00000320', '陈桂英', '123456', 'https://picsum.photos/200/200?random=320', 155.2, 48.3, '2025-02-13 00:00:00', '2025-01-23 00:00:00', '2025-02-04 00:00:00');
INSERT INTO `app_user` VALUES (348, 'S00000321', '郭颖', '123456', 'https://picsum.photos/200/200?random=321', 151.8, 63.4, '2025-01-08 00:00:00', '2025-01-05 00:00:00', '2025-01-06 00:00:00');
INSERT INTO `app_user` VALUES (349, 'S00000322', '李玉珍', '123456', 'https://picsum.photos/200/200?random=322', 165.9, 40.8, '2025-05-01 00:00:00', '2025-04-03 00:00:00', '2025-04-28 00:00:00');
INSERT INTO `app_user` VALUES (350, 'S00000323', '张峰', '123456', 'https://picsum.photos/200/200?random=323', 182.5, 57.6, '2025-03-31 00:00:00', '2025-03-27 00:00:00', '2025-04-15 00:00:00');
INSERT INTO `app_user` VALUES (351, 'S00000324', '栾柳', '123456', 'https://picsum.photos/200/200?random=324', 175.3, 69.3, '2025-05-02 00:00:00', '2025-04-06 00:00:00', '2025-04-11 00:00:00');
INSERT INTO `app_user` VALUES (352, 'S00000325', '邸丹丹', '123456', 'https://picsum.photos/200/200?random=325', 162.6, 71.1, '2025-06-26 00:00:00', '2025-05-30 00:00:00', '2025-06-24 00:00:00');
INSERT INTO `app_user` VALUES (353, 'S00000326', '魏萍', '123456', 'https://picsum.photos/200/200?random=326', 156.9, 53.5, '2025-01-20 00:00:00', '2025-01-16 00:00:00', '2025-01-25 00:00:00');
INSERT INTO `app_user` VALUES (354, 'S00000327', '吴丽丽', '123456', 'https://picsum.photos/200/200?random=327', 153.3, 88, '2025-06-19 00:00:00', '2025-06-16 00:00:00', '2025-06-17 00:00:00');
INSERT INTO `app_user` VALUES (355, 'S00000328', '何飞', '123456', 'https://picsum.photos/200/200?random=328', 173.4, 58.6, '2025-07-06 00:00:00', '2025-06-07 00:00:00', '2025-07-01 00:00:00');
INSERT INTO `app_user` VALUES (356, 'S00000329', '张春梅', '123456', 'https://picsum.photos/200/200?random=329', 178.3, 69.1, '2025-03-14 00:00:00', '2025-03-01 00:00:00', '2025-03-07 00:00:00');
INSERT INTO `app_user` VALUES (357, 'S00000330', '宋冬梅', '123456', 'https://picsum.photos/200/200?random=330', 187.1, 47.2, '2025-04-25 00:00:00', '2025-04-08 00:00:00', '2025-04-29 00:00:00');
INSERT INTO `app_user` VALUES (358, 'S00000331', '王欢', '123456', 'https://picsum.photos/200/200?random=331', 163.8, 73.6, '2025-05-31 00:00:00', '2025-05-19 00:00:00', '2025-06-07 00:00:00');
INSERT INTO `app_user` VALUES (359, 'S00000332', '史雪', '123456', 'https://picsum.photos/200/200?random=332', 172.6, 61.1, '2025-04-17 00:00:00', '2025-03-23 00:00:00', '2025-03-25 00:00:00');
INSERT INTO `app_user` VALUES (360, 'S00000333', '王飞', '123456', 'https://picsum.photos/200/200?random=333', 159, 53.3, '2025-05-07 00:00:00', '2025-04-13 00:00:00', '2025-05-11 00:00:00');
INSERT INTO `app_user` VALUES (361, 'S00000334', '杨畅', '123456', 'https://picsum.photos/200/200?random=334', 156.7, 49.9, '2025-04-10 00:00:00', '2025-03-11 00:00:00', '2025-03-24 00:00:00');
INSERT INTO `app_user` VALUES (362, 'S00000335', '薛刚', '123456', 'https://picsum.photos/200/200?random=335', 174.3, 78.1, '2025-04-28 00:00:00', '2025-04-27 00:00:00', '2025-05-27 00:00:00');
INSERT INTO `app_user` VALUES (363, 'S00000336', '薛阳', '123456', 'https://picsum.photos/200/200?random=336', 185.4, 62.1, '2025-04-05 00:00:00', '2025-03-22 00:00:00', '2025-04-19 00:00:00');
INSERT INTO `app_user` VALUES (364, 'S00000337', '屈晶', '123456', 'https://picsum.photos/200/200?random=337', 188.1, 86.9, '2025-04-15 00:00:00', '2025-04-11 00:00:00', '2025-04-22 00:00:00');
INSERT INTO `app_user` VALUES (365, 'S00000338', '吴桂花', '123456', 'https://picsum.photos/200/200?random=338', 184.9, 64.3, '2025-04-12 00:00:00', '2025-04-09 00:00:00', '2025-05-04 00:00:00');
INSERT INTO `app_user` VALUES (366, 'S00000339', '李霞', '123456', 'https://picsum.photos/200/200?random=339', 157.2, 45.4, '2025-07-15 00:00:00', '2025-06-25 00:00:00', '2025-07-23 00:00:00');
INSERT INTO `app_user` VALUES (367, 'S00000340', '张晶', '123456', 'https://picsum.photos/200/200?random=340', 151.5, 68.6, '2025-06-15 00:00:00', '2025-05-20 00:00:00', '2025-06-18 00:00:00');
INSERT INTO `app_user` VALUES (368, 'S00000341', '杨坤', '123456', 'https://picsum.photos/200/200?random=341', 169.2, 69.5, '2025-03-10 00:00:00', '2025-02-20 00:00:00', '2025-02-23 00:00:00');
INSERT INTO `app_user` VALUES (369, 'S00000342', '陈建', '123456', 'https://picsum.photos/200/200?random=342', 158.8, 60.5, '2025-04-19 00:00:00', '2025-04-18 00:00:00', '2025-04-23 00:00:00');
INSERT INTO `app_user` VALUES (370, 'S00000343', '王娜', '123456', 'https://picsum.photos/200/200?random=343', 163.2, 81.3, '2025-02-08 00:00:00', '2025-01-14 00:00:00', '2025-02-13 00:00:00');
INSERT INTO `app_user` VALUES (371, 'S00000344', '杨军', '123456', 'https://picsum.photos/200/200?random=344', 168.2, 62.4, '2025-06-08 00:00:00', '2025-06-04 00:00:00', '2025-06-05 00:00:00');
INSERT INTO `app_user` VALUES (372, 'S00000345', '刘浩', '123456', 'https://picsum.photos/200/200?random=345', 150.5, 74.9, '2025-02-12 00:00:00', '2025-01-31 00:00:00', '2025-02-28 00:00:00');
INSERT INTO `app_user` VALUES (373, 'S00000346', '徐桂花', '123456', 'https://picsum.photos/200/200?random=346', 174.8, 69.3, '2025-03-16 00:00:00', '2025-02-24 00:00:00', '2025-03-16 00:00:00');
INSERT INTO `app_user` VALUES (374, 'S00000347', '谭桂珍', '123456', 'https://picsum.photos/200/200?random=347', 185.6, 54, '2025-04-10 00:00:00', '2025-04-04 00:00:00', '2025-04-27 00:00:00');
INSERT INTO `app_user` VALUES (375, 'S00000348', '杜楠', '123456', 'https://picsum.photos/200/200?random=348', 163.8, 82.9, '2025-04-15 00:00:00', '2025-04-02 00:00:00', '2025-04-22 00:00:00');
INSERT INTO `app_user` VALUES (376, 'S00000349', '吴柳', '123456', 'https://picsum.photos/200/200?random=349', 166.8, 61.8, '2025-02-17 00:00:00', '2025-02-13 00:00:00', '2025-03-09 00:00:00');
INSERT INTO `app_user` VALUES (377, 'S00000350', '贾萍', '123456', 'https://picsum.photos/200/200?random=350', 171.5, 79.4, '2025-06-24 00:00:00', '2025-06-03 00:00:00', '2025-06-04 00:00:00');
INSERT INTO `app_user` VALUES (378, 'S00000351', '杨俊', '123456', 'https://picsum.photos/200/200?random=351', 161.5, 43, '2025-02-08 00:00:00', '2025-01-14 00:00:00', '2025-01-22 00:00:00');
INSERT INTO `app_user` VALUES (379, 'S00000352', '梅杰', '123456', 'https://picsum.photos/200/200?random=352', 169.2, 86.4, '2025-07-11 00:00:00', '2025-06-16 00:00:00', '2025-07-06 00:00:00');
INSERT INTO `app_user` VALUES (380, 'S00000353', '聂丽', '123456', 'https://picsum.photos/200/200?random=353', 155, 86.1, '2025-04-24 00:00:00', '2025-04-13 00:00:00', '2025-04-28 00:00:00');
INSERT INTO `app_user` VALUES (381, 'S00000354', '单磊', '123456', 'https://picsum.photos/200/200?random=354', 172.3, 61.8, '2025-04-29 00:00:00', '2025-04-22 00:00:00', '2025-05-16 00:00:00');
INSERT INTO `app_user` VALUES (382, 'S00000355', '鲁玉', '123456', 'https://picsum.photos/200/200?random=355', 176.8, 40.2, '2025-07-17 00:00:00', '2025-06-19 00:00:00', '2025-07-13 00:00:00');
INSERT INTO `app_user` VALUES (383, 'S00000356', '张桂花', '123456', 'https://picsum.photos/200/200?random=356', 188, 75.2, '2025-03-07 00:00:00', '2025-02-25 00:00:00', '2025-03-26 00:00:00');
INSERT INTO `app_user` VALUES (384, 'S00000357', '程磊', '123456', 'https://picsum.photos/200/200?random=357', 150.9, 56, '2025-05-29 00:00:00', '2025-05-04 00:00:00', '2025-05-26 00:00:00');
INSERT INTO `app_user` VALUES (385, 'S00000358', '陆桂香', '123456', 'https://picsum.photos/200/200?random=358', 188, 40.5, '2025-02-10 00:00:00', '2025-01-15 00:00:00', '2025-02-06 00:00:00');
INSERT INTO `app_user` VALUES (386, 'S00000359', '侯伟', '123456', 'https://picsum.photos/200/200?random=359', 151.8, 59.9, '2025-07-21 00:00:00', '2025-06-25 00:00:00', '2025-07-18 00:00:00');
INSERT INTO `app_user` VALUES (387, 'S00000360', '屠兵', '123456', 'https://picsum.photos/200/200?random=360', 177.9, 59.2, '2025-05-13 00:00:00', '2025-05-12 00:00:00', '2025-05-13 00:00:00');
INSERT INTO `app_user` VALUES (388, 'S00000361', '林柳', '123456', 'https://picsum.photos/200/200?random=361', 158.3, 51.7, '2025-03-22 00:00:00', '2025-03-04 00:00:00', '2025-03-13 00:00:00');
INSERT INTO `app_user` VALUES (389, 'S00000362', '吴斌', '123456', 'https://picsum.photos/200/200?random=362', 158.5, 87, '2025-06-23 00:00:00', '2025-06-06 00:00:00', '2025-07-03 00:00:00');
INSERT INTO `app_user` VALUES (390, 'S00000363', '施凤英', '123456', 'https://picsum.photos/200/200?random=363', 189.2, 73.2, '2025-06-12 00:00:00', '2025-06-01 00:00:00', '2025-06-16 00:00:00');
INSERT INTO `app_user` VALUES (391, 'S00000364', '李玉华', '123456', 'https://picsum.photos/200/200?random=364', 165.6, 51.5, '2025-03-31 00:00:00', '2025-03-16 00:00:00', '2025-04-10 00:00:00');
INSERT INTO `app_user` VALUES (392, 'S00000365', '刘艳', '123456', 'https://picsum.photos/200/200?random=365', 171.9, 81.1, '2025-03-27 00:00:00', '2025-03-10 00:00:00', '2025-03-14 00:00:00');
INSERT INTO `app_user` VALUES (393, 'S00000366', '唐波', '123456', 'https://picsum.photos/200/200?random=366', 160.1, 71.5, '2025-01-22 00:00:00', '2025-01-18 00:00:00', '2025-01-23 00:00:00');
INSERT INTO `app_user` VALUES (394, 'S00000367', '向建国', '123456', 'https://picsum.photos/200/200?random=367', 154.4, 48.7, '2025-07-08 00:00:00', '2025-06-28 00:00:00', '2025-07-21 00:00:00');
INSERT INTO `app_user` VALUES (395, 'S00000368', '马倩', '123456', 'https://picsum.photos/200/200?random=368', 189.1, 42.5, '2025-03-27 00:00:00', '2025-03-08 00:00:00', '2025-04-06 00:00:00');
INSERT INTO `app_user` VALUES (396, 'S00000369', '梁玉', '123456', 'https://picsum.photos/200/200?random=369', 159.9, 63, '2025-03-11 00:00:00', '2025-03-04 00:00:00', '2025-03-24 00:00:00');
INSERT INTO `app_user` VALUES (397, 'S00000370', '左艳', '123456', 'https://picsum.photos/200/200?random=370', 188.1, 54.5, '2025-05-06 00:00:00', '2025-04-13 00:00:00', '2025-04-22 00:00:00');
INSERT INTO `app_user` VALUES (398, 'S00000371', '汪波', '123456', 'https://picsum.photos/200/200?random=371', 174, 48.7, '2025-02-28 00:00:00', '2025-02-18 00:00:00', '2025-03-15 00:00:00');
INSERT INTO `app_user` VALUES (399, 'S00000372', '陈婷', '123456', 'https://picsum.photos/200/200?random=372', 160.5, 48.5, '2025-04-21 00:00:00', '2025-04-11 00:00:00', '2025-04-21 00:00:00');
INSERT INTO `app_user` VALUES (400, 'S00000373', '郑利', '123456', 'https://picsum.photos/200/200?random=373', 186.4, 62.3, '2025-04-28 00:00:00', '2025-04-07 00:00:00', '2025-05-01 00:00:00');
INSERT INTO `app_user` VALUES (401, 'S00000374', '林娟', '123456', 'https://picsum.photos/200/200?random=374', 150.7, 42.9, '2025-02-23 00:00:00', '2025-01-26 00:00:00', '2025-02-22 00:00:00');
INSERT INTO `app_user` VALUES (402, 'S00000375', '金秀兰', '123456', 'https://picsum.photos/200/200?random=375', 174.1, 65.5, '2025-05-18 00:00:00', '2025-04-25 00:00:00', '2025-05-13 00:00:00');
INSERT INTO `app_user` VALUES (403, 'S00000376', '杨建平', '123456', 'https://picsum.photos/200/200?random=376', 157.5, 59.5, '2025-03-28 00:00:00', '2025-03-21 00:00:00', '2025-04-03 00:00:00');
INSERT INTO `app_user` VALUES (404, 'S00000377', '杨莹', '123456', 'https://picsum.photos/200/200?random=377', 159, 41.7, '2025-05-19 00:00:00', '2025-05-18 00:00:00', '2025-05-31 00:00:00');
INSERT INTO `app_user` VALUES (405, 'S00000378', '鞠莉', '123456', 'https://picsum.photos/200/200?random=378', 168.5, 65.1, '2025-05-21 00:00:00', '2025-05-20 00:00:00', '2025-06-04 00:00:00');
INSERT INTO `app_user` VALUES (406, 'S00000379', '曾淑华', '123456', 'https://picsum.photos/200/200?random=379', 182.3, 42.9, '2025-01-26 00:00:00', '2025-01-08 00:00:00', '2025-01-29 00:00:00');
INSERT INTO `app_user` VALUES (407, 'S00000380', '蔡玉华', '123456', 'https://picsum.photos/200/200?random=380', 181.6, 64.5, '2025-05-12 00:00:00', '2025-05-06 00:00:00', '2025-06-05 00:00:00');
INSERT INTO `app_user` VALUES (408, 'S00000381', '蓝萍', '123456', 'https://picsum.photos/200/200?random=381', 152.9, 64.2, '2025-01-18 00:00:00', '2025-01-16 00:00:00', '2025-02-13 00:00:00');
INSERT INTO `app_user` VALUES (409, 'S00000382', '周峰', '123456', 'https://picsum.photos/200/200?random=382', 173.7, 81.7, '2025-05-13 00:00:00', '2025-04-23 00:00:00', '2025-05-06 00:00:00');
INSERT INTO `app_user` VALUES (410, 'S00000383', '由凤兰', '123456', 'https://picsum.photos/200/200?random=383', 160, 41.3, '2025-04-10 00:00:00', '2025-03-29 00:00:00', '2025-03-31 00:00:00');
INSERT INTO `app_user` VALUES (411, 'S00000384', '周丹', '123456', 'https://picsum.photos/200/200?random=384', 163.1, 52.4, '2025-05-22 00:00:00', '2025-04-24 00:00:00', '2025-05-21 00:00:00');
INSERT INTO `app_user` VALUES (412, 'S00000385', '张淑华', '123456', 'https://picsum.photos/200/200?random=385', 168.8, 78.3, '2025-03-24 00:00:00', '2025-03-15 00:00:00', '2025-04-01 00:00:00');
INSERT INTO `app_user` VALUES (413, 'S00000386', '杨倩', '123456', 'https://picsum.photos/200/200?random=386', 176.7, 87.1, '2025-04-19 00:00:00', '2025-04-11 00:00:00', '2025-04-25 00:00:00');
INSERT INTO `app_user` VALUES (414, 'S00000387', '晏秀珍', '123456', 'https://picsum.photos/200/200?random=387', 172, 41.5, '2025-03-08 00:00:00', '2025-02-24 00:00:00', '2025-03-20 00:00:00');
INSERT INTO `app_user` VALUES (415, 'S00000388', '魏坤', '123456', 'https://picsum.photos/200/200?random=388', 162.3, 41.7, '2025-02-22 00:00:00', '2025-02-09 00:00:00', '2025-03-02 00:00:00');
INSERT INTO `app_user` VALUES (416, 'S00000389', '覃秀云', '123456', 'https://picsum.photos/200/200?random=389', 158.1, 64.3, '2025-05-16 00:00:00', '2025-04-26 00:00:00', '2025-05-01 00:00:00');
INSERT INTO `app_user` VALUES (417, 'S00000390', '周旭', '123456', 'https://picsum.photos/200/200?random=390', 186, 70.3, '2025-07-04 00:00:00', '2025-06-23 00:00:00', '2025-07-12 00:00:00');
INSERT INTO `app_user` VALUES (418, 'S00000391', '刘芳', '123456', 'https://picsum.photos/200/200?random=391', 172.4, 70.1, '2025-03-17 00:00:00', '2025-02-18 00:00:00', '2025-02-20 00:00:00');
INSERT INTO `app_user` VALUES (419, 'S00000392', '张凯', '123456', 'https://picsum.photos/200/200?random=392', 178.4, 68.6, '2025-05-04 00:00:00', '2025-04-21 00:00:00', '2025-05-06 00:00:00');
INSERT INTO `app_user` VALUES (420, 'S00000393', '周淑华', '123456', 'https://picsum.photos/200/200?random=393', 161.7, 82.4, '2025-06-17 00:00:00', '2025-05-28 00:00:00', '2025-06-10 00:00:00');
INSERT INTO `app_user` VALUES (421, 'S00000394', '王建', '123456', 'https://picsum.photos/200/200?random=394', 170.5, 63.1, '2025-05-06 00:00:00', '2025-04-08 00:00:00', '2025-04-10 00:00:00');
INSERT INTO `app_user` VALUES (422, 'S00000395', '王军', '123456', 'https://picsum.photos/200/200?random=395', 156.1, 88.1, '2025-07-04 00:00:00', '2025-06-10 00:00:00', '2025-06-27 00:00:00');
INSERT INTO `app_user` VALUES (423, 'S00000396', '杨龙', '123456', 'https://picsum.photos/200/200?random=396', 159, 45.4, '2025-04-25 00:00:00', '2025-04-03 00:00:00', '2025-04-18 00:00:00');
INSERT INTO `app_user` VALUES (424, 'S00000397', '叶雪梅', '123456', 'https://picsum.photos/200/200?random=397', 186.7, 83.2, '2025-06-27 00:00:00', '2025-06-18 00:00:00', '2025-06-28 00:00:00');
INSERT INTO `app_user` VALUES (425, 'S00000398', '李丽娟', '123456', 'https://picsum.photos/200/200?random=398', 188.2, 53.6, '2025-02-14 00:00:00', '2025-01-30 00:00:00', '2025-02-17 00:00:00');
INSERT INTO `app_user` VALUES (426, 'S00000399', '崔红', '123456', 'https://picsum.photos/200/200?random=399', 180.7, 47.4, '2025-02-20 00:00:00', '2025-02-07 00:00:00', '2025-03-03 00:00:00');
INSERT INTO `app_user` VALUES (427, 'S00000400', '曾涛', '123456', 'https://picsum.photos/200/200?random=400', 181.3, 50.9, '2025-03-06 00:00:00', '2025-02-06 00:00:00', '2025-02-19 00:00:00');
INSERT INTO `app_user` VALUES (428, 'S00000401', '田淑华', '123456', 'https://picsum.photos/200/200?random=401', 189.4, 41.6, '2025-06-11 00:00:00', '2025-06-06 00:00:00', '2025-06-15 00:00:00');
INSERT INTO `app_user` VALUES (429, 'S00000402', '杨凤兰', '123456', 'https://picsum.photos/200/200?random=402', 170.7, 40.5, '2025-02-16 00:00:00', '2025-02-03 00:00:00', '2025-03-04 00:00:00');
INSERT INTO `app_user` VALUES (430, 'S00000403', '赵晶', '123456', 'https://picsum.photos/200/200?random=403', 167.5, 47.8, '2025-02-01 00:00:00', '2025-01-30 00:00:00', '2025-03-01 00:00:00');
INSERT INTO `app_user` VALUES (431, 'S00000404', '林秀梅', '123456', 'https://picsum.photos/200/200?random=404', 180.8, 72.6, '2025-05-19 00:00:00', '2025-05-06 00:00:00', '2025-05-10 00:00:00');
INSERT INTO `app_user` VALUES (432, 'S00000405', '王云', '123456', 'https://picsum.photos/200/200?random=405', 152.5, 47.4, '2025-04-09 00:00:00', '2025-03-27 00:00:00', '2025-04-20 00:00:00');
INSERT INTO `app_user` VALUES (433, 'S00000406', '周波', '123456', 'https://picsum.photos/200/200?random=406', 187.9, 53.6, '2025-03-19 00:00:00', '2025-03-03 00:00:00', '2025-03-23 00:00:00');
INSERT INTO `app_user` VALUES (434, 'S00000407', '包鹏', '123456', 'https://picsum.photos/200/200?random=407', 174.7, 78.7, '2025-06-05 00:00:00', '2025-05-18 00:00:00', '2025-05-26 00:00:00');
INSERT INTO `app_user` VALUES (435, 'S00000408', '唐伟', '123456', 'https://picsum.photos/200/200?random=408', 157.3, 55.6, '2025-06-04 00:00:00', '2025-05-25 00:00:00', '2025-06-21 00:00:00');
INSERT INTO `app_user` VALUES (436, 'S00000409', '吴艳', '123456', 'https://picsum.photos/200/200?random=409', 181.1, 79.2, '2025-07-16 00:00:00', '2025-06-21 00:00:00', '2025-07-17 00:00:00');
INSERT INTO `app_user` VALUES (437, 'S00000410', '姜霞', '123456', 'https://picsum.photos/200/200?random=410', 181.6, 76.6, '2025-05-23 00:00:00', '2025-05-09 00:00:00', '2025-05-26 00:00:00');
INSERT INTO `app_user` VALUES (438, 'S00000411', '刘燕', '123456', 'https://picsum.photos/200/200?random=411', 178.8, 60.3, '2025-03-26 00:00:00', '2025-03-16 00:00:00', '2025-03-17 00:00:00');
INSERT INTO `app_user` VALUES (439, 'S00000412', '丰小红', '123456', 'https://picsum.photos/200/200?random=412', 168.5, 49.8, '2025-06-25 00:00:00', '2025-06-02 00:00:00', '2025-06-22 00:00:00');
INSERT INTO `app_user` VALUES (440, 'S00000413', '虞畅', '123456', 'https://picsum.photos/200/200?random=413', 162.4, 49.8, '2025-04-05 00:00:00', '2025-04-01 00:00:00', '2025-04-04 00:00:00');
INSERT INTO `app_user` VALUES (441, 'S00000414', '万英', '123456', 'https://picsum.photos/200/200?random=414', 179.9, 50, '2025-05-17 00:00:00', '2025-04-19 00:00:00', '2025-05-04 00:00:00');
INSERT INTO `app_user` VALUES (442, 'S00000415', '曹桂英', '123456', 'https://picsum.photos/200/200?random=415', 151.5, 73.9, '2025-04-04 00:00:00', '2025-03-19 00:00:00', '2025-03-21 00:00:00');
INSERT INTO `app_user` VALUES (443, 'S00000416', '张阳', '123456', 'https://picsum.photos/200/200?random=416', 153.7, 69.6, '2025-06-27 00:00:00', '2025-06-26 00:00:00', '2025-07-15 00:00:00');
INSERT INTO `app_user` VALUES (444, 'S00000417', '刘桂兰', '123456', 'https://picsum.photos/200/200?random=417', 170.6, 42.4, '2025-06-11 00:00:00', '2025-06-08 00:00:00', '2025-06-23 00:00:00');
INSERT INTO `app_user` VALUES (445, 'S00000418', '莫雷', '123456', 'https://picsum.photos/200/200?random=418', 171.2, 73, '2025-03-01 00:00:00', '2025-02-18 00:00:00', '2025-02-23 00:00:00');
INSERT INTO `app_user` VALUES (446, 'S00000419', '汪建平', '123456', 'https://picsum.photos/200/200?random=419', 170.4, 87.5, '2025-07-20 00:00:00', '2025-06-22 00:00:00', '2025-06-25 00:00:00');
INSERT INTO `app_user` VALUES (447, 'S00000420', '伍晨', '123456', 'https://picsum.photos/200/200?random=420', 185.6, 85.3, '2025-05-05 00:00:00', '2025-05-01 00:00:00', '2025-05-08 00:00:00');
INSERT INTO `app_user` VALUES (448, 'S00000421', '朱萍', '123456', 'https://picsum.photos/200/200?random=421', 183, 50.2, '2025-02-10 00:00:00', '2025-02-06 00:00:00', '2025-02-19 00:00:00');
INSERT INTO `app_user` VALUES (449, 'S00000422', '郝璐', '123456', 'https://picsum.photos/200/200?random=422', 177.5, 64.6, '2025-04-14 00:00:00', '2025-04-04 00:00:00', '2025-04-22 00:00:00');
INSERT INTO `app_user` VALUES (450, 'S00000423', '沈燕', '123456', 'https://picsum.photos/200/200?random=423', 166.2, 78.6, '2025-05-11 00:00:00', '2025-04-18 00:00:00', '2025-04-28 00:00:00');
INSERT INTO `app_user` VALUES (451, 'S00000424', '卫强', '123456', 'https://picsum.photos/200/200?random=424', 153.5, 40.8, '2025-02-15 00:00:00', '2025-01-27 00:00:00', '2025-02-01 00:00:00');
INSERT INTO `app_user` VALUES (452, 'S00000425', '鲍林', '123456', 'https://picsum.photos/200/200?random=425', 167, 71, '2025-06-27 00:00:00', '2025-06-06 00:00:00', '2025-06-15 00:00:00');
INSERT INTO `app_user` VALUES (453, 'S00000426', '范峰', '123456', 'https://picsum.photos/200/200?random=426', 183.5, 45.3, '2025-04-24 00:00:00', '2025-04-20 00:00:00', '2025-05-05 00:00:00');
INSERT INTO `app_user` VALUES (454, 'S00000427', '叶凤英', '123456', 'https://picsum.photos/200/200?random=427', 189.1, 66.9, '2025-06-15 00:00:00', '2025-05-18 00:00:00', '2025-05-20 00:00:00');
INSERT INTO `app_user` VALUES (455, 'S00000428', '颜冬梅', '123456', 'https://picsum.photos/200/200?random=428', 153.9, 64.2, '2025-04-05 00:00:00', '2025-04-03 00:00:00', '2025-05-02 00:00:00');
INSERT INTO `app_user` VALUES (456, 'S00000429', '罗淑华', '123456', 'https://picsum.photos/200/200?random=429', 158, 52.6, '2025-06-14 00:00:00', '2025-05-25 00:00:00', '2025-06-03 00:00:00');
INSERT INTO `app_user` VALUES (457, 'S00000430', '张丽丽', '123456', 'https://picsum.photos/200/200?random=430', 159.6, 50, '2025-03-05 00:00:00', '2025-02-08 00:00:00', '2025-03-08 00:00:00');
INSERT INTO `app_user` VALUES (458, 'S00000431', '李健', '123456', 'https://picsum.photos/200/200?random=431', 154.1, 48, '2025-02-25 00:00:00', '2025-02-03 00:00:00', '2025-02-06 00:00:00');
INSERT INTO `app_user` VALUES (459, 'S00000432', '吕旭', '123456', 'https://picsum.photos/200/200?random=432', 153.2, 71.9, '2025-06-03 00:00:00', '2025-05-23 00:00:00', '2025-06-22 00:00:00');
INSERT INTO `app_user` VALUES (460, 'S00000433', '金娜', '123456', 'https://picsum.photos/200/200?random=433', 160, 58.7, '2025-04-05 00:00:00', '2025-03-21 00:00:00', '2025-04-08 00:00:00');
INSERT INTO `app_user` VALUES (461, 'S00000434', '鞠建华', '123456', 'https://picsum.photos/200/200?random=434', 170.2, 65.1, '2025-05-26 00:00:00', '2025-05-19 00:00:00', '2025-06-09 00:00:00');
INSERT INTO `app_user` VALUES (462, 'S00000435', '李鑫', '123456', 'https://picsum.photos/200/200?random=435', 163.4, 64.2, '2025-01-20 00:00:00', '2025-01-06 00:00:00', '2025-01-28 00:00:00');
INSERT INTO `app_user` VALUES (463, 'S00000436', '王军', '123456', 'https://picsum.photos/200/200?random=436', 152.9, 82.7, '2025-04-25 00:00:00', '2025-03-31 00:00:00', '2025-04-22 00:00:00');
INSERT INTO `app_user` VALUES (464, 'S00000437', '严帅', '123456', 'https://picsum.photos/200/200?random=437', 176.3, 70, '2025-03-21 00:00:00', '2025-02-21 00:00:00', '2025-03-17 00:00:00');
INSERT INTO `app_user` VALUES (465, 'S00000438', '吴柳', '123456', 'https://picsum.photos/200/200?random=438', 188.7, 85.8, '2025-05-22 00:00:00', '2025-04-24 00:00:00', '2025-05-12 00:00:00');
INSERT INTO `app_user` VALUES (466, 'S00000439', '方磊', '123456', 'https://picsum.photos/200/200?random=439', 168.7, 47, '2025-02-23 00:00:00', '2025-02-05 00:00:00', '2025-02-06 00:00:00');
INSERT INTO `app_user` VALUES (467, 'S00000440', '王丽华', '123456', 'https://picsum.photos/200/200?random=440', 155.3, 48.1, '2025-05-26 00:00:00', '2025-04-26 00:00:00', '2025-05-14 00:00:00');
INSERT INTO `app_user` VALUES (468, 'S00000441', '侯红', '123456', 'https://picsum.photos/200/200?random=441', 165.2, 44.1, '2025-01-25 00:00:00', '2025-01-18 00:00:00', '2025-01-31 00:00:00');
INSERT INTO `app_user` VALUES (469, 'S00000442', '王秀梅', '123456', 'https://picsum.photos/200/200?random=442', 171.4, 56.1, '2025-02-28 00:00:00', '2025-02-24 00:00:00', '2025-03-13 00:00:00');
INSERT INTO `app_user` VALUES (470, 'S00000443', '简红梅', '123456', 'https://picsum.photos/200/200?random=443', 163.7, 58.9, '2025-04-11 00:00:00', '2025-03-12 00:00:00', '2025-04-03 00:00:00');
INSERT INTO `app_user` VALUES (471, 'S00000444', '王宇', '123456', 'https://picsum.photos/200/200?random=444', 151.7, 87.6, '2025-03-29 00:00:00', '2025-03-05 00:00:00', '2025-03-22 00:00:00');
INSERT INTO `app_user` VALUES (472, 'S00000445', '彭建', '123456', 'https://picsum.photos/200/200?random=445', 161.7, 88.9, '2025-03-21 00:00:00', '2025-02-19 00:00:00', '2025-03-11 00:00:00');
INSERT INTO `app_user` VALUES (473, 'S00000446', '包雪', '123456', 'https://picsum.photos/200/200?random=446', 157.9, 83.3, '2025-05-15 00:00:00', '2025-04-26 00:00:00', '2025-05-13 00:00:00');
INSERT INTO `app_user` VALUES (474, 'S00000447', '赖鑫', '123456', 'https://picsum.photos/200/200?random=447', 187.5, 63.8, '2025-04-05 00:00:00', '2025-03-06 00:00:00', '2025-03-31 00:00:00');
INSERT INTO `app_user` VALUES (475, 'S00000448', '韩利', '123456', 'https://picsum.photos/200/200?random=448', 164.4, 78.6, '2025-02-28 00:00:00', '2025-02-14 00:00:00', '2025-03-16 00:00:00');
INSERT INTO `app_user` VALUES (476, 'S00000449', '胡志强', '123456', 'https://picsum.photos/200/200?random=449', 187.9, 46.3, '2025-02-21 00:00:00', '2025-02-09 00:00:00', '2025-02-28 00:00:00');
INSERT INTO `app_user` VALUES (477, 'S00000450', '郝成', '123456', 'https://picsum.photos/200/200?random=450', 174.5, 69, '2025-03-13 00:00:00', '2025-02-22 00:00:00', '2025-02-25 00:00:00');
INSERT INTO `app_user` VALUES (478, 'S00000451', '刘梅', '123456', 'https://picsum.photos/200/200?random=451', 183, 54.9, '2025-04-03 00:00:00', '2025-03-14 00:00:00', '2025-04-07 00:00:00');
INSERT INTO `app_user` VALUES (479, 'S00000452', '谢淑英', '123456', 'https://picsum.photos/200/200?random=452', 182.9, 44.1, '2025-06-08 00:00:00', '2025-05-10 00:00:00', '2025-06-03 00:00:00');
INSERT INTO `app_user` VALUES (480, 'S00000453', '郭萍', '123456', 'https://picsum.photos/200/200?random=453', 174.1, 65.1, '2025-01-13 00:00:00', '2025-01-05 00:00:00', '2025-01-18 00:00:00');
INSERT INTO `app_user` VALUES (481, 'S00000454', '贾强', '123456', 'https://picsum.photos/200/200?random=454', 155.6, 43.5, '2025-06-04 00:00:00', '2025-05-29 00:00:00', '2025-06-03 00:00:00');
INSERT INTO `app_user` VALUES (482, 'S00000455', '安娜', '123456', 'https://picsum.photos/200/200?random=455', 165.8, 68.4, '2025-04-26 00:00:00', '2025-04-15 00:00:00', '2025-05-04 00:00:00');
INSERT INTO `app_user` VALUES (483, 'S00000456', '张萍', '123456', 'https://picsum.photos/200/200?random=456', 151.5, 77.7, '2025-07-26 00:00:00', '2025-06-26 00:00:00', '2025-07-17 00:00:00');
INSERT INTO `app_user` VALUES (484, 'S00000457', '吕宁', '123456', 'https://picsum.photos/200/200?random=457', 170.3, 65.9, '2025-06-16 00:00:00', '2025-05-17 00:00:00', '2025-06-13 00:00:00');
INSERT INTO `app_user` VALUES (485, 'S00000458', '吴峰', '123456', 'https://picsum.photos/200/200?random=458', 156, 68.9, '2025-04-15 00:00:00', '2025-03-19 00:00:00', '2025-03-30 00:00:00');
INSERT INTO `app_user` VALUES (486, 'S00000459', '赵燕', '123456', 'https://picsum.photos/200/200?random=459', 173.8, 66.7, '2025-04-16 00:00:00', '2025-04-14 00:00:00', '2025-04-20 00:00:00');
INSERT INTO `app_user` VALUES (487, 'S00000460', '王玉', '123456', 'https://picsum.photos/200/200?random=460', 158.1, 63.4, '2025-04-23 00:00:00', '2025-04-22 00:00:00', '2025-05-09 00:00:00');
INSERT INTO `app_user` VALUES (488, 'S00000461', '李莹', '123456', 'https://picsum.photos/200/200?random=461', 161, 67.3, '2025-04-19 00:00:00', '2025-03-23 00:00:00', '2025-04-04 00:00:00');
INSERT INTO `app_user` VALUES (489, 'S00000462', '练萍', '123456', 'https://picsum.photos/200/200?random=462', 171.5, 65.8, '2025-03-14 00:00:00', '2025-03-10 00:00:00', '2025-03-25 00:00:00');
INSERT INTO `app_user` VALUES (490, 'S00000463', '孙成', '123456', 'https://picsum.photos/200/200?random=463', 153.7, 85.4, '2025-07-08 00:00:00', '2025-06-10 00:00:00', '2025-07-07 00:00:00');
INSERT INTO `app_user` VALUES (491, 'S00000464', '陈瑞', '123456', 'https://picsum.photos/200/200?random=464', 174.4, 59.8, '2025-04-24 00:00:00', '2025-04-04 00:00:00', '2025-04-10 00:00:00');
INSERT INTO `app_user` VALUES (492, 'S00000465', '康鑫', '123456', 'https://picsum.photos/200/200?random=465', 188.6, 74, '2025-04-09 00:00:00', '2025-03-23 00:00:00', '2025-04-05 00:00:00');
INSERT INTO `app_user` VALUES (493, 'S00000466', '杨云', '123456', 'https://picsum.photos/200/200?random=466', 179.5, 76.4, '2025-06-29 00:00:00', '2025-06-20 00:00:00', '2025-07-02 00:00:00');
INSERT INTO `app_user` VALUES (494, 'S00000467', '王宁', '123456', 'https://picsum.photos/200/200?random=467', 160.9, 65, '2025-04-15 00:00:00', '2025-03-23 00:00:00', '2025-04-17 00:00:00');
INSERT INTO `app_user` VALUES (495, 'S00000468', '覃璐', '123456', 'https://picsum.photos/200/200?random=468', 171.5, 69.8, '2025-06-04 00:00:00', '2025-05-09 00:00:00', '2025-05-11 00:00:00');
INSERT INTO `app_user` VALUES (496, 'S00000469', '韩俊', '123456', 'https://picsum.photos/200/200?random=469', 177.6, 71.9, '2025-02-19 00:00:00', '2025-02-14 00:00:00', '2025-03-12 00:00:00');
INSERT INTO `app_user` VALUES (497, 'S00000470', '宋凤英', '123456', 'https://picsum.photos/200/200?random=470', 174, 40.2, '2025-06-28 00:00:00', '2025-06-01 00:00:00', '2025-06-27 00:00:00');
INSERT INTO `app_user` VALUES (498, 'S00000471', '朱琴', '123456', 'https://picsum.photos/200/200?random=471', 166.5, 50.5, '2025-06-14 00:00:00', '2025-05-24 00:00:00', '2025-06-03 00:00:00');
INSERT INTO `app_user` VALUES (499, 'S00000472', '赵洁', '123456', 'https://picsum.photos/200/200?random=472', 171.7, 45.5, '2025-05-03 00:00:00', '2025-04-05 00:00:00', '2025-04-17 00:00:00');
INSERT INTO `app_user` VALUES (500, 'S00000473', '鞠淑华', '123456', 'https://picsum.photos/200/200?random=473', 155.5, 46.9, '2025-06-14 00:00:00', '2025-06-13 00:00:00', '2025-06-28 00:00:00');
INSERT INTO `app_user` VALUES (501, 'S00000474', '冯萍', '123456', 'https://picsum.photos/200/200?random=474', 165.7, 76.7, '2025-06-02 00:00:00', '2025-05-09 00:00:00', '2025-05-23 00:00:00');
INSERT INTO `app_user` VALUES (502, 'S00000475', '郭桂芝', '123456', 'https://picsum.photos/200/200?random=475', 180.2, 83.8, '2025-04-13 00:00:00', '2025-03-23 00:00:00', '2025-04-14 00:00:00');
INSERT INTO `app_user` VALUES (503, 'S00000476', '谢健', '123456', 'https://picsum.photos/200/200?random=476', 159.2, 61.5, '2025-02-02 00:00:00', '2025-02-01 00:00:00', '2025-02-20 00:00:00');
INSERT INTO `app_user` VALUES (504, 'S00000477', '陈欣', '123456', 'https://picsum.photos/200/200?random=477', 183.4, 84.7, '2025-06-02 00:00:00', '2025-05-19 00:00:00', '2025-06-09 00:00:00');
INSERT INTO `app_user` VALUES (505, 'S00000478', '詹玉梅', '123456', 'https://picsum.photos/200/200?random=478', 180.2, 74.6, '2025-03-17 00:00:00', '2025-03-05 00:00:00', '2025-03-26 00:00:00');
INSERT INTO `app_user` VALUES (506, 'S00000479', '熊伟', '123456', 'https://picsum.photos/200/200?random=479', 155.4, 49.1, '2025-04-12 00:00:00', '2025-03-23 00:00:00', '2025-04-20 00:00:00');
INSERT INTO `app_user` VALUES (507, 'S00000480', '苏桂兰', '123456', 'https://picsum.photos/200/200?random=480', 165.9, 68.9, '2025-04-01 00:00:00', '2025-03-04 00:00:00', '2025-03-16 00:00:00');
INSERT INTO `app_user` VALUES (508, 'S00000481', '杜秀梅', '123456', 'https://picsum.photos/200/200?random=481', 181.2, 67.1, '2025-03-20 00:00:00', '2025-03-04 00:00:00', '2025-04-02 00:00:00');
INSERT INTO `app_user` VALUES (509, 'S00000482', '李丽娟', '123456', 'https://picsum.photos/200/200?random=482', 188.1, 57, '2025-03-20 00:00:00', '2025-02-21 00:00:00', '2025-03-13 00:00:00');
INSERT INTO `app_user` VALUES (510, 'S00000483', '孙明', '123456', 'https://picsum.photos/200/200?random=483', 151.8, 47.4, '2025-04-26 00:00:00', '2025-04-17 00:00:00', '2025-05-06 00:00:00');
INSERT INTO `app_user` VALUES (511, 'S00000484', '陈小红', '123456', 'https://picsum.photos/200/200?random=484', 184, 43.4, '2025-02-21 00:00:00', '2025-01-24 00:00:00', '2025-02-17 00:00:00');
INSERT INTO `app_user` VALUES (512, 'S00000485', '张建国', '123456', 'https://picsum.photos/200/200?random=485', 156.8, 68.7, '2025-04-01 00:00:00', '2025-03-15 00:00:00', '2025-04-10 00:00:00');
INSERT INTO `app_user` VALUES (513, 'S00000486', '汤鹏', '123456', 'https://picsum.photos/200/200?random=486', 158.8, 61, '2025-05-16 00:00:00', '2025-05-05 00:00:00', '2025-05-13 00:00:00');
INSERT INTO `app_user` VALUES (514, 'S00000487', '颜柳', '123456', 'https://picsum.photos/200/200?random=487', 151.4, 85.6, '2025-04-08 00:00:00', '2025-04-03 00:00:00', '2025-04-16 00:00:00');
INSERT INTO `app_user` VALUES (515, 'S00000488', '阎波', '123456', 'https://picsum.photos/200/200?random=488', 180, 84.8, '2025-05-05 00:00:00', '2025-04-28 00:00:00', '2025-05-02 00:00:00');
INSERT INTO `app_user` VALUES (516, 'S00000489', '陈飞', '123456', 'https://picsum.photos/200/200?random=489', 183.5, 62, '2025-05-24 00:00:00', '2025-05-05 00:00:00', '2025-05-30 00:00:00');
INSERT INTO `app_user` VALUES (517, 'S00000490', '陈辉', '123456', 'https://picsum.photos/200/200?random=490', 156.8, 61.5, '2025-03-21 00:00:00', '2025-03-06 00:00:00', '2025-03-16 00:00:00');
INSERT INTO `app_user` VALUES (518, 'S00000491', '甘慧', '123456', 'https://picsum.photos/200/200?random=491', 171.2, 72.1, '2025-06-27 00:00:00', '2025-06-21 00:00:00', '2025-06-30 00:00:00');
INSERT INTO `app_user` VALUES (519, 'S00000492', '李军', '123456', 'https://picsum.photos/200/200?random=492', 155, 78.4, '2025-04-07 00:00:00', '2025-03-24 00:00:00', '2025-04-11 00:00:00');
INSERT INTO `app_user` VALUES (520, 'S00000493', '张佳', '123456', 'https://picsum.photos/200/200?random=493', 185.8, 51.4, '2025-06-06 00:00:00', '2025-05-22 00:00:00', '2025-06-18 00:00:00');
INSERT INTO `app_user` VALUES (521, 'S00000494', '张秀华', '123456', 'https://picsum.photos/200/200?random=494', 161.8, 45.9, '2025-03-08 00:00:00', '2025-02-27 00:00:00', '2025-03-26 00:00:00');
INSERT INTO `app_user` VALUES (522, 'S00000495', '王荣', '123456', 'https://picsum.photos/200/200?random=495', 186.5, 53.1, '2025-02-25 00:00:00', '2025-02-14 00:00:00', '2025-03-09 00:00:00');
INSERT INTO `app_user` VALUES (523, 'S00000496', '谷建军', '123456', 'https://picsum.photos/200/200?random=496', 150.3, 77, '2025-03-21 00:00:00', '2025-02-27 00:00:00', '2025-03-20 00:00:00');
INSERT INTO `app_user` VALUES (524, 'S00000497', '张文', '123456', 'https://picsum.photos/200/200?random=497', 156.4, 53.1, '2025-05-05 00:00:00', '2025-04-16 00:00:00', '2025-05-05 00:00:00');
INSERT INTO `app_user` VALUES (525, 'S00000498', '郭利', '123456', 'https://picsum.photos/200/200?random=498', 171.2, 50, '2025-04-15 00:00:00', '2025-03-26 00:00:00', '2025-03-29 00:00:00');
INSERT INTO `app_user` VALUES (526, 'S00000499', '黄建国', '123456', 'https://picsum.photos/200/200?random=499', 181.6, 64.4, '2025-02-02 00:00:00', '2025-01-18 00:00:00', '2025-02-04 00:00:00');
INSERT INTO `app_user` VALUES (527, 'S00000500', '陈飞', '123456', 'https://picsum.photos/200/200?random=500', 161.5, 40.7, '2025-04-07 00:00:00', '2025-03-17 00:00:00', '2025-04-12 00:00:00');

-- ----------------------------
-- Table structure for bmi_change_log
-- ----------------------------
DROP TABLE IF EXISTS `bmi_change_log`;
CREATE TABLE `bmi_change_log`  (
  `id` int UNSIGNED NOT NULL AUTO_INCREMENT,
  `student_number` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '学号',
  `old_height` double NULL DEFAULT NULL COMMENT '原来的身高',
  `old_weight` double NULL DEFAULT NULL COMMENT '原来的体重',
  `new_height` double NULL DEFAULT NULL COMMENT '新的身高',
  `new_weight` double NULL DEFAULT NULL COMMENT '新的体重',
  `change_time` datetime NULL DEFAULT NULL COMMENT '更改时间',
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `idx_student_time`(`student_number` ASC, `change_time` ASC) USING BTREE,
  INDEX `idx_height_weight`(`new_height` ASC, `new_weight` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1298 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户BMI改变记录' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of bmi_change_log
-- ----------------------------
INSERT INTO `bmi_change_log` VALUES (1, '2333311220111', 190, 50, 180, 50, '2025-06-07 10:26:06');
INSERT INTO `bmi_change_log` VALUES (2, '2333311220111', 180, 50, 10, 50, '2025-06-07 10:43:43');
INSERT INTO `bmi_change_log` VALUES (3, '2333311220111', 10, 50, 170, 50, '2025-06-07 10:43:51');
INSERT INTO `bmi_change_log` VALUES (4, 'S00000003', NULL, NULL, 171.2, 85.2, '2025-06-07 15:55:11');
INSERT INTO `bmi_change_log` VALUES (6, 'S00000001', NULL, NULL, 149.8, 68.3, '2025-04-23 18:34:00');
INSERT INTO `bmi_change_log` VALUES (7, 'S00000001', 149.8, 68.3, 151.6, 69.2, '2025-02-25 20:39:00');
INSERT INTO `bmi_change_log` VALUES (8, 'S00000001', 151.6, 69.2, 153.4, 68.5, '2025-03-24 15:47:00');
INSERT INTO `bmi_change_log` VALUES (9, 'S00000001', 153.4, 68.5, 155.2, 71.4, '2025-03-02 02:26:00');
INSERT INTO `bmi_change_log` VALUES (10, 'S00000002', NULL, NULL, 155.9, 82.9, '2025-02-01 10:50:00');
INSERT INTO `bmi_change_log` VALUES (11, 'S00000002', 155.9, 82.9, 154.8, 82.4, '2025-03-26 05:03:00');
INSERT INTO `bmi_change_log` VALUES (12, 'S00000002', 154.8, 82.4, 154.1, 83.5, '2025-02-06 04:52:00');
INSERT INTO `bmi_change_log` VALUES (13, 'S00000003', NULL, NULL, 158.2, 51.5, '2025-05-27 11:44:00');
INSERT INTO `bmi_change_log` VALUES (14, 'S00000003', 158.2, 51.5, 158.6, 54, '2025-06-29 16:31:00');
INSERT INTO `bmi_change_log` VALUES (15, 'S00000003', 158.6, 54, 158.4, 56.7, '2025-05-09 13:24:00');
INSERT INTO `bmi_change_log` VALUES (16, 'S00000003', 158.4, 56.7, 156.4, 55.5, '2025-05-13 01:45:00');
INSERT INTO `bmi_change_log` VALUES (17, 'S00000003', 156.4, 55.5, 155.5, 55.1, '2025-05-28 00:45:00');
INSERT INTO `bmi_change_log` VALUES (18, 'S00000004', NULL, NULL, 150.5, 74.7, '2025-04-28 15:28:00');
INSERT INTO `bmi_change_log` VALUES (19, 'S00000004', 150.5, 74.7, 150.9, 76.4, '2025-05-01 21:58:00');
INSERT INTO `bmi_change_log` VALUES (20, 'S00000004', 150.9, 76.4, 150.4, 78.1, '2025-03-29 15:13:00');
INSERT INTO `bmi_change_log` VALUES (21, 'S00000005', NULL, NULL, 174.7, 42.9, '2025-04-13 20:50:00');
INSERT INTO `bmi_change_log` VALUES (22, 'S00000005', 174.7, 42.9, 173.9, 43.6, '2025-05-05 05:49:00');
INSERT INTO `bmi_change_log` VALUES (23, 'S00000005', 173.9, 43.6, 174.7, 45.9, '2025-03-21 00:06:00');
INSERT INTO `bmi_change_log` VALUES (24, 'S00000006', NULL, NULL, 176.9, 63.8, '2025-06-25 01:00:00');
INSERT INTO `bmi_change_log` VALUES (25, 'S00000006', 176.9, 63.8, 177.3, 65.5, '2025-04-18 21:28:00');
INSERT INTO `bmi_change_log` VALUES (26, 'S00000007', NULL, NULL, 182, 78.6, '2025-03-10 03:22:00');
INSERT INTO `bmi_change_log` VALUES (27, 'S00000007', 182, 78.6, 180.2, 77.8, '2025-01-27 09:18:00');
INSERT INTO `bmi_change_log` VALUES (28, 'S00000007', 180.2, 77.8, 181.5, 75.1, '2025-03-19 14:18:00');
INSERT INTO `bmi_change_log` VALUES (29, 'S00000007', 181.5, 75.1, 180.7, 77.3, '2025-04-11 10:12:00');
INSERT INTO `bmi_change_log` VALUES (30, 'S00000008', NULL, NULL, 176.6, 71.2, '2025-07-23 15:57:00');
INSERT INTO `bmi_change_log` VALUES (31, 'S00000009', NULL, NULL, 165.4, 74.6, '2025-07-17 12:35:00');
INSERT INTO `bmi_change_log` VALUES (32, 'S00000010', NULL, NULL, 176.7, 86.8, '2025-05-20 00:01:00');
INSERT INTO `bmi_change_log` VALUES (33, 'S00000010', 176.7, 86.8, 176.8, 85, '2025-04-28 00:02:00');
INSERT INTO `bmi_change_log` VALUES (34, 'S00000010', 176.8, 85, 175.1, 85.7, '2025-06-27 19:50:00');
INSERT INTO `bmi_change_log` VALUES (35, 'S00000010', 175.1, 85.7, 177, 83.5, '2025-06-27 17:28:00');
INSERT INTO `bmi_change_log` VALUES (36, 'S00000010', 177, 83.5, 178.9, 85.6, '2025-07-09 04:28:00');
INSERT INTO `bmi_change_log` VALUES (37, 'S00000011', NULL, NULL, 167.9, 83.6, '2025-04-08 21:38:00');
INSERT INTO `bmi_change_log` VALUES (38, 'S00000011', 167.9, 83.6, 167.7, 85.4, '2025-03-14 07:43:00');
INSERT INTO `bmi_change_log` VALUES (39, 'S00000011', 167.7, 85.4, 168.7, 86.7, '2025-02-26 20:19:00');
INSERT INTO `bmi_change_log` VALUES (40, 'S00000011', 168.7, 86.7, 168.8, 86, '2025-02-10 01:31:00');
INSERT INTO `bmi_change_log` VALUES (41, 'S00000012', NULL, NULL, 169.3, 48.6, '2025-06-23 11:16:00');
INSERT INTO `bmi_change_log` VALUES (42, 'S00000012', 169.3, 48.6, 170.5, 47, '2025-05-18 23:56:00');
INSERT INTO `bmi_change_log` VALUES (43, 'S00000012', 170.5, 47, 171.6, 47.1, '2025-06-08 12:33:00');
INSERT INTO `bmi_change_log` VALUES (44, 'S00000012', 171.6, 47.1, 172, 45.2, '2025-06-21 04:10:00');
INSERT INTO `bmi_change_log` VALUES (45, 'S00000013', NULL, NULL, 155.8, 52.1, '2025-06-22 03:17:00');
INSERT INTO `bmi_change_log` VALUES (46, 'S00000013', 155.8, 52.1, 156.6, 51.2, '2025-06-09 04:41:00');
INSERT INTO `bmi_change_log` VALUES (47, 'S00000014', NULL, NULL, 155.6, 55.1, '2025-05-17 06:49:00');
INSERT INTO `bmi_change_log` VALUES (48, 'S00000014', 155.6, 55.1, 157.3, 53.9, '2025-04-17 23:00:00');
INSERT INTO `bmi_change_log` VALUES (49, 'S00000014', 157.3, 53.9, 157.5, 56.1, '2025-03-25 18:31:00');
INSERT INTO `bmi_change_log` VALUES (50, 'S00000014', 157.5, 56.1, 157.9, 55.9, '2025-04-03 14:59:00');
INSERT INTO `bmi_change_log` VALUES (51, 'S00000015', NULL, NULL, 177, 62.3, '2025-03-21 09:25:00');
INSERT INTO `bmi_change_log` VALUES (52, 'S00000015', 177, 62.3, 176.9, 61.7, '2025-04-04 01:24:00');
INSERT INTO `bmi_change_log` VALUES (53, 'S00000015', 176.9, 61.7, 175, 63.3, '2025-04-15 10:36:00');
INSERT INTO `bmi_change_log` VALUES (54, 'S00000015', 175, 63.3, 174.6, 62.6, '2025-03-22 21:42:00');
INSERT INTO `bmi_change_log` VALUES (55, 'S00000015', 174.6, 62.6, 175.1, 64, '2025-02-26 08:42:00');
INSERT INTO `bmi_change_log` VALUES (56, 'S00000016', NULL, NULL, 175.8, 87.8, '2025-02-06 23:27:00');
INSERT INTO `bmi_change_log` VALUES (57, 'S00000016', 175.8, 87.8, 173.9, 88.1, '2025-02-24 22:43:00');
INSERT INTO `bmi_change_log` VALUES (58, 'S00000016', 173.9, 88.1, 173.8, 87.3, '2025-03-12 15:20:00');
INSERT INTO `bmi_change_log` VALUES (59, 'S00000017', NULL, NULL, 153.9, 65.6, '2025-07-21 15:51:00');
INSERT INTO `bmi_change_log` VALUES (60, 'S00000017', 153.9, 65.6, 154.8, 63.3, '2025-06-08 20:02:00');
INSERT INTO `bmi_change_log` VALUES (61, 'S00000017', 154.8, 63.3, 155.8, 63.7, '2025-06-08 10:07:00');
INSERT INTO `bmi_change_log` VALUES (62, 'S00000017', 155.8, 63.7, 157.5, 61.1, '2025-07-23 06:21:00');
INSERT INTO `bmi_change_log` VALUES (63, 'S00000017', 157.5, 61.1, 159, 60.5, '2025-07-18 15:13:00');
INSERT INTO `bmi_change_log` VALUES (64, 'S00000018', NULL, NULL, 161.4, 67.5, '2025-06-08 07:27:00');
INSERT INTO `bmi_change_log` VALUES (65, 'S00000018', 161.4, 67.5, 159.8, 64.5, '2025-05-28 00:47:00');
INSERT INTO `bmi_change_log` VALUES (66, 'S00000018', 159.8, 64.5, 158.8, 67.4, '2025-07-03 14:15:00');
INSERT INTO `bmi_change_log` VALUES (67, 'S00000018', 158.8, 67.4, 160.7, 69.9, '2025-04-08 01:18:00');
INSERT INTO `bmi_change_log` VALUES (68, 'S00000019', NULL, NULL, 177.4, 87.3, '2025-06-26 05:50:00');
INSERT INTO `bmi_change_log` VALUES (69, 'S00000019', 177.4, 87.3, 176.6, 87.7, '2025-07-20 10:25:00');
INSERT INTO `bmi_change_log` VALUES (70, 'S00000019', 176.6, 87.7, 175.2, 85, '2025-07-20 09:45:00');
INSERT INTO `bmi_change_log` VALUES (71, 'S00000020', NULL, NULL, 163.1, 51.1, '2025-07-03 10:05:00');
INSERT INTO `bmi_change_log` VALUES (72, 'S00000020', 163.1, 51.1, 161.2, 48.6, '2025-08-14 05:30:00');
INSERT INTO `bmi_change_log` VALUES (73, 'S00000021', NULL, NULL, 177.7, 62.1, '2025-06-09 15:55:00');
INSERT INTO `bmi_change_log` VALUES (74, 'S00000021', 177.7, 62.1, 176.2, 61.3, '2025-05-30 08:53:00');
INSERT INTO `bmi_change_log` VALUES (75, 'S00000021', 176.2, 61.3, 174.9, 60.3, '2025-07-12 23:42:00');
INSERT INTO `bmi_change_log` VALUES (76, 'S00000021', 174.9, 60.3, 175.4, 59.5, '2025-05-22 17:20:00');
INSERT INTO `bmi_change_log` VALUES (77, 'S00000022', NULL, NULL, 163.8, 50, '2025-07-27 18:12:00');
INSERT INTO `bmi_change_log` VALUES (78, 'S00000022', 163.8, 50, 164.5, 52.8, '2025-07-19 12:40:00');
INSERT INTO `bmi_change_log` VALUES (79, 'S00000022', 164.5, 52.8, 164.6, 53.2, '2025-09-04 22:46:00');
INSERT INTO `bmi_change_log` VALUES (80, 'S00000022', 164.6, 53.2, 164.5, 53.9, '2025-07-17 02:43:00');
INSERT INTO `bmi_change_log` VALUES (81, 'S00000022', 164.5, 53.9, 163.2, 51.7, '2025-08-22 08:21:00');
INSERT INTO `bmi_change_log` VALUES (82, 'S00000023', NULL, NULL, 171.9, 83.6, '2025-04-06 01:18:00');
INSERT INTO `bmi_change_log` VALUES (83, 'S00000023', 171.9, 83.6, 170.6, 85.4, '2025-04-09 21:10:00');
INSERT INTO `bmi_change_log` VALUES (84, 'S00000023', 170.6, 85.4, 170.6, 84.7, '2025-01-30 13:04:00');
INSERT INTO `bmi_change_log` VALUES (85, 'S00000023', 170.6, 84.7, 168.6, 85.5, '2025-04-12 23:34:00');
INSERT INTO `bmi_change_log` VALUES (86, 'S00000023', 168.6, 85.5, 169.1, 87.2, '2025-01-25 06:22:00');
INSERT INTO `bmi_change_log` VALUES (87, 'S00000024', NULL, NULL, 172.1, 67.7, '2025-03-18 03:15:00');
INSERT INTO `bmi_change_log` VALUES (88, 'S00000024', 172.1, 67.7, 170.2, 69.6, '2025-03-11 12:04:00');
INSERT INTO `bmi_change_log` VALUES (89, 'S00000024', 170.2, 69.6, 172.1, 71.9, '2025-04-12 06:13:00');
INSERT INTO `bmi_change_log` VALUES (90, 'S00000025', NULL, NULL, 182, 72, '2025-04-16 21:36:00');
INSERT INTO `bmi_change_log` VALUES (91, 'S00000026', NULL, NULL, 157.8, 78.1, '2025-04-11 13:00:00');
INSERT INTO `bmi_change_log` VALUES (92, 'S00000026', 157.8, 78.1, 157, 79.7, '2025-01-31 17:54:00');
INSERT INTO `bmi_change_log` VALUES (93, 'S00000026', 157, 79.7, 157.1, 79.4, '2025-03-10 12:28:00');
INSERT INTO `bmi_change_log` VALUES (94, 'S00000027', NULL, NULL, 179.1, 69.2, '2025-05-07 23:16:00');
INSERT INTO `bmi_change_log` VALUES (95, 'S00000027', 179.1, 69.2, 180.3, 66.3, '2025-05-01 23:46:00');
INSERT INTO `bmi_change_log` VALUES (96, 'S00000027', 180.3, 66.3, 178.4, 66, '2025-05-21 04:44:00');
INSERT INTO `bmi_change_log` VALUES (97, 'S00000027', 178.4, 66, 178.5, 66, '2025-04-29 19:17:00');
INSERT INTO `bmi_change_log` VALUES (98, 'S00000028', NULL, NULL, 170.8, 60, '2025-04-02 17:41:00');
INSERT INTO `bmi_change_log` VALUES (99, 'S00000029', NULL, NULL, 169.2, 78.3, '2025-09-02 00:30:00');
INSERT INTO `bmi_change_log` VALUES (100, 'S00000029', 169.2, 78.3, 170.9, 77.7, '2025-08-11 20:13:00');
INSERT INTO `bmi_change_log` VALUES (101, 'S00000030', NULL, NULL, 153.5, 86.1, '2025-07-17 17:27:00');
INSERT INTO `bmi_change_log` VALUES (102, 'S00000030', 153.5, 86.1, 155.2, 88.9, '2025-06-07 10:18:00');
INSERT INTO `bmi_change_log` VALUES (103, 'S00000030', 155.2, 88.9, 157, 86, '2025-06-17 19:38:00');
INSERT INTO `bmi_change_log` VALUES (104, 'S00000031', NULL, NULL, 165.5, 47.7, '2025-05-25 22:11:00');
INSERT INTO `bmi_change_log` VALUES (105, 'S00000031', 165.5, 47.7, 164, 50.3, '2025-04-05 20:40:00');
INSERT INTO `bmi_change_log` VALUES (106, 'S00000031', 164, 50.3, 163.2, 48.3, '2025-04-01 20:11:00');
INSERT INTO `bmi_change_log` VALUES (107, 'S00000031', 163.2, 48.3, 162.5, 49.3, '2025-04-13 15:31:00');
INSERT INTO `bmi_change_log` VALUES (108, 'S00000031', 162.5, 49.3, 161.6, 50.6, '2025-05-17 09:55:00');
INSERT INTO `bmi_change_log` VALUES (109, 'S00000032', NULL, NULL, 153.2, 44.4, '2025-03-20 02:28:00');
INSERT INTO `bmi_change_log` VALUES (110, 'S00000032', 153.2, 44.4, 154.9, 47.2, '2025-03-31 18:42:00');
INSERT INTO `bmi_change_log` VALUES (111, 'S00000033', NULL, NULL, 182.1, 63.9, '2025-07-02 21:28:00');
INSERT INTO `bmi_change_log` VALUES (112, 'S00000033', 182.1, 63.9, 182.6, 61.5, '2025-09-19 19:09:00');
INSERT INTO `bmi_change_log` VALUES (113, 'S00000033', 182.6, 61.5, 184.1, 59.1, '2025-07-01 06:21:00');
INSERT INTO `bmi_change_log` VALUES (114, 'S00000034', NULL, NULL, 186.7, 77.9, '2025-05-11 00:37:00');
INSERT INTO `bmi_change_log` VALUES (115, 'S00000035', NULL, NULL, 177.6, 73.6, '2025-07-12 10:16:00');
INSERT INTO `bmi_change_log` VALUES (116, 'S00000036', NULL, NULL, 156, 87.2, '2025-01-18 07:54:00');
INSERT INTO `bmi_change_log` VALUES (117, 'S00000037', NULL, NULL, 179.6, 85.8, '2025-08-04 11:38:00');
INSERT INTO `bmi_change_log` VALUES (118, 'S00000037', 179.6, 85.8, 181.2, 88.2, '2025-05-20 00:39:00');
INSERT INTO `bmi_change_log` VALUES (119, 'S00000037', 181.2, 88.2, 180.3, 90, '2025-08-07 19:31:00');
INSERT INTO `bmi_change_log` VALUES (120, 'S00000038', NULL, NULL, 188.4, 40.8, '2025-08-23 11:50:00');
INSERT INTO `bmi_change_log` VALUES (121, 'S00000039', NULL, NULL, 167.3, 53.8, '2025-03-10 10:28:00');
INSERT INTO `bmi_change_log` VALUES (122, 'S00000040', NULL, NULL, 153.9, 89.8, '2025-05-23 02:40:00');
INSERT INTO `bmi_change_log` VALUES (123, 'S00000040', 153.9, 89.8, 155, 92.4, '2025-04-25 21:31:00');
INSERT INTO `bmi_change_log` VALUES (124, 'S00000040', 155, 92.4, 156.9, 93.4, '2025-07-08 02:24:00');
INSERT INTO `bmi_change_log` VALUES (125, 'S00000040', 156.9, 93.4, 158.6, 93.4, '2025-05-17 00:11:00');
INSERT INTO `bmi_change_log` VALUES (126, 'S00000041', NULL, NULL, 169.5, 60.8, '2025-02-27 00:05:00');
INSERT INTO `bmi_change_log` VALUES (127, 'S00000041', 169.5, 60.8, 171.4, 58.7, '2025-04-04 18:36:00');
INSERT INTO `bmi_change_log` VALUES (128, 'S00000041', 171.4, 58.7, 172.9, 61.1, '2025-03-13 03:03:00');
INSERT INTO `bmi_change_log` VALUES (129, 'S00000041', 172.9, 61.1, 173.5, 63.1, '2025-05-13 04:15:00');
INSERT INTO `bmi_change_log` VALUES (130, 'S00000041', 173.5, 63.1, 171.6, 64.9, '2025-05-14 07:16:00');
INSERT INTO `bmi_change_log` VALUES (131, 'S00000042', NULL, NULL, 170.9, 62.1, '2025-06-04 17:28:00');
INSERT INTO `bmi_change_log` VALUES (132, 'S00000042', 170.9, 62.1, 170.3, 59.7, '2025-06-18 12:36:00');
INSERT INTO `bmi_change_log` VALUES (133, 'S00000042', 170.3, 59.7, 169.7, 58.1, '2025-06-16 18:41:00');
INSERT INTO `bmi_change_log` VALUES (134, 'S00000043', NULL, NULL, 163.4, 44.4, '2025-08-13 08:36:00');
INSERT INTO `bmi_change_log` VALUES (135, 'S00000043', 163.4, 44.4, 162.3, 42.7, '2025-07-31 18:01:00');
INSERT INTO `bmi_change_log` VALUES (136, 'S00000043', 162.3, 42.7, 161.3, 43.9, '2025-07-13 05:23:00');
INSERT INTO `bmi_change_log` VALUES (137, 'S00000044', NULL, NULL, 176.5, 74.2, '2025-02-25 09:41:00');
INSERT INTO `bmi_change_log` VALUES (138, 'S00000044', 176.5, 74.2, 175.5, 74.4, '2025-03-11 20:06:00');
INSERT INTO `bmi_change_log` VALUES (139, 'S00000045', NULL, NULL, 167.2, 73, '2025-05-08 05:35:00');
INSERT INTO `bmi_change_log` VALUES (140, 'S00000045', 167.2, 73, 167.4, 70.8, '2025-04-18 07:28:00');
INSERT INTO `bmi_change_log` VALUES (141, 'S00000045', 167.4, 70.8, 165.4, 71.5, '2025-03-17 17:03:00');
INSERT INTO `bmi_change_log` VALUES (142, 'S00000045', 165.4, 71.5, 165.5, 71.1, '2025-04-17 05:29:00');
INSERT INTO `bmi_change_log` VALUES (143, 'S00000045', 165.5, 71.1, 166, 72.5, '2025-03-05 19:05:00');
INSERT INTO `bmi_change_log` VALUES (144, 'S00000046', NULL, NULL, 177.9, 75.7, '2025-04-26 01:58:00');
INSERT INTO `bmi_change_log` VALUES (145, 'S00000046', 177.9, 75.7, 177.6, 75.3, '2025-04-28 19:35:00');
INSERT INTO `bmi_change_log` VALUES (146, 'S00000047', NULL, NULL, 187.9, 81.8, '2025-05-31 22:42:00');
INSERT INTO `bmi_change_log` VALUES (147, 'S00000047', 187.9, 81.8, 188.4, 84.2, '2025-05-18 21:57:00');
INSERT INTO `bmi_change_log` VALUES (148, 'S00000047', 188.4, 84.2, 190.3, 82.3, '2025-05-20 09:39:00');
INSERT INTO `bmi_change_log` VALUES (149, 'S00000047', 190.3, 82.3, 189.4, 83.7, '2025-06-06 17:16:00');
INSERT INTO `bmi_change_log` VALUES (150, 'S00000048', NULL, NULL, 157.4, 71.8, '2025-08-26 12:42:00');
INSERT INTO `bmi_change_log` VALUES (151, 'S00000048', 157.4, 71.8, 157.3, 70.5, '2025-08-31 14:57:00');
INSERT INTO `bmi_change_log` VALUES (152, 'S00000048', 157.3, 70.5, 158.9, 68.2, '2025-08-29 06:29:00');
INSERT INTO `bmi_change_log` VALUES (153, 'S00000049', NULL, NULL, 176.6, 60.1, '2025-08-06 09:54:00');
INSERT INTO `bmi_change_log` VALUES (154, 'S00000050', NULL, NULL, 163, 52.5, '2025-03-11 05:28:00');
INSERT INTO `bmi_change_log` VALUES (155, 'S00000051', NULL, NULL, 151.8, 85.6, '2025-07-25 05:56:00');
INSERT INTO `bmi_change_log` VALUES (156, 'S00000052', NULL, NULL, 176.8, 45, '2025-07-15 04:46:00');
INSERT INTO `bmi_change_log` VALUES (157, 'S00000052', 176.8, 45, 175.2, 47.8, '2025-06-08 02:04:00');
INSERT INTO `bmi_change_log` VALUES (158, 'S00000052', 175.2, 47.8, 177, 49, '2025-07-02 05:08:00');
INSERT INTO `bmi_change_log` VALUES (159, 'S00000053', NULL, NULL, 179.6, 67.8, '2025-05-25 08:09:00');
INSERT INTO `bmi_change_log` VALUES (160, 'S00000053', 179.6, 67.8, 180.5, 68.7, '2025-06-09 08:54:00');
INSERT INTO `bmi_change_log` VALUES (161, 'S00000054', NULL, NULL, 180.3, 40.9, '2025-02-16 09:20:00');
INSERT INTO `bmi_change_log` VALUES (162, 'S00000054', 180.3, 40.9, 182.1, 39.9, '2025-03-21 23:25:00');
INSERT INTO `bmi_change_log` VALUES (163, 'S00000054', 182.1, 39.9, 180.3, 42, '2025-05-12 23:59:00');
INSERT INTO `bmi_change_log` VALUES (164, 'S00000054', 180.3, 42, 181.6, 44.3, '2025-04-30 23:34:00');
INSERT INTO `bmi_change_log` VALUES (165, 'S00000055', NULL, NULL, 155.8, 71.2, '2025-06-24 15:50:00');
INSERT INTO `bmi_change_log` VALUES (166, 'S00000055', 155.8, 71.2, 157.4, 72.5, '2025-05-24 05:25:00');
INSERT INTO `bmi_change_log` VALUES (167, 'S00000055', 157.4, 72.5, 158.4, 69.7, '2025-05-05 23:23:00');
INSERT INTO `bmi_change_log` VALUES (168, 'S00000055', 158.4, 69.7, 160.4, 71.6, '2025-06-06 00:26:00');
INSERT INTO `bmi_change_log` VALUES (169, 'S00000056', NULL, NULL, 167.5, 50, '2025-05-16 11:15:00');
INSERT INTO `bmi_change_log` VALUES (170, 'S00000056', 167.5, 50, 168.4, 51.2, '2025-05-12 23:06:00');
INSERT INTO `bmi_change_log` VALUES (171, 'S00000056', 168.4, 51.2, 168.3, 49.5, '2025-04-17 20:20:00');
INSERT INTO `bmi_change_log` VALUES (172, 'S00000057', NULL, NULL, 153.9, 45, '2025-01-24 21:27:00');
INSERT INTO `bmi_change_log` VALUES (173, 'S00000057', 153.9, 45, 154.8, 45.8, '2025-04-13 00:33:00');
INSERT INTO `bmi_change_log` VALUES (174, 'S00000057', 154.8, 45.8, 153.2, 47.8, '2025-02-26 05:09:00');
INSERT INTO `bmi_change_log` VALUES (175, 'S00000058', NULL, NULL, 164.4, 79.3, '2025-05-05 10:26:00');
INSERT INTO `bmi_change_log` VALUES (176, 'S00000058', 164.4, 79.3, 163.8, 78.4, '2025-06-26 19:37:00');
INSERT INTO `bmi_change_log` VALUES (177, 'S00000058', 163.8, 78.4, 165.7, 77.4, '2025-06-02 10:15:00');
INSERT INTO `bmi_change_log` VALUES (178, 'S00000058', 165.7, 77.4, 166.4, 77.1, '2025-07-13 14:51:00');
INSERT INTO `bmi_change_log` VALUES (179, 'S00000059', NULL, NULL, 166, 50.1, '2025-05-12 22:28:00');
INSERT INTO `bmi_change_log` VALUES (180, 'S00000059', 166, 50.1, 167.1, 52.1, '2025-05-24 21:33:00');
INSERT INTO `bmi_change_log` VALUES (181, 'S00000059', 167.1, 52.1, 166.2, 49.1, '2025-05-09 07:06:00');
INSERT INTO `bmi_change_log` VALUES (182, 'S00000059', 166.2, 49.1, 166.5, 50.7, '2025-06-10 23:34:00');
INSERT INTO `bmi_change_log` VALUES (183, 'S00000059', 166.5, 50.7, 167.3, 49.8, '2025-05-31 08:04:00');
INSERT INTO `bmi_change_log` VALUES (184, 'S00000060', NULL, NULL, 169.4, 52.9, '2025-07-27 01:32:00');
INSERT INTO `bmi_change_log` VALUES (185, 'S00000061', NULL, NULL, 171.9, 49.4, '2025-08-26 14:20:00');
INSERT INTO `bmi_change_log` VALUES (186, 'S00000061', 171.9, 49.4, 170.2, 47.9, '2025-06-05 11:42:00');
INSERT INTO `bmi_change_log` VALUES (187, 'S00000061', 170.2, 47.9, 169.8, 47, '2025-06-11 17:18:00');
INSERT INTO `bmi_change_log` VALUES (188, 'S00000061', 169.8, 47, 171.3, 47.9, '2025-06-25 01:41:00');
INSERT INTO `bmi_change_log` VALUES (189, 'S00000062', NULL, NULL, 153.8, 57.2, '2025-05-10 15:48:00');
INSERT INTO `bmi_change_log` VALUES (190, 'S00000063', NULL, NULL, 149.2, 54.9, '2025-04-28 09:15:00');
INSERT INTO `bmi_change_log` VALUES (191, 'S00000063', 149.2, 54.9, 150.3, 57.4, '2025-06-12 13:36:00');
INSERT INTO `bmi_change_log` VALUES (192, 'S00000063', 150.3, 57.4, 149.4, 55.4, '2025-05-23 11:36:00');
INSERT INTO `bmi_change_log` VALUES (193, 'S00000063', 149.4, 55.4, 150.1, 55.6, '2025-07-03 14:21:00');
INSERT INTO `bmi_change_log` VALUES (194, 'S00000063', 150.1, 55.6, 148.6, 57.5, '2025-04-26 01:17:00');
INSERT INTO `bmi_change_log` VALUES (195, 'S00000064', NULL, NULL, 151.9, 89, '2025-06-16 08:44:00');
INSERT INTO `bmi_change_log` VALUES (196, 'S00000065', NULL, NULL, 182.3, 68.4, '2025-04-27 21:19:00');
INSERT INTO `bmi_change_log` VALUES (197, 'S00000065', 182.3, 68.4, 183.5, 67.3, '2025-04-13 17:06:00');
INSERT INTO `bmi_change_log` VALUES (198, 'S00000065', 183.5, 67.3, 181.7, 65.9, '2025-04-22 03:29:00');
INSERT INTO `bmi_change_log` VALUES (199, 'S00000065', 181.7, 65.9, 182.2, 64.6, '2025-05-16 22:48:00');
INSERT INTO `bmi_change_log` VALUES (200, 'S00000066', NULL, NULL, 164.6, 57.6, '2025-02-05 19:14:00');
INSERT INTO `bmi_change_log` VALUES (201, 'S00000066', 164.6, 57.6, 163.8, 57.6, '2025-03-11 19:35:00');
INSERT INTO `bmi_change_log` VALUES (202, 'S00000066', 163.8, 57.6, 162.1, 58.4, '2025-02-04 22:49:00');
INSERT INTO `bmi_change_log` VALUES (203, 'S00000067', NULL, NULL, 169.2, 47.5, '2025-04-16 07:25:00');
INSERT INTO `bmi_change_log` VALUES (204, 'S00000067', 169.2, 47.5, 169.7, 49.9, '2025-06-03 10:36:00');
INSERT INTO `bmi_change_log` VALUES (205, 'S00000067', 169.7, 49.9, 171.6, 48, '2025-05-19 22:42:00');
INSERT INTO `bmi_change_log` VALUES (206, 'S00000067', 171.6, 48, 172.6, 46.8, '2025-03-11 13:29:00');
INSERT INTO `bmi_change_log` VALUES (207, 'S00000068', NULL, NULL, 159.1, 73.9, '2025-05-29 16:03:00');
INSERT INTO `bmi_change_log` VALUES (208, 'S00000068', 159.1, 73.9, 158.1, 72.9, '2025-06-13 23:53:00');
INSERT INTO `bmi_change_log` VALUES (209, 'S00000068', 158.1, 72.9, 156.6, 73.5, '2025-05-17 13:12:00');
INSERT INTO `bmi_change_log` VALUES (210, 'S00000069', NULL, NULL, 185.6, 85.4, '2025-05-13 09:57:00');
INSERT INTO `bmi_change_log` VALUES (211, 'S00000069', 185.6, 85.4, 183.7, 87.2, '2025-04-21 16:49:00');
INSERT INTO `bmi_change_log` VALUES (212, 'S00000069', 183.7, 87.2, 185.4, 88.5, '2025-04-04 10:52:00');
INSERT INTO `bmi_change_log` VALUES (213, 'S00000069', 185.4, 88.5, 184.7, 87.4, '2025-05-20 20:56:00');
INSERT INTO `bmi_change_log` VALUES (214, 'S00000069', 184.7, 87.4, 185, 84.5, '2025-05-10 23:52:00');
INSERT INTO `bmi_change_log` VALUES (215, 'S00000070', NULL, NULL, 184.9, 74.1, '2025-07-09 06:19:00');
INSERT INTO `bmi_change_log` VALUES (216, 'S00000070', 184.9, 74.1, 186.4, 71.9, '2025-07-23 12:44:00');
INSERT INTO `bmi_change_log` VALUES (217, 'S00000071', NULL, NULL, 186.4, 88.8, '2025-06-21 09:31:00');
INSERT INTO `bmi_change_log` VALUES (218, 'S00000071', 186.4, 88.8, 186.8, 90.3, '2025-07-14 03:22:00');
INSERT INTO `bmi_change_log` VALUES (219, 'S00000071', 186.8, 90.3, 188.5, 88.5, '2025-08-10 11:53:00');
INSERT INTO `bmi_change_log` VALUES (220, 'S00000071', 188.5, 88.5, 187.3, 88.2, '2025-08-04 08:06:00');
INSERT INTO `bmi_change_log` VALUES (221, 'S00000071', 187.3, 88.2, 186.5, 85.9, '2025-08-03 11:21:00');
INSERT INTO `bmi_change_log` VALUES (222, 'S00000072', NULL, NULL, 191.3, 51.6, '2025-04-22 08:22:00');
INSERT INTO `bmi_change_log` VALUES (223, 'S00000072', 191.3, 51.6, 192.7, 54.1, '2025-04-04 20:32:00');
INSERT INTO `bmi_change_log` VALUES (224, 'S00000072', 192.7, 54.1, 191, 53.9, '2025-05-06 04:41:00');
INSERT INTO `bmi_change_log` VALUES (225, 'S00000072', 191, 53.9, 191.9, 52.3, '2025-04-21 19:56:00');
INSERT INTO `bmi_change_log` VALUES (226, 'S00000072', 191.9, 52.3, 191.7, 50.7, '2025-03-07 07:02:00');
INSERT INTO `bmi_change_log` VALUES (227, 'S00000073', NULL, NULL, 175.7, 70.3, '2025-05-05 15:54:00');
INSERT INTO `bmi_change_log` VALUES (228, 'S00000073', 175.7, 70.3, 176.4, 71.8, '2025-03-21 01:40:00');
INSERT INTO `bmi_change_log` VALUES (229, 'S00000073', 176.4, 71.8, 174.9, 69.6, '2025-06-02 02:08:00');
INSERT INTO `bmi_change_log` VALUES (230, 'S00000073', 174.9, 69.6, 175.6, 71.4, '2025-05-11 16:51:00');
INSERT INTO `bmi_change_log` VALUES (231, 'S00000073', 175.6, 71.4, 174.6, 68.9, '2025-04-15 21:01:00');
INSERT INTO `bmi_change_log` VALUES (232, 'S00000074', NULL, NULL, 171.9, 67.6, '2025-04-01 19:42:00');
INSERT INTO `bmi_change_log` VALUES (233, 'S00000074', 171.9, 67.6, 171.3, 70.1, '2025-02-20 00:45:00');
INSERT INTO `bmi_change_log` VALUES (234, 'S00000074', 171.3, 70.1, 171.8, 72.5, '2025-03-17 14:51:00');
INSERT INTO `bmi_change_log` VALUES (235, 'S00000074', 171.8, 72.5, 173.1, 74.7, '2025-03-17 07:01:00');
INSERT INTO `bmi_change_log` VALUES (236, 'S00000074', 173.1, 74.7, 171.8, 76.6, '2025-02-09 11:27:00');
INSERT INTO `bmi_change_log` VALUES (237, 'S00000075', NULL, NULL, 169.9, 67.4, '2025-06-07 21:39:00');
INSERT INTO `bmi_change_log` VALUES (238, 'S00000075', 169.9, 67.4, 168.9, 64.8, '2025-06-16 12:40:00');
INSERT INTO `bmi_change_log` VALUES (239, 'S00000075', 168.9, 64.8, 167.3, 63.8, '2025-07-27 09:19:00');
INSERT INTO `bmi_change_log` VALUES (240, 'S00000075', 167.3, 63.8, 166.1, 64.9, '2025-07-19 02:25:00');
INSERT INTO `bmi_change_log` VALUES (241, 'S00000075', 166.1, 64.9, 164.4, 65.5, '2025-05-26 06:58:00');
INSERT INTO `bmi_change_log` VALUES (242, 'S00000076', NULL, NULL, 166.8, 46, '2025-03-13 19:35:00');
INSERT INTO `bmi_change_log` VALUES (243, 'S00000077', NULL, NULL, 166.2, 51.7, '2025-07-26 14:42:00');
INSERT INTO `bmi_change_log` VALUES (244, 'S00000077', 166.2, 51.7, 164.3, 52.7, '2025-08-07 06:02:00');
INSERT INTO `bmi_change_log` VALUES (245, 'S00000077', 164.3, 52.7, 164.6, 53.2, '2025-08-10 11:55:00');
INSERT INTO `bmi_change_log` VALUES (246, 'S00000077', 164.6, 53.2, 164.2, 51.4, '2025-07-04 17:17:00');
INSERT INTO `bmi_change_log` VALUES (247, 'S00000078', NULL, NULL, 167.1, 51.2, '2025-09-11 06:40:00');
INSERT INTO `bmi_change_log` VALUES (248, 'S00000078', 167.1, 51.2, 168.8, 48.7, '2025-07-13 10:03:00');
INSERT INTO `bmi_change_log` VALUES (249, 'S00000078', 168.8, 48.7, 169, 47.8, '2025-07-30 18:48:00');
INSERT INTO `bmi_change_log` VALUES (250, 'S00000078', 169, 47.8, 168, 45.7, '2025-09-04 15:05:00');
INSERT INTO `bmi_change_log` VALUES (251, 'S00000079', NULL, NULL, 182.9, 51.2, '2025-03-19 18:02:00');
INSERT INTO `bmi_change_log` VALUES (252, 'S00000079', 182.9, 51.2, 181.2, 51.2, '2025-03-27 17:08:00');
INSERT INTO `bmi_change_log` VALUES (253, 'S00000080', NULL, NULL, 178.9, 64.9, '2025-04-03 20:26:00');
INSERT INTO `bmi_change_log` VALUES (254, 'S00000080', 178.9, 64.9, 177.4, 67.5, '2025-02-14 23:30:00');
INSERT INTO `bmi_change_log` VALUES (255, 'S00000080', 177.4, 67.5, 178.9, 67.4, '2025-01-21 01:08:00');
INSERT INTO `bmi_change_log` VALUES (256, 'S00000081', NULL, NULL, 186.6, 82.7, '2025-06-07 04:22:00');
INSERT INTO `bmi_change_log` VALUES (257, 'S00000081', 186.6, 82.7, 187.8, 84.9, '2025-04-21 18:56:00');
INSERT INTO `bmi_change_log` VALUES (258, 'S00000081', 187.8, 84.9, 188.4, 83, '2025-04-17 14:36:00');
INSERT INTO `bmi_change_log` VALUES (259, 'S00000081', 188.4, 83, 186.8, 85.7, '2025-04-27 19:33:00');
INSERT INTO `bmi_change_log` VALUES (260, 'S00000081', 186.8, 85.7, 187.5, 88.2, '2025-05-27 10:22:00');
INSERT INTO `bmi_change_log` VALUES (261, 'S00000082', NULL, NULL, 166.1, 58.8, '2025-06-24 20:46:00');
INSERT INTO `bmi_change_log` VALUES (262, 'S00000082', 166.1, 58.8, 166.5, 57.9, '2025-07-27 18:54:00');
INSERT INTO `bmi_change_log` VALUES (263, 'S00000082', 166.5, 57.9, 168.4, 58.2, '2025-07-27 05:38:00');
INSERT INTO `bmi_change_log` VALUES (264, 'S00000083', NULL, NULL, 155.8, 82.9, '2025-07-05 17:06:00');
INSERT INTO `bmi_change_log` VALUES (265, 'S00000083', 155.8, 82.9, 157.8, 83.4, '2025-08-02 22:15:00');
INSERT INTO `bmi_change_log` VALUES (266, 'S00000083', 157.8, 83.4, 156.1, 84.8, '2025-08-18 11:20:00');
INSERT INTO `bmi_change_log` VALUES (267, 'S00000084', NULL, NULL, 175, 50.7, '2025-05-04 04:52:00');
INSERT INTO `bmi_change_log` VALUES (268, 'S00000084', 175, 50.7, 175.6, 49.4, '2025-05-26 14:54:00');
INSERT INTO `bmi_change_log` VALUES (269, 'S00000084', 175.6, 49.4, 174.5, 49, '2025-04-30 11:41:00');
INSERT INTO `bmi_change_log` VALUES (270, 'S00000084', 174.5, 49, 175.5, 48.6, '2025-03-12 14:36:00');
INSERT INTO `bmi_change_log` VALUES (271, 'S00000084', 175.5, 48.6, 174.4, 45.7, '2025-04-01 15:23:00');
INSERT INTO `bmi_change_log` VALUES (272, 'S00000085', NULL, NULL, 149.3, 61.2, '2025-07-31 02:50:00');
INSERT INTO `bmi_change_log` VALUES (273, 'S00000086', NULL, NULL, 180.5, 73.3, '2025-02-14 20:22:00');
INSERT INTO `bmi_change_log` VALUES (274, 'S00000087', NULL, NULL, 182.1, 51.2, '2025-07-08 15:01:00');
INSERT INTO `bmi_change_log` VALUES (275, 'S00000087', 182.1, 51.2, 182.7, 49.5, '2025-07-03 19:21:00');
INSERT INTO `bmi_change_log` VALUES (276, 'S00000087', 182.7, 49.5, 183.8, 50.1, '2025-08-14 09:25:00');
INSERT INTO `bmi_change_log` VALUES (277, 'S00000088', NULL, NULL, 175.4, 54.2, '2025-07-15 20:00:00');
INSERT INTO `bmi_change_log` VALUES (278, 'S00000088', 175.4, 54.2, 174.3, 54.3, '2025-08-24 00:55:00');
INSERT INTO `bmi_change_log` VALUES (279, 'S00000088', 174.3, 54.3, 176.2, 53.9, '2025-07-20 21:47:00');
INSERT INTO `bmi_change_log` VALUES (280, 'S00000089', NULL, NULL, 152.6, 48.8, '2025-08-04 06:38:00');
INSERT INTO `bmi_change_log` VALUES (281, 'S00000089', 152.6, 48.8, 151.5, 47.6, '2025-07-15 02:48:00');
INSERT INTO `bmi_change_log` VALUES (282, 'S00000089', 151.5, 47.6, 150.9, 47.6, '2025-06-17 06:23:00');
INSERT INTO `bmi_change_log` VALUES (283, 'S00000090', NULL, NULL, 157.7, 65, '2025-08-07 11:52:00');
INSERT INTO `bmi_change_log` VALUES (284, 'S00000091', NULL, NULL, 152.8, 45.3, '2025-03-28 23:31:00');
INSERT INTO `bmi_change_log` VALUES (285, 'S00000091', 152.8, 45.3, 152, 46.3, '2025-03-22 04:22:00');
INSERT INTO `bmi_change_log` VALUES (286, 'S00000092', NULL, NULL, 168.5, 77.3, '2025-05-22 09:42:00');
INSERT INTO `bmi_change_log` VALUES (287, 'S00000092', 168.5, 77.3, 169.9, 78, '2025-05-06 17:31:00');
INSERT INTO `bmi_change_log` VALUES (288, 'S00000092', 169.9, 78, 171.8, 80.4, '2025-04-22 10:07:00');
INSERT INTO `bmi_change_log` VALUES (289, 'S00000092', 171.8, 80.4, 172.1, 78, '2025-04-10 09:16:00');
INSERT INTO `bmi_change_log` VALUES (290, 'S00000093', NULL, NULL, 188.4, 58.7, '2025-07-01 16:07:00');
INSERT INTO `bmi_change_log` VALUES (291, 'S00000093', 188.4, 58.7, 187.2, 56.3, '2025-05-26 20:18:00');
INSERT INTO `bmi_change_log` VALUES (292, 'S00000093', 187.2, 56.3, 186, 54.3, '2025-06-14 17:57:00');
INSERT INTO `bmi_change_log` VALUES (293, 'S00000093', 186, 54.3, 184.3, 53.4, '2025-07-24 12:56:00');
INSERT INTO `bmi_change_log` VALUES (294, 'S00000094', NULL, NULL, 172.9, 89.3, '2025-04-14 09:52:00');
INSERT INTO `bmi_change_log` VALUES (295, 'S00000094', 172.9, 89.3, 170.9, 88.6, '2025-04-13 06:19:00');
INSERT INTO `bmi_change_log` VALUES (296, 'S00000095', NULL, NULL, 181.9, 47.7, '2025-04-22 10:06:00');
INSERT INTO `bmi_change_log` VALUES (297, 'S00000095', 181.9, 47.7, 181.2, 46.5, '2025-04-23 00:22:00');
INSERT INTO `bmi_change_log` VALUES (298, 'S00000095', 181.2, 46.5, 182.2, 45.4, '2025-07-02 09:46:00');
INSERT INTO `bmi_change_log` VALUES (299, 'S00000095', 182.2, 45.4, 183.7, 45.9, '2025-04-14 15:16:00');
INSERT INTO `bmi_change_log` VALUES (300, 'S00000095', 183.7, 45.9, 185.1, 47.1, '2025-06-06 20:12:00');
INSERT INTO `bmi_change_log` VALUES (301, 'S00000096', NULL, NULL, 176.4, 46.7, '2025-06-19 05:16:00');
INSERT INTO `bmi_change_log` VALUES (302, 'S00000096', 176.4, 46.7, 174.7, 47.6, '2025-07-02 02:40:00');
INSERT INTO `bmi_change_log` VALUES (303, 'S00000096', 174.7, 47.6, 175.7, 49.5, '2025-07-09 15:23:00');
INSERT INTO `bmi_change_log` VALUES (304, 'S00000096', 175.7, 49.5, 175, 48.5, '2025-07-03 06:02:00');
INSERT INTO `bmi_change_log` VALUES (305, 'S00000096', 175, 48.5, 175.5, 47, '2025-05-24 12:46:00');
INSERT INTO `bmi_change_log` VALUES (306, 'S00000097', NULL, NULL, 166.5, 63.1, '2025-06-08 18:39:00');
INSERT INTO `bmi_change_log` VALUES (307, 'S00000098', NULL, NULL, 152.5, 85.6, '2025-07-04 12:01:00');
INSERT INTO `bmi_change_log` VALUES (308, 'S00000099', NULL, NULL, 153, 56.3, '2025-04-10 23:50:00');
INSERT INTO `bmi_change_log` VALUES (309, 'S00000100', NULL, NULL, 186.3, 86.6, '2025-07-22 18:14:00');
INSERT INTO `bmi_change_log` VALUES (310, 'S00000100', 186.3, 86.6, 185.5, 88.3, '2025-08-20 04:48:00');
INSERT INTO `bmi_change_log` VALUES (311, 'S00000100', 185.5, 88.3, 183.7, 90.6, '2025-07-04 11:32:00');
INSERT INTO `bmi_change_log` VALUES (312, 'S00000100', 183.7, 90.6, 184.1, 92.5, '2025-08-18 18:18:00');
INSERT INTO `bmi_change_log` VALUES (313, 'S00000101', NULL, NULL, 173.9, 49.3, '2025-02-02 19:55:00');
INSERT INTO `bmi_change_log` VALUES (314, 'S00000101', 173.9, 49.3, 173.8, 49.3, '2025-03-30 12:53:00');
INSERT INTO `bmi_change_log` VALUES (315, 'S00000101', 173.8, 49.3, 173, 46.5, '2025-01-13 05:57:00');
INSERT INTO `bmi_change_log` VALUES (316, 'S00000101', 173, 46.5, 171.5, 45.6, '2025-01-28 07:38:00');
INSERT INTO `bmi_change_log` VALUES (317, 'S00000101', 171.5, 45.6, 172.8, 45.2, '2025-03-17 22:16:00');
INSERT INTO `bmi_change_log` VALUES (318, 'S00000102', NULL, NULL, 188.1, 82.2, '2025-07-13 12:36:00');
INSERT INTO `bmi_change_log` VALUES (319, 'S00000102', 188.1, 82.2, 187.4, 81.6, '2025-07-10 19:38:00');
INSERT INTO `bmi_change_log` VALUES (320, 'S00000103', NULL, NULL, 176.8, 42.3, '2025-09-20 17:10:00');
INSERT INTO `bmi_change_log` VALUES (321, 'S00000103', 176.8, 42.3, 176.7, 41.7, '2025-09-24 15:57:00');
INSERT INTO `bmi_change_log` VALUES (322, 'S00000103', 176.7, 41.7, 177.1, 41.5, '2025-09-11 23:03:00');
INSERT INTO `bmi_change_log` VALUES (323, 'S00000104', NULL, NULL, 162.4, 87.7, '2025-05-17 11:31:00');
INSERT INTO `bmi_change_log` VALUES (324, 'S00000104', 162.4, 87.7, 162.9, 89.1, '2025-05-22 15:06:00');
INSERT INTO `bmi_change_log` VALUES (325, 'S00000104', 162.9, 89.1, 164.8, 88, '2025-04-04 08:06:00');
INSERT INTO `bmi_change_log` VALUES (326, 'S00000104', 164.8, 88, 165.4, 87.5, '2025-05-31 06:13:00');
INSERT INTO `bmi_change_log` VALUES (327, 'S00000104', 165.4, 87.5, 165.4, 84.9, '2025-04-24 10:01:00');
INSERT INTO `bmi_change_log` VALUES (328, 'S00000105', NULL, NULL, 155.2, 43, '2025-05-18 08:49:00');
INSERT INTO `bmi_change_log` VALUES (329, 'S00000105', 155.2, 43, 154.1, 42.8, '2025-06-27 23:02:00');
INSERT INTO `bmi_change_log` VALUES (330, 'S00000106', NULL, NULL, 173.1, 73.9, '2025-03-19 23:39:00');
INSERT INTO `bmi_change_log` VALUES (331, 'S00000106', 173.1, 73.9, 174, 73.5, '2025-02-12 12:49:00');
INSERT INTO `bmi_change_log` VALUES (332, 'S00000106', 174, 73.5, 173.3, 75.6, '2025-04-23 21:16:00');
INSERT INTO `bmi_change_log` VALUES (333, 'S00000107', NULL, NULL, 170.7, 69.3, '2025-05-22 12:23:00');
INSERT INTO `bmi_change_log` VALUES (334, 'S00000107', 170.7, 69.3, 172.1, 70.9, '2025-03-12 01:50:00');
INSERT INTO `bmi_change_log` VALUES (335, 'S00000108', NULL, NULL, 166.6, 69.3, '2025-06-09 00:44:00');
INSERT INTO `bmi_change_log` VALUES (336, 'S00000108', 166.6, 69.3, 168.3, 72, '2025-05-29 22:54:00');
INSERT INTO `bmi_change_log` VALUES (337, 'S00000108', 168.3, 72, 169.5, 74.1, '2025-08-04 23:43:00');
INSERT INTO `bmi_change_log` VALUES (338, 'S00000108', 169.5, 74.1, 168, 74, '2025-06-11 11:17:00');
INSERT INTO `bmi_change_log` VALUES (339, 'S00000108', 168, 74, 167, 76.7, '2025-06-06 17:07:00');
INSERT INTO `bmi_change_log` VALUES (340, 'S00000109', NULL, NULL, 179.5, 51.1, '2025-04-24 17:57:00');
INSERT INTO `bmi_change_log` VALUES (341, 'S00000109', 179.5, 51.1, 178.5, 49, '2025-04-22 05:30:00');
INSERT INTO `bmi_change_log` VALUES (342, 'S00000109', 178.5, 49, 176.5, 46.3, '2025-04-23 13:19:00');
INSERT INTO `bmi_change_log` VALUES (343, 'S00000109', 176.5, 46.3, 174.7, 46.2, '2025-03-26 11:52:00');
INSERT INTO `bmi_change_log` VALUES (344, 'S00000109', 174.7, 46.2, 174, 44.8, '2025-03-30 11:37:00');
INSERT INTO `bmi_change_log` VALUES (345, 'S00000110', NULL, NULL, 153.4, 42.1, '2025-02-14 11:56:00');
INSERT INTO `bmi_change_log` VALUES (346, 'S00000111', NULL, NULL, 173.2, 52, '2025-08-17 21:36:00');
INSERT INTO `bmi_change_log` VALUES (347, 'S00000112', NULL, NULL, 154.7, 59.9, '2025-05-31 10:20:00');
INSERT INTO `bmi_change_log` VALUES (348, 'S00000112', 154.7, 59.9, 153.3, 59.8, '2025-06-15 10:26:00');
INSERT INTO `bmi_change_log` VALUES (349, 'S00000112', 153.3, 59.8, 155, 58.1, '2025-07-03 07:01:00');
INSERT INTO `bmi_change_log` VALUES (350, 'S00000112', 155, 58.1, 155.3, 59, '2025-08-14 05:17:00');
INSERT INTO `bmi_change_log` VALUES (351, 'S00000112', 155.3, 59, 154.1, 57.3, '2025-08-18 23:42:00');
INSERT INTO `bmi_change_log` VALUES (352, 'S00000113', NULL, NULL, 162.2, 51.5, '2025-05-10 15:16:00');
INSERT INTO `bmi_change_log` VALUES (353, 'S00000113', 162.2, 51.5, 162, 48.5, '2025-04-01 14:53:00');
INSERT INTO `bmi_change_log` VALUES (354, 'S00000114', NULL, NULL, 187, 51.3, '2025-05-14 00:02:00');
INSERT INTO `bmi_change_log` VALUES (355, 'S00000114', 187, 51.3, 185.9, 50.9, '2025-07-01 04:02:00');
INSERT INTO `bmi_change_log` VALUES (356, 'S00000114', 185.9, 50.9, 186.4, 51.2, '2025-06-09 10:43:00');
INSERT INTO `bmi_change_log` VALUES (357, 'S00000114', 186.4, 51.2, 188, 50.9, '2025-07-03 06:28:00');
INSERT INTO `bmi_change_log` VALUES (358, 'S00000115', NULL, NULL, 155.2, 80.5, '2025-06-21 06:16:00');
INSERT INTO `bmi_change_log` VALUES (359, 'S00000115', 155.2, 80.5, 156.2, 82.1, '2025-06-23 11:41:00');
INSERT INTO `bmi_change_log` VALUES (360, 'S00000115', 156.2, 82.1, 154.5, 79.8, '2025-05-20 04:08:00');
INSERT INTO `bmi_change_log` VALUES (361, 'S00000115', 154.5, 79.8, 155.7, 81.1, '2025-04-10 15:15:00');
INSERT INTO `bmi_change_log` VALUES (362, 'S00000115', 155.7, 81.1, 154.1, 83, '2025-05-13 19:04:00');
INSERT INTO `bmi_change_log` VALUES (363, 'S00000116', NULL, NULL, 175.7, 61.6, '2025-07-01 12:27:00');
INSERT INTO `bmi_change_log` VALUES (364, 'S00000116', 175.7, 61.6, 176.4, 59.9, '2025-06-08 12:58:00');
INSERT INTO `bmi_change_log` VALUES (365, 'S00000116', 176.4, 59.9, 175.1, 58.2, '2025-07-15 09:37:00');
INSERT INTO `bmi_change_log` VALUES (366, 'S00000116', 175.1, 58.2, 176.6, 55.6, '2025-07-30 02:26:00');
INSERT INTO `bmi_change_log` VALUES (367, 'S00000116', 176.6, 55.6, 176.5, 56.7, '2025-06-08 09:52:00');
INSERT INTO `bmi_change_log` VALUES (368, 'S00000117', NULL, NULL, 154.2, 74.8, '2025-06-06 16:11:00');
INSERT INTO `bmi_change_log` VALUES (369, 'S00000117', 154.2, 74.8, 154, 72.7, '2025-08-03 19:18:00');
INSERT INTO `bmi_change_log` VALUES (370, 'S00000117', 154, 72.7, 154.1, 70.6, '2025-06-22 07:06:00');
INSERT INTO `bmi_change_log` VALUES (371, 'S00000117', 154.1, 70.6, 154.8, 69.1, '2025-08-27 12:15:00');
INSERT INTO `bmi_change_log` VALUES (372, 'S00000117', 154.8, 69.1, 153.4, 70.7, '2025-08-22 17:06:00');
INSERT INTO `bmi_change_log` VALUES (373, 'S00000118', NULL, NULL, 152.7, 57.5, '2025-08-05 23:16:00');
INSERT INTO `bmi_change_log` VALUES (374, 'S00000118', 152.7, 57.5, 151.3, 60.3, '2025-07-15 22:45:00');
INSERT INTO `bmi_change_log` VALUES (375, 'S00000118', 151.3, 60.3, 150.4, 63.3, '2025-07-09 00:07:00');
INSERT INTO `bmi_change_log` VALUES (376, 'S00000118', 150.4, 63.3, 150.7, 62.6, '2025-06-27 23:17:00');
INSERT INTO `bmi_change_log` VALUES (377, 'S00000119', NULL, NULL, 150, 59.2, '2025-05-24 01:34:00');
INSERT INTO `bmi_change_log` VALUES (378, 'S00000119', 150, 59.2, 149.2, 56.4, '2025-07-19 16:30:00');
INSERT INTO `bmi_change_log` VALUES (379, 'S00000119', 149.2, 56.4, 150.2, 53.8, '2025-06-16 06:32:00');
INSERT INTO `bmi_change_log` VALUES (380, 'S00000120', NULL, NULL, 176.6, 78.5, '2025-05-11 02:42:00');
INSERT INTO `bmi_change_log` VALUES (381, 'S00000120', 176.6, 78.5, 176.3, 78.3, '2025-04-23 20:18:00');
INSERT INTO `bmi_change_log` VALUES (382, 'S00000120', 176.3, 78.3, 177.5, 78, '2025-04-10 12:21:00');
INSERT INTO `bmi_change_log` VALUES (383, 'S00000120', 177.5, 78, 177.6, 75.4, '2025-04-09 15:27:00');
INSERT INTO `bmi_change_log` VALUES (384, 'S00000120', 177.6, 75.4, 177.6, 78.1, '2025-06-05 04:10:00');
INSERT INTO `bmi_change_log` VALUES (385, 'S00000121', NULL, NULL, 156.5, 79.8, '2025-05-18 19:45:00');
INSERT INTO `bmi_change_log` VALUES (386, 'S00000121', 156.5, 79.8, 154.5, 80, '2025-05-12 13:13:00');
INSERT INTO `bmi_change_log` VALUES (387, 'S00000122', NULL, NULL, 190.7, 54.9, '2025-07-29 11:23:00');
INSERT INTO `bmi_change_log` VALUES (388, 'S00000122', 190.7, 54.9, 188.7, 55.9, '2025-07-21 14:08:00');
INSERT INTO `bmi_change_log` VALUES (389, 'S00000123', NULL, NULL, 159, 87.9, '2025-06-27 13:50:00');
INSERT INTO `bmi_change_log` VALUES (390, 'S00000124', NULL, NULL, 165.2, 39.7, '2025-06-14 14:51:00');
INSERT INTO `bmi_change_log` VALUES (391, 'S00000125', NULL, NULL, 156.4, 58.8, '2025-07-06 18:16:00');
INSERT INTO `bmi_change_log` VALUES (392, 'S00000125', 156.4, 58.8, 154.9, 60, '2025-06-26 06:36:00');
INSERT INTO `bmi_change_log` VALUES (393, 'S00000125', 154.9, 60, 155.1, 62.2, '2025-05-23 00:26:00');
INSERT INTO `bmi_change_log` VALUES (394, 'S00000125', 155.1, 62.2, 156.2, 64.8, '2025-06-14 23:10:00');
INSERT INTO `bmi_change_log` VALUES (395, 'S00000126', NULL, NULL, 190.5, 79.2, '2025-08-14 01:34:00');
INSERT INTO `bmi_change_log` VALUES (396, 'S00000127', NULL, NULL, 177.7, 40.8, '2025-04-22 01:41:00');
INSERT INTO `bmi_change_log` VALUES (397, 'S00000128', NULL, NULL, 163.5, 72.4, '2025-07-07 05:50:00');
INSERT INTO `bmi_change_log` VALUES (398, 'S00000129', NULL, NULL, 150.2, 52.3, '2025-08-02 04:13:00');
INSERT INTO `bmi_change_log` VALUES (399, 'S00000129', 150.2, 52.3, 148.3, 51.2, '2025-07-30 19:13:00');
INSERT INTO `bmi_change_log` VALUES (400, 'S00000129', 148.3, 51.2, 148.2, 51.8, '2025-08-05 16:59:00');
INSERT INTO `bmi_change_log` VALUES (401, 'S00000129', 148.2, 51.8, 147, 51.5, '2025-06-22 19:18:00');
INSERT INTO `bmi_change_log` VALUES (402, 'S00000129', 147, 51.5, 148.9, 51, '2025-08-20 14:47:00');
INSERT INTO `bmi_change_log` VALUES (403, 'S00000130', NULL, NULL, 162.6, 67.2, '2025-03-27 03:05:00');
INSERT INTO `bmi_change_log` VALUES (404, 'S00000130', 162.6, 67.2, 163.6, 66.7, '2025-04-23 08:30:00');
INSERT INTO `bmi_change_log` VALUES (405, 'S00000130', 163.6, 66.7, 164.2, 67.3, '2025-04-14 11:05:00');
INSERT INTO `bmi_change_log` VALUES (406, 'S00000130', 164.2, 67.3, 165.7, 69.6, '2025-05-29 13:57:00');
INSERT INTO `bmi_change_log` VALUES (407, 'S00000130', 165.7, 69.6, 163.9, 71.2, '2025-04-18 13:59:00');
INSERT INTO `bmi_change_log` VALUES (408, 'S00000131', NULL, NULL, 155.8, 64.1, '2025-02-07 01:50:00');
INSERT INTO `bmi_change_log` VALUES (409, 'S00000131', 155.8, 64.1, 155.7, 63.1, '2025-02-08 16:51:00');
INSERT INTO `bmi_change_log` VALUES (410, 'S00000131', 155.7, 63.1, 154.4, 62.3, '2025-03-28 02:47:00');
INSERT INTO `bmi_change_log` VALUES (411, 'S00000132', NULL, NULL, 180, 86.3, '2025-04-19 15:10:00');
INSERT INTO `bmi_change_log` VALUES (412, 'S00000133', NULL, NULL, 189.7, 64.7, '2025-02-27 18:18:00');
INSERT INTO `bmi_change_log` VALUES (413, 'S00000133', 189.7, 64.7, 190.7, 64.4, '2025-03-17 05:43:00');
INSERT INTO `bmi_change_log` VALUES (414, 'S00000134', NULL, NULL, 180.1, 54.7, '2025-04-26 02:11:00');
INSERT INTO `bmi_change_log` VALUES (415, 'S00000134', 180.1, 54.7, 180.8, 52.9, '2025-02-06 02:14:00');
INSERT INTO `bmi_change_log` VALUES (416, 'S00000134', 180.8, 52.9, 181.1, 53.7, '2025-03-30 07:10:00');
INSERT INTO `bmi_change_log` VALUES (417, 'S00000134', 181.1, 53.7, 182.5, 53.9, '2025-05-01 06:40:00');
INSERT INTO `bmi_change_log` VALUES (418, 'S00000134', 182.5, 53.9, 183.8, 56.6, '2025-03-06 00:28:00');
INSERT INTO `bmi_change_log` VALUES (419, 'S00000135', NULL, NULL, 172.8, 50.1, '2025-05-09 16:44:00');
INSERT INTO `bmi_change_log` VALUES (420, 'S00000135', 172.8, 50.1, 171, 51, '2025-06-01 16:02:00');
INSERT INTO `bmi_change_log` VALUES (421, 'S00000135', 171, 51, 170.9, 49.6, '2025-05-31 10:47:00');
INSERT INTO `bmi_change_log` VALUES (422, 'S00000135', 170.9, 49.6, 169.6, 51.9, '2025-05-14 09:33:00');
INSERT INTO `bmi_change_log` VALUES (423, 'S00000135', 169.6, 51.9, 170.1, 54.7, '2025-05-13 19:19:00');
INSERT INTO `bmi_change_log` VALUES (424, 'S00000136', NULL, NULL, 186.5, 67.2, '2025-06-03 03:46:00');
INSERT INTO `bmi_change_log` VALUES (425, 'S00000137', NULL, NULL, 157.5, 76, '2025-05-05 11:01:00');
INSERT INTO `bmi_change_log` VALUES (426, 'S00000138', NULL, NULL, 181.2, 86.4, '2025-05-28 23:03:00');
INSERT INTO `bmi_change_log` VALUES (427, 'S00000138', 181.2, 86.4, 180, 85.5, '2025-05-07 18:19:00');
INSERT INTO `bmi_change_log` VALUES (428, 'S00000138', 180, 85.5, 180.6, 85.3, '2025-05-24 15:19:00');
INSERT INTO `bmi_change_log` VALUES (429, 'S00000139', NULL, NULL, 185.7, 87.7, '2025-05-29 11:01:00');
INSERT INTO `bmi_change_log` VALUES (430, 'S00000140', NULL, NULL, 164.4, 89.3, '2025-05-12 09:54:00');
INSERT INTO `bmi_change_log` VALUES (431, 'S00000140', 164.4, 89.3, 165.4, 88.9, '2025-06-04 00:55:00');
INSERT INTO `bmi_change_log` VALUES (432, 'S00000140', 165.4, 88.9, 164.2, 86.8, '2025-04-04 22:33:00');
INSERT INTO `bmi_change_log` VALUES (433, 'S00000140', 164.2, 86.8, 163.8, 88.5, '2025-04-20 11:36:00');
INSERT INTO `bmi_change_log` VALUES (434, 'S00000141', NULL, NULL, 168.1, 57.6, '2025-06-30 21:19:00');
INSERT INTO `bmi_change_log` VALUES (435, 'S00000141', 168.1, 57.6, 166.1, 55.3, '2025-05-06 07:20:00');
INSERT INTO `bmi_change_log` VALUES (436, 'S00000141', 166.1, 55.3, 166.8, 53.3, '2025-05-27 11:54:00');
INSERT INTO `bmi_change_log` VALUES (437, 'S00000141', 166.8, 53.3, 166.2, 51.6, '2025-04-14 17:54:00');
INSERT INTO `bmi_change_log` VALUES (438, 'S00000141', 166.2, 51.6, 164.3, 52.8, '2025-05-01 08:44:00');
INSERT INTO `bmi_change_log` VALUES (439, 'S00000142', NULL, NULL, 164.3, 63.4, '2025-09-09 10:49:00');
INSERT INTO `bmi_change_log` VALUES (440, 'S00000142', 164.3, 63.4, 164, 66.1, '2025-07-04 06:07:00');
INSERT INTO `bmi_change_log` VALUES (441, 'S00000142', 164, 66.1, 164.1, 66.5, '2025-07-10 20:05:00');
INSERT INTO `bmi_change_log` VALUES (442, 'S00000142', 164.1, 66.5, 165.3, 66.2, '2025-08-06 20:26:00');
INSERT INTO `bmi_change_log` VALUES (443, 'S00000142', 165.3, 66.2, 165.7, 69.2, '2025-09-02 23:45:00');
INSERT INTO `bmi_change_log` VALUES (444, 'S00000143', NULL, NULL, 181.8, 71.1, '2025-04-20 22:05:00');
INSERT INTO `bmi_change_log` VALUES (445, 'S00000143', 181.8, 71.1, 182.1, 71.3, '2025-06-23 11:33:00');
INSERT INTO `bmi_change_log` VALUES (446, 'S00000144', NULL, NULL, 189.2, 52.9, '2025-06-15 08:36:00');
INSERT INTO `bmi_change_log` VALUES (447, 'S00000144', 189.2, 52.9, 187.7, 50.3, '2025-04-18 19:24:00');
INSERT INTO `bmi_change_log` VALUES (448, 'S00000145', NULL, NULL, 169.2, 56.4, '2025-08-11 10:19:00');
INSERT INTO `bmi_change_log` VALUES (449, 'S00000145', 169.2, 56.4, 171.1, 58, '2025-06-14 18:13:00');
INSERT INTO `bmi_change_log` VALUES (450, 'S00000145', 171.1, 58, 169.7, 58.6, '2025-08-19 12:30:00');
INSERT INTO `bmi_change_log` VALUES (451, 'S00000145', 169.7, 58.6, 168.6, 57.3, '2025-06-26 14:12:00');
INSERT INTO `bmi_change_log` VALUES (452, 'S00000145', 168.6, 57.3, 168.5, 55.2, '2025-05-31 05:37:00');
INSERT INTO `bmi_change_log` VALUES (453, 'S00000146', NULL, NULL, 166.3, 45.9, '2025-07-19 22:07:00');
INSERT INTO `bmi_change_log` VALUES (454, 'S00000146', 166.3, 45.9, 166.7, 48.5, '2025-06-02 23:20:00');
INSERT INTO `bmi_change_log` VALUES (455, 'S00000147', NULL, NULL, 168.9, 42.3, '2025-06-10 02:01:00');
INSERT INTO `bmi_change_log` VALUES (456, 'S00000147', 168.9, 42.3, 168.7, 44.3, '2025-07-01 13:22:00');
INSERT INTO `bmi_change_log` VALUES (457, 'S00000147', 168.7, 44.3, 168.6, 44.5, '2025-06-22 06:45:00');
INSERT INTO `bmi_change_log` VALUES (458, 'S00000147', 168.6, 44.5, 166.9, 45.9, '2025-04-29 14:53:00');
INSERT INTO `bmi_change_log` VALUES (459, 'S00000147', 166.9, 45.9, 168.1, 46.3, '2025-05-29 05:07:00');
INSERT INTO `bmi_change_log` VALUES (460, 'S00000148', NULL, NULL, 155.5, 80.3, '2025-08-23 10:43:00');
INSERT INTO `bmi_change_log` VALUES (461, 'S00000148', 155.5, 80.3, 153.8, 78.9, '2025-07-28 11:13:00');
INSERT INTO `bmi_change_log` VALUES (462, 'S00000148', 153.8, 78.9, 153.9, 77.8, '2025-08-18 21:48:00');
INSERT INTO `bmi_change_log` VALUES (463, 'S00000148', 153.9, 77.8, 154.3, 77.9, '2025-06-28 02:34:00');
INSERT INTO `bmi_change_log` VALUES (464, 'S00000148', 154.3, 77.9, 154.9, 78.8, '2025-08-13 05:45:00');
INSERT INTO `bmi_change_log` VALUES (465, 'S00000149', NULL, NULL, 158, 88, '2025-07-01 14:23:00');
INSERT INTO `bmi_change_log` VALUES (466, 'S00000149', 158, 88, 157.8, 90.3, '2025-07-09 16:44:00');
INSERT INTO `bmi_change_log` VALUES (467, 'S00000150', NULL, NULL, 181.8, 83.4, '2025-07-19 08:22:00');
INSERT INTO `bmi_change_log` VALUES (468, 'S00000151', NULL, NULL, 182.2, 76.4, '2025-07-21 23:58:00');
INSERT INTO `bmi_change_log` VALUES (469, 'S00000151', 182.2, 76.4, 182.7, 77.1, '2025-06-22 12:14:00');
INSERT INTO `bmi_change_log` VALUES (470, 'S00000151', 182.7, 77.1, 181.2, 76, '2025-06-22 10:46:00');
INSERT INTO `bmi_change_log` VALUES (471, 'S00000152', NULL, NULL, 164.8, 68.8, '2025-05-06 16:18:00');
INSERT INTO `bmi_change_log` VALUES (472, 'S00000153', NULL, NULL, 186.3, 89, '2025-07-09 02:00:00');
INSERT INTO `bmi_change_log` VALUES (473, 'S00000153', 186.3, 89, 185.5, 88.1, '2025-06-22 06:47:00');
INSERT INTO `bmi_change_log` VALUES (474, 'S00000153', 185.5, 88.1, 185, 87.1, '2025-06-25 23:29:00');
INSERT INTO `bmi_change_log` VALUES (475, 'S00000154', NULL, NULL, 186.4, 47.9, '2025-03-12 07:26:00');
INSERT INTO `bmi_change_log` VALUES (476, 'S00000154', 186.4, 47.9, 184.6, 46.7, '2025-01-21 23:30:00');
INSERT INTO `bmi_change_log` VALUES (477, 'S00000154', 184.6, 46.7, 182.8, 46.3, '2025-03-31 21:56:00');
INSERT INTO `bmi_change_log` VALUES (478, 'S00000154', 182.8, 46.3, 182.7, 48.8, '2025-01-27 12:11:00');
INSERT INTO `bmi_change_log` VALUES (479, 'S00000154', 182.7, 48.8, 183.7, 49.9, '2025-03-13 08:57:00');
INSERT INTO `bmi_change_log` VALUES (480, 'S00000155', NULL, NULL, 179.3, 51.8, '2025-05-10 00:25:00');
INSERT INTO `bmi_change_log` VALUES (481, 'S00000155', 179.3, 51.8, 181, 54.3, '2025-07-22 23:52:00');
INSERT INTO `bmi_change_log` VALUES (482, 'S00000155', 181, 54.3, 179.8, 53.4, '2025-05-02 03:56:00');
INSERT INTO `bmi_change_log` VALUES (483, 'S00000155', 179.8, 53.4, 178.3, 51.5, '2025-06-01 02:20:00');
INSERT INTO `bmi_change_log` VALUES (484, 'S00000155', 178.3, 51.5, 177.8, 53.6, '2025-05-29 18:49:00');
INSERT INTO `bmi_change_log` VALUES (485, 'S00000156', NULL, NULL, 165.5, 56.3, '2025-04-21 17:04:00');
INSERT INTO `bmi_change_log` VALUES (486, 'S00000156', 165.5, 56.3, 167.1, 58.5, '2025-02-26 17:48:00');
INSERT INTO `bmi_change_log` VALUES (487, 'S00000157', NULL, NULL, 159.3, 53.5, '2025-03-14 10:28:00');
INSERT INTO `bmi_change_log` VALUES (488, 'S00000157', 159.3, 53.5, 157.3, 53.4, '2025-03-22 20:32:00');
INSERT INTO `bmi_change_log` VALUES (489, 'S00000157', 157.3, 53.4, 155.6, 54.3, '2025-05-05 05:04:00');
INSERT INTO `bmi_change_log` VALUES (490, 'S00000157', 155.6, 54.3, 155.6, 52.4, '2025-03-09 02:32:00');
INSERT INTO `bmi_change_log` VALUES (491, 'S00000158', NULL, NULL, 179.7, 42.4, '2025-05-29 03:39:00');
INSERT INTO `bmi_change_log` VALUES (492, 'S00000159', NULL, NULL, 165.5, 50.5, '2025-07-18 09:39:00');
INSERT INTO `bmi_change_log` VALUES (493, 'S00000160', NULL, NULL, 166.4, 59.6, '2025-06-05 01:50:00');
INSERT INTO `bmi_change_log` VALUES (494, 'S00000161', NULL, NULL, 167.1, 54.2, '2025-05-01 20:25:00');
INSERT INTO `bmi_change_log` VALUES (495, 'S00000161', 167.1, 54.2, 168, 54.4, '2025-04-20 05:43:00');
INSERT INTO `bmi_change_log` VALUES (496, 'S00000161', 168, 54.4, 169.8, 51.5, '2025-06-04 13:11:00');
INSERT INTO `bmi_change_log` VALUES (497, 'S00000162', NULL, NULL, 175.3, 63.9, '2025-04-08 11:49:00');
INSERT INTO `bmi_change_log` VALUES (498, 'S00000162', 175.3, 63.9, 176, 64.6, '2025-05-11 17:01:00');
INSERT INTO `bmi_change_log` VALUES (499, 'S00000162', 176, 64.6, 174.3, 66.6, '2025-05-30 16:41:00');
INSERT INTO `bmi_change_log` VALUES (500, 'S00000162', 174.3, 66.6, 175.5, 68.9, '2025-04-02 18:31:00');
INSERT INTO `bmi_change_log` VALUES (501, 'S00000163', NULL, NULL, 162, 57.2, '2025-05-08 03:12:00');
INSERT INTO `bmi_change_log` VALUES (502, 'S00000163', 162, 57.2, 160.5, 56.4, '2025-06-16 16:15:00');
INSERT INTO `bmi_change_log` VALUES (503, 'S00000163', 160.5, 56.4, 162.5, 56, '2025-04-23 10:17:00');
INSERT INTO `bmi_change_log` VALUES (504, 'S00000164', NULL, NULL, 176, 41, '2025-07-01 12:30:00');
INSERT INTO `bmi_change_log` VALUES (505, 'S00000164', 176, 41, 176.2, 39.1, '2025-06-19 12:01:00');
INSERT INTO `bmi_change_log` VALUES (506, 'S00000164', 176.2, 39.1, 176.9, 40.8, '2025-07-26 04:56:00');
INSERT INTO `bmi_change_log` VALUES (507, 'S00000164', 176.9, 40.8, 178.3, 42.6, '2025-08-11 22:34:00');
INSERT INTO `bmi_change_log` VALUES (508, 'S00000164', 178.3, 42.6, 177.4, 41.8, '2025-08-24 00:05:00');
INSERT INTO `bmi_change_log` VALUES (509, 'S00000165', NULL, NULL, 155.2, 72.1, '2025-07-31 14:02:00');
INSERT INTO `bmi_change_log` VALUES (510, 'S00000166', NULL, NULL, 158.1, 89.8, '2025-05-19 16:08:00');
INSERT INTO `bmi_change_log` VALUES (511, 'S00000166', 158.1, 89.8, 157.7, 91.1, '2025-04-15 17:15:00');
INSERT INTO `bmi_change_log` VALUES (512, 'S00000166', 157.7, 91.1, 157.5, 93, '2025-05-21 07:23:00');
INSERT INTO `bmi_change_log` VALUES (513, 'S00000167', NULL, NULL, 177.6, 89.2, '2025-02-24 03:05:00');
INSERT INTO `bmi_change_log` VALUES (514, 'S00000167', 177.6, 89.2, 178.6, 90.4, '2025-05-14 19:05:00');
INSERT INTO `bmi_change_log` VALUES (515, 'S00000167', 178.6, 90.4, 178.1, 91.7, '2025-04-29 04:33:00');
INSERT INTO `bmi_change_log` VALUES (516, 'S00000167', 178.1, 91.7, 179, 90.3, '2025-04-09 10:09:00');
INSERT INTO `bmi_change_log` VALUES (517, 'S00000167', 179, 90.3, 179, 89, '2025-05-18 00:17:00');
INSERT INTO `bmi_change_log` VALUES (518, 'S00000168', NULL, NULL, 167.9, 58.3, '2025-06-23 20:21:00');
INSERT INTO `bmi_change_log` VALUES (519, 'S00000168', 167.9, 58.3, 167.1, 55.9, '2025-05-19 01:44:00');
INSERT INTO `bmi_change_log` VALUES (520, 'S00000168', 167.1, 55.9, 167.6, 56.4, '2025-04-03 10:24:00');
INSERT INTO `bmi_change_log` VALUES (521, 'S00000168', 167.6, 56.4, 167, 55.2, '2025-05-31 01:55:00');
INSERT INTO `bmi_change_log` VALUES (522, 'S00000169', NULL, NULL, 151.8, 87, '2025-05-09 00:22:00');
INSERT INTO `bmi_change_log` VALUES (523, 'S00000169', 151.8, 87, 151.5, 88.6, '2025-05-15 03:26:00');
INSERT INTO `bmi_change_log` VALUES (524, 'S00000169', 151.5, 88.6, 150.4, 86.3, '2025-06-15 06:05:00');
INSERT INTO `bmi_change_log` VALUES (525, 'S00000169', 150.4, 86.3, 152, 84.5, '2025-05-25 06:30:00');
INSERT INTO `bmi_change_log` VALUES (526, 'S00000169', 152, 84.5, 152.4, 87.3, '2025-05-24 15:15:00');
INSERT INTO `bmi_change_log` VALUES (527, 'S00000170', NULL, NULL, 158.9, 71.9, '2025-05-14 15:00:00');
INSERT INTO `bmi_change_log` VALUES (528, 'S00000170', 158.9, 71.9, 157.6, 72.4, '2025-07-29 16:21:00');
INSERT INTO `bmi_change_log` VALUES (529, 'S00000171', NULL, NULL, 177.3, 54.1, '2025-06-23 20:10:00');
INSERT INTO `bmi_change_log` VALUES (530, 'S00000171', 177.3, 54.1, 177.5, 54.2, '2025-08-24 21:13:00');
INSERT INTO `bmi_change_log` VALUES (531, 'S00000172', NULL, NULL, 157.7, 56.9, '2025-04-16 05:31:00');
INSERT INTO `bmi_change_log` VALUES (532, 'S00000173', NULL, NULL, 173.6, 45.2, '2025-03-10 14:40:00');
INSERT INTO `bmi_change_log` VALUES (533, 'S00000174', NULL, NULL, 158.6, 67.4, '2025-05-29 12:27:00');
INSERT INTO `bmi_change_log` VALUES (534, 'S00000175', NULL, NULL, 157.8, 74.7, '2025-07-31 22:54:00');
INSERT INTO `bmi_change_log` VALUES (535, 'S00000175', 157.8, 74.7, 158.7, 74.4, '2025-06-30 14:30:00');
INSERT INTO `bmi_change_log` VALUES (536, 'S00000175', 158.7, 74.4, 159.1, 72.3, '2025-06-24 11:37:00');
INSERT INTO `bmi_change_log` VALUES (537, 'S00000175', 159.1, 72.3, 157.4, 74.8, '2025-08-21 20:10:00');
INSERT INTO `bmi_change_log` VALUES (538, 'S00000176', NULL, NULL, 165.7, 40.3, '2025-06-24 14:14:00');
INSERT INTO `bmi_change_log` VALUES (539, 'S00000177', NULL, NULL, 185.9, 62.6, '2025-03-23 19:29:00');
INSERT INTO `bmi_change_log` VALUES (540, 'S00000177', 185.9, 62.6, 187.5, 60.1, '2025-03-14 09:31:00');
INSERT INTO `bmi_change_log` VALUES (541, 'S00000177', 187.5, 60.1, 189.3, 60.6, '2025-03-05 02:27:00');
INSERT INTO `bmi_change_log` VALUES (542, 'S00000177', 189.3, 60.6, 189.8, 60.7, '2025-02-13 05:14:00');
INSERT INTO `bmi_change_log` VALUES (543, 'S00000178', NULL, NULL, 160.1, 40.2, '2025-03-04 23:55:00');
INSERT INTO `bmi_change_log` VALUES (544, 'S00000178', 160.1, 40.2, 161.3, 37.3, '2025-02-26 05:57:00');
INSERT INTO `bmi_change_log` VALUES (545, 'S00000178', 161.3, 37.3, 161.1, 35.8, '2025-03-05 23:39:00');
INSERT INTO `bmi_change_log` VALUES (546, 'S00000179', NULL, NULL, 184.2, 48.2, '2025-01-24 07:00:00');
INSERT INTO `bmi_change_log` VALUES (547, 'S00000179', 184.2, 48.2, 184.7, 45.4, '2025-03-10 18:54:00');
INSERT INTO `bmi_change_log` VALUES (548, 'S00000179', 184.7, 45.4, 186.5, 43.4, '2025-02-13 17:11:00');
INSERT INTO `bmi_change_log` VALUES (549, 'S00000179', 186.5, 43.4, 185.6, 41, '2025-03-20 02:19:00');
INSERT INTO `bmi_change_log` VALUES (550, 'S00000179', 185.6, 41, 186.9, 43.4, '2025-03-20 20:47:00');
INSERT INTO `bmi_change_log` VALUES (551, 'S00000180', NULL, NULL, 175.3, 65.8, '2025-07-08 14:42:00');
INSERT INTO `bmi_change_log` VALUES (552, 'S00000180', 175.3, 65.8, 176.8, 63.1, '2025-07-18 06:48:00');
INSERT INTO `bmi_change_log` VALUES (553, 'S00000180', 176.8, 63.1, 175.2, 66, '2025-06-12 06:03:00');
INSERT INTO `bmi_change_log` VALUES (554, 'S00000180', 175.2, 66, 174.8, 68.8, '2025-06-15 04:03:00');
INSERT INTO `bmi_change_log` VALUES (555, 'S00000180', 174.8, 68.8, 176.7, 69.6, '2025-06-20 00:52:00');
INSERT INTO `bmi_change_log` VALUES (556, 'S00000181', NULL, NULL, 150.1, 52.3, '2025-02-20 10:59:00');
INSERT INTO `bmi_change_log` VALUES (557, 'S00000181', 150.1, 52.3, 148.2, 54.2, '2025-02-19 07:31:00');
INSERT INTO `bmi_change_log` VALUES (558, 'S00000182', NULL, NULL, 182.1, 73.4, '2025-04-05 01:53:00');
INSERT INTO `bmi_change_log` VALUES (559, 'S00000182', 182.1, 73.4, 181.9, 76, '2025-03-19 03:33:00');
INSERT INTO `bmi_change_log` VALUES (560, 'S00000182', 181.9, 76, 180, 78.8, '2025-03-20 07:28:00');
INSERT INTO `bmi_change_log` VALUES (561, 'S00000183', NULL, NULL, 155.2, 69.5, '2025-05-09 08:05:00');
INSERT INTO `bmi_change_log` VALUES (562, 'S00000183', 155.2, 69.5, 157.1, 67.2, '2025-05-20 16:56:00');
INSERT INTO `bmi_change_log` VALUES (563, 'S00000183', 157.1, 67.2, 158, 68, '2025-06-29 07:12:00');
INSERT INTO `bmi_change_log` VALUES (564, 'S00000183', 158, 68, 157.4, 66.5, '2025-05-25 03:24:00');
INSERT INTO `bmi_change_log` VALUES (565, 'S00000184', NULL, NULL, 152, 56.8, '2025-04-01 08:18:00');
INSERT INTO `bmi_change_log` VALUES (566, 'S00000184', 152, 56.8, 151.6, 56.5, '2025-05-17 14:45:00');
INSERT INTO `bmi_change_log` VALUES (567, 'S00000184', 151.6, 56.5, 153.1, 55.1, '2025-03-10 19:37:00');
INSERT INTO `bmi_change_log` VALUES (568, 'S00000184', 153.1, 55.1, 154.7, 56, '2025-04-18 23:22:00');
INSERT INTO `bmi_change_log` VALUES (569, 'S00000184', 154.7, 56, 154.1, 54.8, '2025-03-21 18:47:00');
INSERT INTO `bmi_change_log` VALUES (570, 'S00000185', NULL, NULL, 167.9, 85.4, '2025-07-12 09:12:00');
INSERT INTO `bmi_change_log` VALUES (571, 'S00000185', 167.9, 85.4, 168.3, 86.9, '2025-07-08 00:10:00');
INSERT INTO `bmi_change_log` VALUES (572, 'S00000186', NULL, NULL, 184.3, 72.1, '2025-05-14 10:50:00');
INSERT INTO `bmi_change_log` VALUES (573, 'S00000186', 184.3, 72.1, 184.1, 73.5, '2025-04-09 10:05:00');
INSERT INTO `bmi_change_log` VALUES (574, 'S00000186', 184.1, 73.5, 185, 72.1, '2025-04-27 20:41:00');
INSERT INTO `bmi_change_log` VALUES (575, 'S00000186', 185, 72.1, 184.9, 72.3, '2025-03-26 14:04:00');
INSERT INTO `bmi_change_log` VALUES (576, 'S00000186', 184.9, 72.3, 185.5, 73.1, '2025-03-26 04:27:00');
INSERT INTO `bmi_change_log` VALUES (577, 'S00000187', NULL, NULL, 165.2, 71.1, '2025-02-24 07:40:00');
INSERT INTO `bmi_change_log` VALUES (578, 'S00000187', 165.2, 71.1, 165, 69.6, '2025-03-26 13:57:00');
INSERT INTO `bmi_change_log` VALUES (579, 'S00000187', 165, 69.6, 166.1, 66.7, '2025-02-26 07:29:00');
INSERT INTO `bmi_change_log` VALUES (580, 'S00000187', 166.1, 66.7, 166.1, 66.2, '2025-02-23 16:43:00');
INSERT INTO `bmi_change_log` VALUES (581, 'S00000187', 166.1, 66.2, 165.1, 67.8, '2025-02-19 09:43:00');
INSERT INTO `bmi_change_log` VALUES (582, 'S00000188', NULL, NULL, 163, 45.7, '2025-02-18 13:17:00');
INSERT INTO `bmi_change_log` VALUES (583, 'S00000188', 163, 45.7, 164.6, 48.2, '2025-03-16 06:50:00');
INSERT INTO `bmi_change_log` VALUES (584, 'S00000188', 164.6, 48.2, 163.7, 46.5, '2025-03-03 09:23:00');
INSERT INTO `bmi_change_log` VALUES (585, 'S00000188', 163.7, 46.5, 163.1, 47.4, '2025-04-15 03:58:00');
INSERT INTO `bmi_change_log` VALUES (586, 'S00000188', 163.1, 47.4, 161.4, 44.8, '2025-02-12 23:11:00');
INSERT INTO `bmi_change_log` VALUES (587, 'S00000189', NULL, NULL, 182, 47.5, '2025-04-30 00:21:00');
INSERT INTO `bmi_change_log` VALUES (588, 'S00000190', NULL, NULL, 190.3, 88.9, '2025-04-25 21:15:00');
INSERT INTO `bmi_change_log` VALUES (589, 'S00000191', NULL, NULL, 154.1, 72.1, '2025-08-29 12:40:00');
INSERT INTO `bmi_change_log` VALUES (590, 'S00000191', 154.1, 72.1, 152.3, 74.2, '2025-09-02 20:51:00');
INSERT INTO `bmi_change_log` VALUES (591, 'S00000191', 152.3, 74.2, 152, 72.7, '2025-07-26 20:09:00');
INSERT INTO `bmi_change_log` VALUES (592, 'S00000191', 152, 72.7, 152.2, 71, '2025-08-16 08:51:00');
INSERT INTO `bmi_change_log` VALUES (593, 'S00000191', 152.2, 71, 153.5, 73.2, '2025-08-15 05:09:00');
INSERT INTO `bmi_change_log` VALUES (594, 'S00000192', NULL, NULL, 187.2, 75.3, '2025-04-17 02:37:00');
INSERT INTO `bmi_change_log` VALUES (595, 'S00000192', 187.2, 75.3, 187.5, 75, '2025-03-22 20:08:00');
INSERT INTO `bmi_change_log` VALUES (596, 'S00000192', 187.5, 75, 189.4, 74.3, '2025-02-27 16:20:00');
INSERT INTO `bmi_change_log` VALUES (597, 'S00000192', 189.4, 74.3, 187.4, 76.8, '2025-02-28 09:05:00');
INSERT INTO `bmi_change_log` VALUES (598, 'S00000192', 187.4, 76.8, 185.4, 78.9, '2025-04-02 01:11:00');
INSERT INTO `bmi_change_log` VALUES (599, 'S00000193', NULL, NULL, 163.4, 51.5, '2025-06-09 13:35:00');
INSERT INTO `bmi_change_log` VALUES (600, 'S00000193', 163.4, 51.5, 164.2, 52.1, '2025-05-20 13:31:00');
INSERT INTO `bmi_change_log` VALUES (601, 'S00000194', NULL, NULL, 156.9, 84.2, '2025-09-22 17:27:00');
INSERT INTO `bmi_change_log` VALUES (602, 'S00000194', 156.9, 84.2, 157.6, 84.1, '2025-09-02 13:08:00');
INSERT INTO `bmi_change_log` VALUES (603, 'S00000194', 157.6, 84.1, 157, 85, '2025-07-14 15:58:00');
INSERT INTO `bmi_change_log` VALUES (604, 'S00000194', 157, 85, 158.7, 84.8, '2025-08-15 12:47:00');
INSERT INTO `bmi_change_log` VALUES (605, 'S00000194', 158.7, 84.8, 157.1, 82.3, '2025-09-23 05:22:00');
INSERT INTO `bmi_change_log` VALUES (606, 'S00000195', NULL, NULL, 163.6, 51.5, '2025-06-06 02:23:00');
INSERT INTO `bmi_change_log` VALUES (607, 'S00000195', 163.6, 51.5, 163.7, 51.2, '2025-04-12 18:10:00');
INSERT INTO `bmi_change_log` VALUES (608, 'S00000195', 163.7, 51.2, 165.4, 53, '2025-06-20 18:10:00');
INSERT INTO `bmi_change_log` VALUES (609, 'S00000195', 165.4, 53, 166.9, 54.6, '2025-04-24 15:58:00');
INSERT INTO `bmi_change_log` VALUES (610, 'S00000195', 166.9, 54.6, 168.6, 52.6, '2025-05-02 13:49:00');
INSERT INTO `bmi_change_log` VALUES (611, 'S00000196', NULL, NULL, 180.5, 66.4, '2025-03-09 19:26:00');
INSERT INTO `bmi_change_log` VALUES (612, 'S00000196', 180.5, 66.4, 180.1, 68, '2025-03-26 05:10:00');
INSERT INTO `bmi_change_log` VALUES (613, 'S00000197', NULL, NULL, 153.1, 88, '2025-05-04 20:42:00');
INSERT INTO `bmi_change_log` VALUES (614, 'S00000197', 153.1, 88, 154.1, 88, '2025-06-05 15:44:00');
INSERT INTO `bmi_change_log` VALUES (615, 'S00000197', 154.1, 88, 156, 90.1, '2025-04-02 22:48:00');
INSERT INTO `bmi_change_log` VALUES (616, 'S00000197', 156, 90.1, 155.5, 91.4, '2025-05-24 03:04:00');
INSERT INTO `bmi_change_log` VALUES (617, 'S00000197', 155.5, 91.4, 157.1, 92.8, '2025-03-30 00:19:00');
INSERT INTO `bmi_change_log` VALUES (618, 'S00000198', NULL, NULL, 176.5, 57.7, '2025-06-13 07:28:00');
INSERT INTO `bmi_change_log` VALUES (619, 'S00000198', 176.5, 57.7, 175.7, 57.6, '2025-05-30 08:47:00');
INSERT INTO `bmi_change_log` VALUES (620, 'S00000199', NULL, NULL, 174.6, 51.7, '2025-04-19 10:32:00');
INSERT INTO `bmi_change_log` VALUES (621, 'S00000199', 174.6, 51.7, 175.1, 54, '2025-03-17 21:56:00');
INSERT INTO `bmi_change_log` VALUES (622, 'S00000199', 175.1, 54, 173.8, 52.3, '2025-05-17 16:41:00');
INSERT INTO `bmi_change_log` VALUES (623, 'S00000200', NULL, NULL, 183.1, 89, '2025-03-31 08:35:00');
INSERT INTO `bmi_change_log` VALUES (624, 'S00000200', 183.1, 89, 182.4, 91.1, '2025-04-30 10:28:00');
INSERT INTO `bmi_change_log` VALUES (625, 'S00000200', 182.4, 91.1, 182.3, 93.5, '2025-02-26 07:58:00');
INSERT INTO `bmi_change_log` VALUES (626, 'S00000200', 182.3, 93.5, 180.8, 95.9, '2025-04-15 15:49:00');
INSERT INTO `bmi_change_log` VALUES (627, 'S00000201', NULL, NULL, 162.8, 55.3, '2025-02-17 13:45:00');
INSERT INTO `bmi_change_log` VALUES (628, 'S00000202', NULL, NULL, 190.7, 44.4, '2025-06-08 19:04:00');
INSERT INTO `bmi_change_log` VALUES (629, 'S00000202', 190.7, 44.4, 188.9, 44.6, '2025-08-15 20:11:00');
INSERT INTO `bmi_change_log` VALUES (630, 'S00000203', NULL, NULL, 154, 88.2, '2025-07-12 03:07:00');
INSERT INTO `bmi_change_log` VALUES (631, 'S00000203', 154, 88.2, 153.5, 90.9, '2025-05-21 13:26:00');
INSERT INTO `bmi_change_log` VALUES (632, 'S00000204', NULL, NULL, 170.4, 39.1, '2025-01-21 01:45:00');
INSERT INTO `bmi_change_log` VALUES (633, 'S00000204', 170.4, 39.1, 168.6, 39.5, '2025-03-22 00:42:00');
INSERT INTO `bmi_change_log` VALUES (634, 'S00000204', 168.6, 39.5, 170.2, 42, '2025-03-23 17:41:00');
INSERT INTO `bmi_change_log` VALUES (635, 'S00000205', NULL, NULL, 158.5, 67.6, '2025-03-25 06:31:00');
INSERT INTO `bmi_change_log` VALUES (636, 'S00000206', NULL, NULL, 171.1, 49.1, '2025-08-03 18:03:00');
INSERT INTO `bmi_change_log` VALUES (637, 'S00000206', 171.1, 49.1, 171.9, 47.4, '2025-08-24 04:40:00');
INSERT INTO `bmi_change_log` VALUES (638, 'S00000206', 171.9, 47.4, 170.4, 45.4, '2025-06-12 05:04:00');
INSERT INTO `bmi_change_log` VALUES (639, 'S00000207', NULL, NULL, 157, 73, '2025-02-17 04:09:00');
INSERT INTO `bmi_change_log` VALUES (640, 'S00000207', 157, 73, 156.4, 72.8, '2025-02-01 06:38:00');
INSERT INTO `bmi_change_log` VALUES (641, 'S00000207', 156.4, 72.8, 155.4, 74, '2025-02-11 08:32:00');
INSERT INTO `bmi_change_log` VALUES (642, 'S00000208', NULL, NULL, 167.6, 70.9, '2025-05-18 01:06:00');
INSERT INTO `bmi_change_log` VALUES (643, 'S00000208', 167.6, 70.9, 166.6, 72.8, '2025-05-29 12:59:00');
INSERT INTO `bmi_change_log` VALUES (644, 'S00000208', 166.6, 72.8, 168.2, 72.2, '2025-05-01 18:39:00');
INSERT INTO `bmi_change_log` VALUES (645, 'S00000208', 168.2, 72.2, 168.7, 71.7, '2025-06-04 12:36:00');
INSERT INTO `bmi_change_log` VALUES (646, 'S00000209', NULL, NULL, 156.8, 83.5, '2025-03-03 09:30:00');
INSERT INTO `bmi_change_log` VALUES (647, 'S00000210', NULL, NULL, 184.8, 57.3, '2025-06-02 13:28:00');
INSERT INTO `bmi_change_log` VALUES (648, 'S00000210', 184.8, 57.3, 183.1, 59.4, '2025-05-12 08:39:00');
INSERT INTO `bmi_change_log` VALUES (649, 'S00000211', NULL, NULL, 148.5, 53.4, '2025-04-06 12:06:00');
INSERT INTO `bmi_change_log` VALUES (650, 'S00000211', 148.5, 53.4, 148.7, 51.2, '2025-04-29 18:43:00');
INSERT INTO `bmi_change_log` VALUES (651, 'S00000211', 148.7, 51.2, 150.2, 52, '2025-06-17 10:23:00');
INSERT INTO `bmi_change_log` VALUES (652, 'S00000212', NULL, NULL, 158.7, 75.3, '2025-02-23 03:10:00');
INSERT INTO `bmi_change_log` VALUES (653, 'S00000212', 158.7, 75.3, 157.9, 74.5, '2025-01-27 04:00:00');
INSERT INTO `bmi_change_log` VALUES (654, 'S00000213', NULL, NULL, 154.6, 62.6, '2025-08-19 19:46:00');
INSERT INTO `bmi_change_log` VALUES (655, 'S00000213', 154.6, 62.6, 155.6, 59.9, '2025-07-07 18:48:00');
INSERT INTO `bmi_change_log` VALUES (656, 'S00000213', 155.6, 59.9, 155.8, 57.4, '2025-06-10 08:26:00');
INSERT INTO `bmi_change_log` VALUES (657, 'S00000214', NULL, NULL, 151.3, 58, '2025-04-19 13:09:00');
INSERT INTO `bmi_change_log` VALUES (658, 'S00000214', 151.3, 58, 150.6, 57.6, '2025-03-31 23:43:00');
INSERT INTO `bmi_change_log` VALUES (659, 'S00000214', 150.6, 57.6, 150.6, 55.9, '2025-04-02 22:56:00');
INSERT INTO `bmi_change_log` VALUES (660, 'S00000214', 150.6, 55.9, 149.5, 54.8, '2025-05-18 19:22:00');
INSERT INTO `bmi_change_log` VALUES (661, 'S00000215', NULL, NULL, 171.7, 88, '2025-08-23 04:11:00');
INSERT INTO `bmi_change_log` VALUES (662, 'S00000215', 171.7, 88, 173.1, 88.4, '2025-06-25 12:09:00');
INSERT INTO `bmi_change_log` VALUES (663, 'S00000215', 173.1, 88.4, 174.6, 88.1, '2025-08-30 07:40:00');
INSERT INTO `bmi_change_log` VALUES (664, 'S00000215', 174.6, 88.1, 173.8, 89.1, '2025-06-06 07:28:00');
INSERT INTO `bmi_change_log` VALUES (665, 'S00000216', NULL, NULL, 169.2, 65.9, '2025-06-27 14:04:00');
INSERT INTO `bmi_change_log` VALUES (666, 'S00000216', 169.2, 65.9, 170.9, 65.1, '2025-06-19 08:31:00');
INSERT INTO `bmi_change_log` VALUES (667, 'S00000216', 170.9, 65.1, 169.9, 68.1, '2025-07-26 11:42:00');
INSERT INTO `bmi_change_log` VALUES (668, 'S00000216', 169.9, 68.1, 168.1, 68, '2025-07-27 03:51:00');
INSERT INTO `bmi_change_log` VALUES (669, 'S00000217', NULL, NULL, 174.7, 73.4, '2025-07-04 00:51:00');
INSERT INTO `bmi_change_log` VALUES (670, 'S00000217', 174.7, 73.4, 175.1, 75.7, '2025-06-13 02:00:00');
INSERT INTO `bmi_change_log` VALUES (671, 'S00000217', 175.1, 75.7, 174.4, 78.2, '2025-07-17 07:13:00');
INSERT INTO `bmi_change_log` VALUES (672, 'S00000218', NULL, NULL, 167.1, 85.8, '2025-05-20 15:20:00');
INSERT INTO `bmi_change_log` VALUES (673, 'S00000218', 167.1, 85.8, 166, 84, '2025-03-26 20:58:00');
INSERT INTO `bmi_change_log` VALUES (674, 'S00000219', NULL, NULL, 152, 85.9, '2025-05-21 13:42:00');
INSERT INTO `bmi_change_log` VALUES (675, 'S00000219', 152, 85.9, 153.3, 85.7, '2025-03-30 16:59:00');
INSERT INTO `bmi_change_log` VALUES (676, 'S00000219', 153.3, 85.7, 151.7, 86.3, '2025-05-01 19:00:00');
INSERT INTO `bmi_change_log` VALUES (677, 'S00000219', 151.7, 86.3, 151.7, 83.7, '2025-03-28 05:45:00');
INSERT INTO `bmi_change_log` VALUES (678, 'S00000220', NULL, NULL, 162.1, 66.3, '2025-05-09 17:01:00');
INSERT INTO `bmi_change_log` VALUES (679, 'S00000220', 162.1, 66.3, 160.3, 65, '2025-05-26 23:23:00');
INSERT INTO `bmi_change_log` VALUES (680, 'S00000220', 160.3, 65, 161.2, 63.3, '2025-05-19 15:58:00');
INSERT INTO `bmi_change_log` VALUES (681, 'S00000220', 161.2, 63.3, 161.3, 63.2, '2025-07-06 07:56:00');
INSERT INTO `bmi_change_log` VALUES (682, 'S00000220', 161.3, 63.2, 160.2, 62.5, '2025-06-04 02:35:00');
INSERT INTO `bmi_change_log` VALUES (683, 'S00000221', NULL, NULL, 155.9, 61.9, '2025-08-22 07:05:00');
INSERT INTO `bmi_change_log` VALUES (684, 'S00000221', 155.9, 61.9, 155.9, 60, '2025-08-30 22:12:00');
INSERT INTO `bmi_change_log` VALUES (685, 'S00000221', 155.9, 60, 157.4, 58.6, '2025-07-22 11:35:00');
INSERT INTO `bmi_change_log` VALUES (686, 'S00000221', 157.4, 58.6, 157.3, 57.7, '2025-06-27 07:01:00');
INSERT INTO `bmi_change_log` VALUES (687, 'S00000221', 157.3, 57.7, 158.6, 55.1, '2025-08-09 03:55:00');
INSERT INTO `bmi_change_log` VALUES (688, 'S00000222', NULL, NULL, 171.3, 71.4, '2025-07-26 15:54:00');
INSERT INTO `bmi_change_log` VALUES (689, 'S00000222', 171.3, 71.4, 171.3, 73.4, '2025-08-18 09:35:00');
INSERT INTO `bmi_change_log` VALUES (690, 'S00000222', 171.3, 73.4, 170.9, 73.7, '2025-08-29 02:34:00');
INSERT INTO `bmi_change_log` VALUES (691, 'S00000222', 170.9, 73.7, 172.2, 75.2, '2025-09-17 10:22:00');
INSERT INTO `bmi_change_log` VALUES (692, 'S00000222', 172.2, 75.2, 173.8, 74.5, '2025-07-10 14:25:00');
INSERT INTO `bmi_change_log` VALUES (693, 'S00000223', NULL, NULL, 188.1, 65.7, '2025-05-21 03:53:00');
INSERT INTO `bmi_change_log` VALUES (694, 'S00000223', 188.1, 65.7, 188.7, 63.2, '2025-04-30 22:03:00');
INSERT INTO `bmi_change_log` VALUES (695, 'S00000223', 188.7, 63.2, 190.2, 65.8, '2025-05-29 07:39:00');
INSERT INTO `bmi_change_log` VALUES (696, 'S00000224', NULL, NULL, 168.8, 74.8, '2025-06-11 05:45:00');
INSERT INTO `bmi_change_log` VALUES (697, 'S00000224', 168.8, 74.8, 168.2, 72.4, '2025-06-12 21:23:00');
INSERT INTO `bmi_change_log` VALUES (698, 'S00000224', 168.2, 72.4, 167.3, 69.6, '2025-06-16 03:37:00');
INSERT INTO `bmi_change_log` VALUES (699, 'S00000224', 167.3, 69.6, 167.2, 68.4, '2025-05-23 15:26:00');
INSERT INTO `bmi_change_log` VALUES (700, 'S00000225', NULL, NULL, 161.2, 75.7, '2025-05-17 02:06:00');
INSERT INTO `bmi_change_log` VALUES (701, 'S00000225', 161.2, 75.7, 161.3, 75.2, '2025-04-19 20:34:00');
INSERT INTO `bmi_change_log` VALUES (702, 'S00000225', 161.3, 75.2, 160.6, 73.3, '2025-05-20 09:53:00');
INSERT INTO `bmi_change_log` VALUES (703, 'S00000225', 160.6, 73.3, 160.2, 73.2, '2025-05-01 16:00:00');
INSERT INTO `bmi_change_log` VALUES (704, 'S00000225', 160.2, 73.2, 160.9, 73.6, '2025-04-02 11:39:00');
INSERT INTO `bmi_change_log` VALUES (705, 'S00000226', NULL, NULL, 164.5, 51.1, '2025-05-26 01:11:00');
INSERT INTO `bmi_change_log` VALUES (706, 'S00000226', 164.5, 51.1, 165, 53.1, '2025-07-04 21:10:00');
INSERT INTO `bmi_change_log` VALUES (707, 'S00000226', 165, 53.1, 165.6, 52.4, '2025-06-25 09:51:00');
INSERT INTO `bmi_change_log` VALUES (708, 'S00000227', NULL, NULL, 187.8, 38.4, '2025-05-19 15:50:00');
INSERT INTO `bmi_change_log` VALUES (709, 'S00000227', 187.8, 38.4, 187.4, 40.9, '2025-05-18 08:07:00');
INSERT INTO `bmi_change_log` VALUES (710, 'S00000227', 187.4, 40.9, 186.8, 43.8, '2025-03-26 00:41:00');
INSERT INTO `bmi_change_log` VALUES (711, 'S00000227', 186.8, 43.8, 187.4, 46.5, '2025-03-24 22:39:00');
INSERT INTO `bmi_change_log` VALUES (712, 'S00000227', 187.4, 46.5, 187, 45.7, '2025-04-12 15:37:00');
INSERT INTO `bmi_change_log` VALUES (713, 'S00000228', NULL, NULL, 154.4, 82.3, '2025-02-09 17:45:00');
INSERT INTO `bmi_change_log` VALUES (714, 'S00000228', 154.4, 82.3, 155.4, 82.4, '2025-04-14 00:11:00');
INSERT INTO `bmi_change_log` VALUES (715, 'S00000228', 155.4, 82.4, 155.6, 83.9, '2025-01-30 08:17:00');
INSERT INTO `bmi_change_log` VALUES (716, 'S00000229', NULL, NULL, 178.2, 61, '2025-08-03 00:36:00');
INSERT INTO `bmi_change_log` VALUES (717, 'S00000229', 178.2, 61, 179.3, 61, '2025-07-18 08:19:00');
INSERT INTO `bmi_change_log` VALUES (718, 'S00000229', 179.3, 61, 178.8, 58, '2025-08-28 08:31:00');
INSERT INTO `bmi_change_log` VALUES (719, 'S00000230', NULL, NULL, 165.5, 75.7, '2025-05-04 02:56:00');
INSERT INTO `bmi_change_log` VALUES (720, 'S00000230', 165.5, 75.7, 163.9, 76.9, '2025-03-31 22:38:00');
INSERT INTO `bmi_change_log` VALUES (721, 'S00000230', 163.9, 76.9, 164.9, 75.9, '2025-03-16 11:00:00');
INSERT INTO `bmi_change_log` VALUES (722, 'S00000230', 164.9, 75.9, 163.8, 73.2, '2025-03-31 12:06:00');
INSERT INTO `bmi_change_log` VALUES (723, 'S00000230', 163.8, 73.2, 165, 72.2, '2025-03-01 14:56:00');
INSERT INTO `bmi_change_log` VALUES (724, 'S00000231', NULL, NULL, 161.1, 79.4, '2025-04-10 09:54:00');
INSERT INTO `bmi_change_log` VALUES (725, 'S00000231', 161.1, 79.4, 161.4, 78.3, '2025-05-31 07:20:00');
INSERT INTO `bmi_change_log` VALUES (726, 'S00000232', NULL, NULL, 186, 49.8, '2025-05-30 17:40:00');
INSERT INTO `bmi_change_log` VALUES (727, 'S00000232', 186, 49.8, 187.1, 48.7, '2025-06-22 04:53:00');
INSERT INTO `bmi_change_log` VALUES (728, 'S00000233', NULL, NULL, 177.9, 58.8, '2025-06-08 00:12:00');
INSERT INTO `bmi_change_log` VALUES (729, 'S00000233', 177.9, 58.8, 178.9, 60.2, '2025-07-09 04:17:00');
INSERT INTO `bmi_change_log` VALUES (730, 'S00000234', NULL, NULL, 168.1, 43.5, '2025-08-07 20:32:00');
INSERT INTO `bmi_change_log` VALUES (731, 'S00000234', 168.1, 43.5, 169.8, 43.7, '2025-06-29 06:33:00');
INSERT INTO `bmi_change_log` VALUES (732, 'S00000235', NULL, NULL, 176.5, 84.5, '2025-05-27 17:27:00');
INSERT INTO `bmi_change_log` VALUES (733, 'S00000236', NULL, NULL, 162.5, 76.7, '2025-05-10 10:38:00');
INSERT INTO `bmi_change_log` VALUES (734, 'S00000237', NULL, NULL, 178.6, 85.1, '2025-07-09 11:46:00');
INSERT INTO `bmi_change_log` VALUES (735, 'S00000237', 178.6, 85.1, 177.6, 84.9, '2025-05-01 14:08:00');
INSERT INTO `bmi_change_log` VALUES (736, 'S00000237', 177.6, 84.9, 176.5, 82.2, '2025-04-28 16:26:00');
INSERT INTO `bmi_change_log` VALUES (737, 'S00000238', NULL, NULL, 169.6, 44.8, '2025-05-02 13:22:00');
INSERT INTO `bmi_change_log` VALUES (738, 'S00000239', NULL, NULL, 179.8, 60.6, '2025-02-13 13:30:00');
INSERT INTO `bmi_change_log` VALUES (739, 'S00000240', NULL, NULL, 161.9, 61.8, '2025-06-16 17:10:00');
INSERT INTO `bmi_change_log` VALUES (740, 'S00000240', 161.9, 61.8, 161, 59.7, '2025-07-18 21:51:00');
INSERT INTO `bmi_change_log` VALUES (741, 'S00000240', 161, 59.7, 160.8, 60.3, '2025-07-29 02:09:00');
INSERT INTO `bmi_change_log` VALUES (742, 'S00000240', 160.8, 60.3, 162.4, 57.9, '2025-08-07 09:41:00');
INSERT INTO `bmi_change_log` VALUES (743, 'S00000240', 162.4, 57.9, 163.1, 56.3, '2025-07-15 11:57:00');
INSERT INTO `bmi_change_log` VALUES (744, 'S00000241', NULL, NULL, 169.3, 47.1, '2025-03-02 13:23:00');
INSERT INTO `bmi_change_log` VALUES (745, 'S00000241', 169.3, 47.1, 167.7, 45.9, '2025-03-10 01:39:00');
INSERT INTO `bmi_change_log` VALUES (746, 'S00000242', NULL, NULL, 170.7, 73.4, '2025-06-09 14:07:00');
INSERT INTO `bmi_change_log` VALUES (747, 'S00000242', 170.7, 73.4, 168.8, 73.2, '2025-05-25 17:02:00');
INSERT INTO `bmi_change_log` VALUES (748, 'S00000243', NULL, NULL, 169.7, 84.3, '2025-05-07 01:41:00');
INSERT INTO `bmi_change_log` VALUES (749, 'S00000243', 169.7, 84.3, 169.7, 83.3, '2025-07-16 06:39:00');
INSERT INTO `bmi_change_log` VALUES (750, 'S00000243', 169.7, 83.3, 169.2, 85.7, '2025-07-29 13:47:00');
INSERT INTO `bmi_change_log` VALUES (751, 'S00000244', NULL, NULL, 165.1, 66.3, '2025-06-03 09:52:00');
INSERT INTO `bmi_change_log` VALUES (752, 'S00000244', 165.1, 66.3, 165.3, 64.4, '2025-04-14 22:38:00');
INSERT INTO `bmi_change_log` VALUES (753, 'S00000245', NULL, NULL, 180.2, 45.5, '2025-09-14 13:23:00');
INSERT INTO `bmi_change_log` VALUES (754, 'S00000245', 180.2, 45.5, 181.8, 43.8, '2025-07-13 06:37:00');
INSERT INTO `bmi_change_log` VALUES (755, 'S00000245', 181.8, 43.8, 182.1, 46.6, '2025-08-06 20:03:00');
INSERT INTO `bmi_change_log` VALUES (756, 'S00000246', NULL, NULL, 185.3, 81.9, '2025-07-02 23:46:00');
INSERT INTO `bmi_change_log` VALUES (757, 'S00000246', 185.3, 81.9, 185, 80.4, '2025-08-21 08:30:00');
INSERT INTO `bmi_change_log` VALUES (758, 'S00000246', 185, 80.4, 185.1, 82.3, '2025-07-08 08:36:00');
INSERT INTO `bmi_change_log` VALUES (759, 'S00000246', 185.1, 82.3, 183.9, 81.5, '2025-08-10 12:13:00');
INSERT INTO `bmi_change_log` VALUES (760, 'S00000247', NULL, NULL, 161.2, 83, '2025-05-26 23:17:00');
INSERT INTO `bmi_change_log` VALUES (761, 'S00000247', 161.2, 83, 160.7, 80.3, '2025-04-15 11:20:00');
INSERT INTO `bmi_change_log` VALUES (762, 'S00000247', 160.7, 80.3, 158.8, 77.7, '2025-05-05 22:44:00');
INSERT INTO `bmi_change_log` VALUES (763, 'S00000247', 158.8, 77.7, 158.9, 75.5, '2025-04-17 14:42:00');
INSERT INTO `bmi_change_log` VALUES (764, 'S00000248', NULL, NULL, 167.9, 40.6, '2025-06-02 11:05:00');
INSERT INTO `bmi_change_log` VALUES (765, 'S00000248', 167.9, 40.6, 166.5, 41, '2025-05-31 23:25:00');
INSERT INTO `bmi_change_log` VALUES (766, 'S00000248', 166.5, 41, 165, 40.6, '2025-06-29 00:05:00');
INSERT INTO `bmi_change_log` VALUES (767, 'S00000248', 165, 40.6, 165, 39.9, '2025-07-14 14:04:00');
INSERT INTO `bmi_change_log` VALUES (768, 'S00000248', 165, 39.9, 167, 40.7, '2025-08-12 14:43:00');
INSERT INTO `bmi_change_log` VALUES (769, 'S00000249', NULL, NULL, 184.9, 63.9, '2025-03-05 13:22:00');
INSERT INTO `bmi_change_log` VALUES (770, 'S00000249', 184.9, 63.9, 184.5, 64.5, '2025-02-13 14:34:00');
INSERT INTO `bmi_change_log` VALUES (771, 'S00000249', 184.5, 64.5, 184, 63.9, '2025-03-07 01:01:00');
INSERT INTO `bmi_change_log` VALUES (772, 'S00000249', 184, 63.9, 182.5, 62.4, '2025-02-14 11:12:00');
INSERT INTO `bmi_change_log` VALUES (773, 'S00000250', NULL, NULL, 190.2, 51.8, '2025-04-02 08:59:00');
INSERT INTO `bmi_change_log` VALUES (774, 'S00000251', NULL, NULL, 189.4, 87.7, '2025-02-01 06:00:00');
INSERT INTO `bmi_change_log` VALUES (775, 'S00000251', 189.4, 87.7, 187.9, 87.1, '2025-02-26 00:36:00');
INSERT INTO `bmi_change_log` VALUES (776, 'S00000251', 187.9, 87.1, 189.8, 87.8, '2025-01-19 15:59:00');
INSERT INTO `bmi_change_log` VALUES (777, 'S00000251', 189.8, 87.8, 190.4, 87.8, '2025-03-08 07:51:00');
INSERT INTO `bmi_change_log` VALUES (778, 'S00000252', NULL, NULL, 157.2, 69.6, '2025-07-30 09:29:00');
INSERT INTO `bmi_change_log` VALUES (779, 'S00000252', 157.2, 69.6, 156.9, 69, '2025-05-23 20:14:00');
INSERT INTO `bmi_change_log` VALUES (780, 'S00000253', NULL, NULL, 152.4, 62.7, '2025-04-17 18:08:00');
INSERT INTO `bmi_change_log` VALUES (781, 'S00000254', NULL, NULL, 169.9, 51.1, '2025-06-02 15:57:00');
INSERT INTO `bmi_change_log` VALUES (782, 'S00000254', 169.9, 51.1, 168.3, 49.2, '2025-06-21 14:03:00');
INSERT INTO `bmi_change_log` VALUES (783, 'S00000254', 168.3, 49.2, 169.8, 47.3, '2025-05-11 01:17:00');
INSERT INTO `bmi_change_log` VALUES (784, 'S00000255', NULL, NULL, 170.5, 46.4, '2025-05-14 06:37:00');
INSERT INTO `bmi_change_log` VALUES (785, 'S00000255', 170.5, 46.4, 170.7, 47.1, '2025-05-29 07:18:00');
INSERT INTO `bmi_change_log` VALUES (786, 'S00000255', 170.7, 47.1, 168.8, 45.4, '2025-06-08 10:38:00');
INSERT INTO `bmi_change_log` VALUES (787, 'S00000255', 168.8, 45.4, 169.1, 42.8, '2025-04-25 14:41:00');
INSERT INTO `bmi_change_log` VALUES (788, 'S00000256', NULL, NULL, 162.4, 43.5, '2025-03-07 07:06:00');
INSERT INTO `bmi_change_log` VALUES (789, 'S00000256', 162.4, 43.5, 163.2, 42.7, '2025-02-14 02:05:00');
INSERT INTO `bmi_change_log` VALUES (790, 'S00000257', NULL, NULL, 157.5, 77.7, '2025-07-18 20:43:00');
INSERT INTO `bmi_change_log` VALUES (791, 'S00000257', 157.5, 77.7, 156.6, 75.3, '2025-07-12 06:11:00');
INSERT INTO `bmi_change_log` VALUES (792, 'S00000257', 156.6, 75.3, 157.1, 75.9, '2025-07-22 01:46:00');
INSERT INTO `bmi_change_log` VALUES (794, 'S00000001', NULL, NULL, 150.4, 69.1, '2025-06-07 15:58:52');
INSERT INTO `bmi_change_log` VALUES (796, 'S00000001', NULL, NULL, 150.4, 69.1, '2025-06-07 15:59:28');
INSERT INTO `bmi_change_log` VALUES (798, 'S00000001', NULL, NULL, 150.4, 69.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (799, 'S00000002', NULL, NULL, 156.3, 83.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (800, 'S00000003', NULL, NULL, 159.1, 51.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (801, 'S00000004', NULL, NULL, 150.3, 72, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (802, 'S00000005', NULL, NULL, 173.4, 40.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (803, 'S00000006', NULL, NULL, 178, 61.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (804, 'S00000007', NULL, NULL, 183.1, 77.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (805, 'S00000008', NULL, NULL, 176.5, 71.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (806, 'S00000009', NULL, NULL, 163.7, 76.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (807, 'S00000010', NULL, NULL, 175.7, 88.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (808, 'S00000011', NULL, NULL, 167.5, 83.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (809, 'S00000012', NULL, NULL, 167.6, 46.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (810, 'S00000013', NULL, NULL, 157.3, 53, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (811, 'S00000014', NULL, NULL, 155.2, 55.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (812, 'S00000015', NULL, NULL, 177.1, 63.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (813, 'S00000016', NULL, NULL, 176.5, 88.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (814, 'S00000017', NULL, NULL, 153.2, 63, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (815, 'S00000018', NULL, NULL, 159.6, 66.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (816, 'S00000019', NULL, NULL, 178.3, 86.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (817, 'S00000020', NULL, NULL, 163.9, 48.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (818, 'S00000021', NULL, NULL, 179.4, 62.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (819, 'S00000022', NULL, NULL, 163.1, 48.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (820, 'S00000023', NULL, NULL, 170.6, 85.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (821, 'S00000024', NULL, NULL, 171.3, 69.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (822, 'S00000025', NULL, NULL, 183.2, 74.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (823, 'S00000026', NULL, NULL, 159.3, 77.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (824, 'S00000027', NULL, NULL, 179.8, 72.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (825, 'S00000028', NULL, NULL, 171.4, 62, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (826, 'S00000029', NULL, NULL, 169.6, 77.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (827, 'S00000030', NULL, NULL, 154.2, 84.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (828, 'S00000031', NULL, NULL, 166.8, 48.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (829, 'S00000032', NULL, NULL, 154.6, 42.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (830, 'S00000033', NULL, NULL, 180.4, 65.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (831, 'S00000034', NULL, NULL, 188.6, 79, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (832, 'S00000035', NULL, NULL, 176.1, 75.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (833, 'S00000036', NULL, NULL, 156.9, 84.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (834, 'S00000037', NULL, NULL, 179.8, 86.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (835, 'S00000038', NULL, NULL, 187.3, 41.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (836, 'S00000039', NULL, NULL, 168.5, 54.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (837, 'S00000040', NULL, NULL, 155.5, 87.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (838, 'S00000041', NULL, NULL, 168.6, 61.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (839, 'S00000042', NULL, NULL, 170.8, 62.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (840, 'S00000043', NULL, NULL, 163.9, 42.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (841, 'S00000044', NULL, NULL, 175.4, 73.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (842, 'S00000045', NULL, NULL, 168.7, 72, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (843, 'S00000046', NULL, NULL, 176.2, 74.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (844, 'S00000047', NULL, NULL, 187.8, 84.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (845, 'S00000048', NULL, NULL, 158.8, 68.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (846, 'S00000049', NULL, NULL, 177.3, 59.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (847, 'S00000050', NULL, NULL, 161, 53.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (848, 'S00000051', NULL, NULL, 150.7, 83.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (849, 'S00000052', NULL, NULL, 178.1, 44.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (850, 'S00000053', NULL, NULL, 177.7, 70.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (851, 'S00000054', NULL, NULL, 180.7, 40.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (852, 'S00000055', NULL, NULL, 155.5, 69, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (853, 'S00000056', NULL, NULL, 166.1, 50.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (854, 'S00000057', NULL, NULL, 154.6, 42, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (855, 'S00000058', NULL, NULL, 165, 76.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (856, 'S00000059', NULL, NULL, 167.7, 50.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (857, 'S00000060', NULL, NULL, 170.4, 50, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (858, 'S00000061', NULL, NULL, 173.5, 51.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (859, 'S00000062', NULL, NULL, 155.3, 55.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (860, 'S00000063', NULL, NULL, 150.2, 52.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (861, 'S00000064', NULL, NULL, 152.8, 88, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (862, 'S00000065', NULL, NULL, 181.8, 67.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (863, 'S00000066', NULL, NULL, 163.3, 58.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (864, 'S00000067', NULL, NULL, 167.2, 50.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (865, 'S00000068', NULL, NULL, 157.9, 75, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (866, 'S00000069', NULL, NULL, 186.9, 83.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (867, 'S00000070', NULL, NULL, 185.2, 72.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (868, 'S00000071', NULL, NULL, 185.7, 86.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (869, 'S00000072', NULL, NULL, 189.9, 52.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (870, 'S00000073', NULL, NULL, 175.9, 73.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (871, 'S00000074', NULL, NULL, 170.8, 69.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (872, 'S00000075', NULL, NULL, 169.1, 64.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (873, 'S00000076', NULL, NULL, 167.5, 46.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (874, 'S00000077', NULL, NULL, 166, 53.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (875, 'S00000078', NULL, NULL, 167.6, 50.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (876, 'S00000079', NULL, NULL, 181.8, 49.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (877, 'S00000080', NULL, NULL, 178.6, 64.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (878, 'S00000081', NULL, NULL, 188.5, 82.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (879, 'S00000082', NULL, NULL, 164.9, 61.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (880, 'S00000083', NULL, NULL, 155.4, 83.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (881, 'S00000084', NULL, NULL, 173.4, 52.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (882, 'S00000085', NULL, NULL, 150.2, 61.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (883, 'S00000086', NULL, NULL, 181.6, 76.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (884, 'S00000087', NULL, NULL, 180.9, 51.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (885, 'S00000088', NULL, NULL, 176.5, 55.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (886, 'S00000089', NULL, NULL, 153.2, 47.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (887, 'S00000090', NULL, NULL, 156, 67.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (888, 'S00000091', NULL, NULL, 153.2, 47.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (889, 'S00000092', NULL, NULL, 168.2, 79.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (890, 'S00000093', NULL, NULL, 189.8, 60.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (891, 'S00000094', NULL, NULL, 171.3, 87.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (892, 'S00000095', NULL, NULL, 181.3, 45.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (893, 'S00000096', NULL, NULL, 175.9, 45.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (894, 'S00000097', NULL, NULL, 166.5, 63.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (895, 'S00000098', NULL, NULL, 154.3, 87.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (896, 'S00000099', NULL, NULL, 151.9, 55.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (897, 'S00000100', NULL, NULL, 184.5, 84.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (898, 'S00000101', NULL, NULL, 175, 52.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (899, 'S00000102', NULL, NULL, 188, 79.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (900, 'S00000103', NULL, NULL, 175.4, 45.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (901, 'S00000104', NULL, NULL, 164, 86.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (902, 'S00000105', NULL, NULL, 154.5, 44.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (903, 'S00000106', NULL, NULL, 172.4, 71.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (904, 'S00000107', NULL, NULL, 170.3, 68.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (905, 'S00000108', NULL, NULL, 166.3, 71, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (906, 'S00000109', NULL, NULL, 178.6, 52.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (907, 'S00000110', NULL, NULL, 151.5, 44.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (908, 'S00000111', NULL, NULL, 173.2, 52.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (909, 'S00000112', NULL, NULL, 155.4, 60.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (910, 'S00000113', NULL, NULL, 162.5, 53.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (911, 'S00000114', NULL, NULL, 186.7, 51.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (912, 'S00000115', NULL, NULL, 155.2, 82.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (913, 'S00000116', NULL, NULL, 177.7, 64, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (914, 'S00000117', NULL, NULL, 154.3, 77.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (915, 'S00000118', NULL, NULL, 152.3, 54.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (916, 'S00000119', NULL, NULL, 151.2, 59.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (917, 'S00000120', NULL, NULL, 176.3, 76.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (918, 'S00000121', NULL, NULL, 155.6, 78.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (919, 'S00000122', NULL, NULL, 188.9, 55.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (920, 'S00000123', NULL, NULL, 160.8, 85.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (921, 'S00000124', NULL, NULL, 166.7, 40.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (922, 'S00000125', NULL, NULL, 155.8, 57.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (923, 'S00000126', NULL, NULL, 189.6, 78, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (924, 'S00000127', NULL, NULL, 177.7, 41.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (925, 'S00000128', NULL, NULL, 164.6, 71, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (926, 'S00000129', NULL, NULL, 151.6, 50.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (927, 'S00000130', NULL, NULL, 161.9, 67, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (928, 'S00000131', NULL, NULL, 157.2, 63.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (929, 'S00000132', NULL, NULL, 178.6, 85.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (930, 'S00000133', NULL, NULL, 189.8, 62.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (931, 'S00000134', NULL, NULL, 180.7, 55.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (932, 'S00000135', NULL, NULL, 174.7, 49.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (933, 'S00000136', NULL, NULL, 188.3, 66.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (934, 'S00000137', NULL, NULL, 158.5, 78.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (935, 'S00000138', NULL, NULL, 183, 88, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (936, 'S00000139', NULL, NULL, 185.6, 89.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (937, 'S00000140', NULL, NULL, 165.7, 88.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (938, 'S00000141', NULL, NULL, 166.3, 58.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (939, 'S00000142', NULL, NULL, 165.8, 61, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (940, 'S00000143', NULL, NULL, 183.1, 69.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (941, 'S00000144', NULL, NULL, 188.1, 50.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (942, 'S00000145', NULL, NULL, 168.8, 59, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (943, 'S00000146', NULL, NULL, 168, 43.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (944, 'S00000147', NULL, NULL, 169.7, 44.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (945, 'S00000148', NULL, NULL, 157.4, 83.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (946, 'S00000149', NULL, NULL, 156.8, 87.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (947, 'S00000150', NULL, NULL, 181.9, 85.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (948, 'S00000151', NULL, NULL, 180.8, 74.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (949, 'S00000152', NULL, NULL, 163.5, 71.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (950, 'S00000153', NULL, NULL, 187.9, 87.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (951, 'S00000154', NULL, NULL, 188, 50.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (952, 'S00000155', NULL, NULL, 181.2, 54.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (953, 'S00000156', NULL, NULL, 166.7, 56.8, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (954, 'S00000157', NULL, NULL, 158.1, 56, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (955, 'S00000158', NULL, NULL, 178.1, 41.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (956, 'S00000159', NULL, NULL, 164.7, 50.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (957, 'S00000160', NULL, NULL, 167.8, 59.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (958, 'S00000161', NULL, NULL, 167.8, 54.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (959, 'S00000162', NULL, NULL, 174.2, 62.4, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (960, 'S00000163', NULL, NULL, 161, 54.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (961, 'S00000164', NULL, NULL, 176, 41.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (962, 'S00000165', NULL, NULL, 156.3, 74, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (963, 'S00000166', NULL, NULL, 158.5, 88, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (964, 'S00000167', NULL, NULL, 177.5, 87.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (965, 'S00000168', NULL, NULL, 166, 58.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (966, 'S00000169', NULL, NULL, 153.3, 87.5, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (967, 'S00000170', NULL, NULL, 160.4, 70.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (968, 'S00000171', NULL, NULL, 178, 55.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (969, 'S00000172', NULL, NULL, 156.4, 54.3, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (970, 'S00000173', NULL, NULL, 174, 47.7, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (971, 'S00000174', NULL, NULL, 159.6, 68.9, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (972, 'S00000175', NULL, NULL, 156.1, 75.2, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (973, 'S00000176', NULL, NULL, 164.7, 40.1, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (974, 'S00000177', NULL, NULL, 184.1, 64.6, '2025-06-07 16:01:18');
INSERT INTO `bmi_change_log` VALUES (975, 'S00000178', NULL, NULL, 160.8, 41.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (976, 'S00000179', NULL, NULL, 185.7, 47, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (977, 'S00000180', NULL, NULL, 176.2, 65.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (978, 'S00000181', NULL, NULL, 150.6, 50, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (979, 'S00000182', NULL, NULL, 182.1, 73.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (980, 'S00000183', NULL, NULL, 154.6, 67.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (981, 'S00000184', NULL, NULL, 153.1, 54.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (982, 'S00000185', NULL, NULL, 167.5, 84.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (983, 'S00000186', NULL, NULL, 184.2, 71.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (984, 'S00000187', NULL, NULL, 165.9, 73, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (985, 'S00000188', NULL, NULL, 162.3, 44.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (986, 'S00000189', NULL, NULL, 183.5, 48.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (987, 'S00000190', NULL, NULL, 189.6, 89.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (988, 'S00000191', NULL, NULL, 155.5, 74.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (989, 'S00000192', NULL, NULL, 189.1, 77.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (990, 'S00000193', NULL, NULL, 162.9, 48.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (991, 'S00000194', NULL, NULL, 155, 86.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (992, 'S00000195', NULL, NULL, 164.4, 53.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (993, 'S00000196', NULL, NULL, 179.4, 65.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (994, 'S00000197', NULL, NULL, 153.7, 89.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (995, 'S00000198', NULL, NULL, 175.5, 56.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (996, 'S00000199', NULL, NULL, 176.3, 50.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (997, 'S00000200', NULL, NULL, 181.7, 86.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (998, 'S00000201', NULL, NULL, 164.8, 57.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (999, 'S00000202', NULL, NULL, 189.8, 47.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1000, 'S00000203', NULL, NULL, 153.3, 87.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1001, 'S00000204', NULL, NULL, 171.2, 41.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1002, 'S00000205', NULL, NULL, 158.1, 70.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1003, 'S00000206', NULL, NULL, 172.8, 46.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1004, 'S00000207', NULL, NULL, 157.8, 71.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1005, 'S00000208', NULL, NULL, 168.2, 70.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1006, 'S00000209', NULL, NULL, 154.9, 81.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1007, 'S00000210', NULL, NULL, 186.5, 60.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1008, 'S00000211', NULL, NULL, 150.1, 53.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1009, 'S00000212', NULL, NULL, 160.6, 73.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1010, 'S00000213', NULL, NULL, 156.4, 64.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1011, 'S00000214', NULL, NULL, 150.2, 57.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1012, 'S00000215', NULL, NULL, 171, 87.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1013, 'S00000216', NULL, NULL, 168.5, 65.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1014, 'S00000217', NULL, NULL, 174.9, 76.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1015, 'S00000218', NULL, NULL, 165.5, 83.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1016, 'S00000219', NULL, NULL, 150.5, 86, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1017, 'S00000220', NULL, NULL, 161.8, 67.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1018, 'S00000221', NULL, NULL, 155.1, 58.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1019, 'S00000222', NULL, NULL, 171.1, 68.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1020, 'S00000223', NULL, NULL, 189, 67, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1021, 'S00000224', NULL, NULL, 169, 72.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1022, 'S00000225', NULL, NULL, 161.9, 74.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1023, 'S00000226', NULL, NULL, 163.2, 48.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1024, 'S00000227', NULL, NULL, 189.4, 40.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1025, 'S00000228', NULL, NULL, 153.3, 84.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1026, 'S00000229', NULL, NULL, 178.4, 61.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1027, 'S00000230', NULL, NULL, 163.5, 74.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1028, 'S00000231', NULL, NULL, 161.9, 81.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1029, 'S00000232', NULL, NULL, 187, 47.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1030, 'S00000233', NULL, NULL, 179.6, 60.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1031, 'S00000234', NULL, NULL, 169.3, 41.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1032, 'S00000235', NULL, NULL, 177.2, 83.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1033, 'S00000236', NULL, NULL, 164, 77.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1034, 'S00000237', NULL, NULL, 177.5, 83.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1035, 'S00000238', NULL, NULL, 169.6, 42.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1036, 'S00000239', NULL, NULL, 179.8, 61.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1037, 'S00000240', NULL, NULL, 160.5, 64.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1038, 'S00000241', NULL, NULL, 169.6, 49.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1039, 'S00000242', NULL, NULL, 172.3, 70.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1040, 'S00000243', NULL, NULL, 169.7, 82.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1041, 'S00000244', NULL, NULL, 164.4, 67.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1042, 'S00000245', NULL, NULL, 178.4, 48.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1043, 'S00000246', NULL, NULL, 185.5, 80, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1044, 'S00000247', NULL, NULL, 162.3, 82.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1045, 'S00000248', NULL, NULL, 169.7, 41.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1046, 'S00000249', NULL, NULL, 185.3, 63.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1047, 'S00000250', NULL, NULL, 188.5, 51.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1048, 'S00000251', NULL, NULL, 189, 86.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1049, 'S00000252', NULL, NULL, 159.1, 67.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1050, 'S00000253', NULL, NULL, 150.6, 64.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1051, 'S00000254', NULL, NULL, 171.5, 49, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1052, 'S00000255', NULL, NULL, 171.4, 44.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1053, 'S00000256', NULL, NULL, 162.1, 44.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1054, 'S00000257', NULL, NULL, 158.8, 76.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1055, 'S00000258', NULL, NULL, 151.3, 70, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1056, 'S00000259', NULL, NULL, 161.7, 57.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1057, 'S00000260', NULL, NULL, 151.5, 45.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1058, 'S00000261', NULL, NULL, 166.2, 47.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1059, 'S00000262', NULL, NULL, 170.8, 84.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1060, 'S00000263', NULL, NULL, 151.2, 42.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1061, 'S00000264', NULL, NULL, 161.2, 44.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1062, 'S00000265', NULL, NULL, 187.6, 60.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1063, 'S00000266', NULL, NULL, 168.7, 51.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1064, 'S00000267', NULL, NULL, 150.8, 72.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1065, 'S00000268', NULL, NULL, 165.9, 89.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1066, 'S00000269', NULL, NULL, 185.8, 86.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1067, 'S00000270', NULL, NULL, 161.3, 61.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1068, 'S00000271', NULL, NULL, 189.4, 51.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1069, 'S00000272', NULL, NULL, 151.9, 57.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1070, 'S00000273', NULL, NULL, 151.4, 80.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1071, 'S00000274', NULL, NULL, 184.7, 48.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1072, 'S00000275', NULL, NULL, 187.4, 48.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1073, 'S00000276', NULL, NULL, 184.3, 77.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1074, 'S00000277', NULL, NULL, 171.5, 84.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1075, 'S00000278', NULL, NULL, 155, 53.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1076, 'S00000279', NULL, NULL, 152.9, 63, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1077, 'S00000280', NULL, NULL, 184.6, 80.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1078, 'S00000281', NULL, NULL, 179.1, 42.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1079, 'S00000282', NULL, NULL, 160, 62.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1080, 'S00000283', NULL, NULL, 165.6, 54.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1081, 'S00000284', NULL, NULL, 189.4, 79.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1082, 'S00000285', NULL, NULL, 178.1, 67.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1083, 'S00000286', NULL, NULL, 170.7, 43.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1084, 'S00000287', NULL, NULL, 182.5, 65.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1085, 'S00000288', NULL, NULL, 165.1, 48.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1086, 'S00000289', NULL, NULL, 173.9, 82, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1087, 'S00000290', NULL, NULL, 189, 80.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1088, 'S00000291', NULL, NULL, 189, 61.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1089, 'S00000292', NULL, NULL, 182.5, 75.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1090, 'S00000293', NULL, NULL, 155.9, 87.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1091, 'S00000294', NULL, NULL, 162.6, 53.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1092, 'S00000295', NULL, NULL, 168.2, 58.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1093, 'S00000296', NULL, NULL, 156.1, 45.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1094, 'S00000297', NULL, NULL, 158.9, 87.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1095, 'S00000298', NULL, NULL, 164.1, 75.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1096, 'S00000299', NULL, NULL, 174.3, 50.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1097, 'S00000300', NULL, NULL, 189.6, 79, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1098, 'S00000301', NULL, NULL, 168.4, 68, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1099, 'S00000302', NULL, NULL, 171.8, 48.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1100, 'S00000303', NULL, NULL, 162.9, 74.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1101, 'S00000304', NULL, NULL, 159.7, 63.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1102, 'S00000305', NULL, NULL, 164.8, 40.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1103, 'S00000306', NULL, NULL, 173.4, 59.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1104, 'S00000307', NULL, NULL, 180.5, 50.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1105, 'S00000308', NULL, NULL, 189.1, 69.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1106, 'S00000309', NULL, NULL, 186.1, 86.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1107, 'S00000310', NULL, NULL, 186.8, 47.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1108, 'S00000311', NULL, NULL, 153.8, 88.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1109, 'S00000312', NULL, NULL, 184.9, 86.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1110, 'S00000313', NULL, NULL, 158.2, 69.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1111, 'S00000314', NULL, NULL, 163.5, 56.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1112, 'S00000315', NULL, NULL, 153.9, 42, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1113, 'S00000316', NULL, NULL, 168.6, 71.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1114, 'S00000317', NULL, NULL, 151.7, 43.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1115, 'S00000318', NULL, NULL, 156.2, 56.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1116, 'S00000319', NULL, NULL, 164.6, 80.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1117, 'S00000320', NULL, NULL, 155.2, 48.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1118, 'S00000321', NULL, NULL, 151.8, 63.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1119, 'S00000322', NULL, NULL, 165.9, 40.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1120, 'S00000323', NULL, NULL, 182.5, 57.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1121, 'S00000324', NULL, NULL, 175.3, 69.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1122, 'S00000325', NULL, NULL, 162.6, 71.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1123, 'S00000326', NULL, NULL, 156.9, 53.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1124, 'S00000327', NULL, NULL, 153.3, 88, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1125, 'S00000328', NULL, NULL, 173.4, 58.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1126, 'S00000329', NULL, NULL, 178.3, 69.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1127, 'S00000330', NULL, NULL, 187.1, 47.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1128, 'S00000331', NULL, NULL, 163.8, 73.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1129, 'S00000332', NULL, NULL, 172.6, 61.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1130, 'S00000333', NULL, NULL, 159, 53.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1131, 'S00000334', NULL, NULL, 156.7, 49.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1132, 'S00000335', NULL, NULL, 174.3, 78.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1133, 'S00000336', NULL, NULL, 185.4, 62.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1134, 'S00000337', NULL, NULL, 188.1, 86.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1135, 'S00000338', NULL, NULL, 184.9, 64.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1136, 'S00000339', NULL, NULL, 157.2, 45.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1137, 'S00000340', NULL, NULL, 151.5, 68.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1138, 'S00000341', NULL, NULL, 169.2, 69.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1139, 'S00000342', NULL, NULL, 158.8, 60.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1140, 'S00000343', NULL, NULL, 163.2, 81.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1141, 'S00000344', NULL, NULL, 168.2, 62.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1142, 'S00000345', NULL, NULL, 150.5, 74.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1143, 'S00000346', NULL, NULL, 174.8, 69.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1144, 'S00000347', NULL, NULL, 185.6, 54, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1145, 'S00000348', NULL, NULL, 163.8, 82.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1146, 'S00000349', NULL, NULL, 166.8, 61.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1147, 'S00000350', NULL, NULL, 171.5, 79.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1148, 'S00000351', NULL, NULL, 161.5, 43, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1149, 'S00000352', NULL, NULL, 169.2, 86.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1150, 'S00000353', NULL, NULL, 155, 86.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1151, 'S00000354', NULL, NULL, 172.3, 61.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1152, 'S00000355', NULL, NULL, 176.8, 40.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1153, 'S00000356', NULL, NULL, 188, 75.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1154, 'S00000357', NULL, NULL, 150.9, 56, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1155, 'S00000358', NULL, NULL, 188, 40.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1156, 'S00000359', NULL, NULL, 151.8, 59.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1157, 'S00000360', NULL, NULL, 177.9, 59.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1158, 'S00000361', NULL, NULL, 158.3, 51.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1159, 'S00000362', NULL, NULL, 158.5, 87, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1160, 'S00000363', NULL, NULL, 189.2, 73.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1161, 'S00000364', NULL, NULL, 165.6, 51.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1162, 'S00000365', NULL, NULL, 171.9, 81.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1163, 'S00000366', NULL, NULL, 160.1, 71.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1164, 'S00000367', NULL, NULL, 154.4, 48.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1165, 'S00000368', NULL, NULL, 189.1, 42.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1166, 'S00000369', NULL, NULL, 159.9, 63, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1167, 'S00000370', NULL, NULL, 188.1, 54.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1168, 'S00000371', NULL, NULL, 174, 48.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1169, 'S00000372', NULL, NULL, 160.5, 48.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1170, 'S00000373', NULL, NULL, 186.4, 62.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1171, 'S00000374', NULL, NULL, 150.7, 42.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1172, 'S00000375', NULL, NULL, 174.1, 65.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1173, 'S00000376', NULL, NULL, 157.5, 59.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1174, 'S00000377', NULL, NULL, 159, 41.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1175, 'S00000378', NULL, NULL, 168.5, 65.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1176, 'S00000379', NULL, NULL, 182.3, 42.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1177, 'S00000380', NULL, NULL, 181.6, 64.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1178, 'S00000381', NULL, NULL, 152.9, 64.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1179, 'S00000382', NULL, NULL, 173.7, 81.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1180, 'S00000383', NULL, NULL, 160, 41.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1181, 'S00000384', NULL, NULL, 163.1, 52.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1182, 'S00000385', NULL, NULL, 168.8, 78.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1183, 'S00000386', NULL, NULL, 176.7, 87.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1184, 'S00000387', NULL, NULL, 172, 41.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1185, 'S00000388', NULL, NULL, 162.3, 41.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1186, 'S00000389', NULL, NULL, 158.1, 64.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1187, 'S00000390', NULL, NULL, 186, 70.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1188, 'S00000391', NULL, NULL, 172.4, 70.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1189, 'S00000392', NULL, NULL, 178.4, 68.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1190, 'S00000393', NULL, NULL, 161.7, 82.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1191, 'S00000394', NULL, NULL, 170.5, 63.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1192, 'S00000395', NULL, NULL, 156.1, 88.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1193, 'S00000396', NULL, NULL, 159, 45.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1194, 'S00000397', NULL, NULL, 186.7, 83.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1195, 'S00000398', NULL, NULL, 188.2, 53.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1196, 'S00000399', NULL, NULL, 180.7, 47.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1197, 'S00000400', NULL, NULL, 181.3, 50.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1198, 'S00000401', NULL, NULL, 189.4, 41.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1199, 'S00000402', NULL, NULL, 170.7, 40.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1200, 'S00000403', NULL, NULL, 167.5, 47.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1201, 'S00000404', NULL, NULL, 180.8, 72.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1202, 'S00000405', NULL, NULL, 152.5, 47.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1203, 'S00000406', NULL, NULL, 187.9, 53.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1204, 'S00000407', NULL, NULL, 174.7, 78.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1205, 'S00000408', NULL, NULL, 157.3, 55.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1206, 'S00000409', NULL, NULL, 181.1, 79.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1207, 'S00000410', NULL, NULL, 181.6, 76.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1208, 'S00000411', NULL, NULL, 178.8, 60.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1209, 'S00000412', NULL, NULL, 168.5, 49.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1210, 'S00000413', NULL, NULL, 162.4, 49.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1211, 'S00000414', NULL, NULL, 179.9, 50, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1212, 'S00000415', NULL, NULL, 151.5, 73.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1213, 'S00000416', NULL, NULL, 153.7, 69.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1214, 'S00000417', NULL, NULL, 170.6, 42.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1215, 'S00000418', NULL, NULL, 171.2, 73, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1216, 'S00000419', NULL, NULL, 170.4, 87.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1217, 'S00000420', NULL, NULL, 185.6, 85.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1218, 'S00000421', NULL, NULL, 183, 50.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1219, 'S00000422', NULL, NULL, 177.5, 64.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1220, 'S00000423', NULL, NULL, 166.2, 78.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1221, 'S00000424', NULL, NULL, 153.5, 40.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1222, 'S00000425', NULL, NULL, 167, 71, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1223, 'S00000426', NULL, NULL, 183.5, 45.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1224, 'S00000427', NULL, NULL, 189.1, 66.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1225, 'S00000428', NULL, NULL, 153.9, 64.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1226, 'S00000429', NULL, NULL, 158, 52.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1227, 'S00000430', NULL, NULL, 159.6, 50, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1228, 'S00000431', NULL, NULL, 154.1, 48, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1229, 'S00000432', NULL, NULL, 153.2, 71.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1230, 'S00000433', NULL, NULL, 160, 58.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1231, 'S00000434', NULL, NULL, 170.2, 65.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1232, 'S00000435', NULL, NULL, 163.4, 64.2, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1233, 'S00000436', NULL, NULL, 152.9, 82.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1234, 'S00000437', NULL, NULL, 176.3, 70, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1235, 'S00000438', NULL, NULL, 188.7, 85.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1236, 'S00000439', NULL, NULL, 168.7, 47, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1237, 'S00000440', NULL, NULL, 155.3, 48.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1238, 'S00000441', NULL, NULL, 165.2, 44.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1239, 'S00000442', NULL, NULL, 171.4, 56.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1240, 'S00000443', NULL, NULL, 163.7, 58.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1241, 'S00000444', NULL, NULL, 151.7, 87.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1242, 'S00000445', NULL, NULL, 161.7, 88.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1243, 'S00000446', NULL, NULL, 157.9, 83.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1244, 'S00000447', NULL, NULL, 187.5, 63.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1245, 'S00000448', NULL, NULL, 164.4, 78.6, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1246, 'S00000449', NULL, NULL, 187.9, 46.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1247, 'S00000450', NULL, NULL, 174.5, 69, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1248, 'S00000451', NULL, NULL, 183, 54.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1249, 'S00000452', NULL, NULL, 182.9, 44.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1250, 'S00000453', NULL, NULL, 174.1, 65.1, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1251, 'S00000454', NULL, NULL, 155.6, 43.5, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1252, 'S00000455', NULL, NULL, 165.8, 68.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1253, 'S00000456', NULL, NULL, 151.5, 77.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1254, 'S00000457', NULL, NULL, 170.3, 65.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1255, 'S00000458', NULL, NULL, 156, 68.9, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1256, 'S00000459', NULL, NULL, 173.8, 66.7, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1257, 'S00000460', NULL, NULL, 158.1, 63.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1258, 'S00000461', NULL, NULL, 161, 67.3, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1259, 'S00000462', NULL, NULL, 171.5, 65.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1260, 'S00000463', NULL, NULL, 153.7, 85.4, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1261, 'S00000464', NULL, NULL, 174.4, 59.8, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1262, 'S00000465', NULL, NULL, 188.6, 74, '2025-06-07 16:01:19');
INSERT INTO `bmi_change_log` VALUES (1263, 'S00000466', NULL, NULL, 179.5, 76.4, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1264, 'S00000467', NULL, NULL, 160.9, 65, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1265, 'S00000468', NULL, NULL, 171.5, 69.8, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1266, 'S00000469', NULL, NULL, 177.6, 71.9, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1267, 'S00000470', NULL, NULL, 174, 40.2, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1268, 'S00000471', NULL, NULL, 166.5, 50.5, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1269, 'S00000472', NULL, NULL, 171.7, 45.5, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1270, 'S00000473', NULL, NULL, 155.5, 46.9, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1271, 'S00000474', NULL, NULL, 165.7, 76.7, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1272, 'S00000475', NULL, NULL, 180.2, 83.8, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1273, 'S00000476', NULL, NULL, 159.2, 61.5, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1274, 'S00000477', NULL, NULL, 183.4, 84.7, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1275, 'S00000478', NULL, NULL, 180.2, 74.6, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1276, 'S00000479', NULL, NULL, 155.4, 49.1, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1277, 'S00000480', NULL, NULL, 165.9, 68.9, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1278, 'S00000481', NULL, NULL, 181.2, 67.1, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1279, 'S00000482', NULL, NULL, 188.1, 57, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1280, 'S00000483', NULL, NULL, 151.8, 47.4, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1281, 'S00000484', NULL, NULL, 184, 43.4, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1282, 'S00000485', NULL, NULL, 156.8, 68.7, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1283, 'S00000486', NULL, NULL, 158.8, 61, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1284, 'S00000487', NULL, NULL, 151.4, 85.6, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1285, 'S00000488', NULL, NULL, 180, 84.8, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1286, 'S00000489', NULL, NULL, 183.5, 62, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1287, 'S00000490', NULL, NULL, 156.8, 61.5, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1288, 'S00000491', NULL, NULL, 171.2, 72.1, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1289, 'S00000492', NULL, NULL, 155, 78.4, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1290, 'S00000493', NULL, NULL, 185.8, 51.4, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1291, 'S00000494', NULL, NULL, 161.8, 45.9, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1292, 'S00000495', NULL, NULL, 186.5, 53.1, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1293, 'S00000496', NULL, NULL, 150.3, 77, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1294, 'S00000497', NULL, NULL, 156.4, 53.1, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1295, 'S00000498', NULL, NULL, 171.2, 50, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1296, 'S00000499', NULL, NULL, 181.6, 64.4, '2025-06-07 16:01:20');
INSERT INTO `bmi_change_log` VALUES (1297, 'S00000500', NULL, NULL, 161.5, 40.7, '2025-06-07 16:01:20');

-- ----------------------------
-- Table structure for dietary_record
-- ----------------------------
DROP TABLE IF EXISTS `dietary_record`;
CREATE TABLE `dietary_record`  (
  `id` int UNSIGNED NOT NULL AUTO_INCREMENT,
  `student_number` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `meal_type` tinyint NOT NULL COMMENT '餐次 0早餐 1午餐 2晚餐 3加餐',
  `food_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '食物名称',
  `food_weight` double NULL DEFAULT NULL COMMENT '食物重量 单位克',
  `food_calorie` int NULL DEFAULT NULL COMMENT '卡路里',
  `food_protein` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '蛋白质',
  `food_fat` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '脂肪',
  `food_carbohydrate` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '碳水化合物',
  `food_dietary_fiber` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '膳食纤维',
  `create_time` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `nk_one`(`student_number` ASC, `create_time` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 13 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用餐记录' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of dietary_record
-- ----------------------------
INSERT INTO `dietary_record` VALUES (1, '2331020130229', 0, '塔斯汀腾蛟鸡腿堡', 200, 450, '18.0', '22.0', NULL, '3.0', '2025-05-28 23:49:00');
INSERT INTO `dietary_record` VALUES (2, '2331020130229', 0, '全麦面包', 100, 246, '8.9', '3.7', NULL, '9.1', '2025-05-29 07:13:00');
INSERT INTO `dietary_record` VALUES (3, '2331020130229', 0, '纯牛奶', 250, 125, '8.0', '6.0', NULL, '0.0', '2025-05-29 07:30:00');
INSERT INTO `dietary_record` VALUES (4, '2331020130229', 1, '麻辣烫', 500, 300, '20.0', '15.0', NULL, '8.0', '2025-05-29 12:42:00');
INSERT INTO `dietary_record` VALUES (5, '2331020130229', 2, '塔斯汀汉堡', 100, 300, '12.0', '15.0', NULL, '2.0', '2025-05-29 21:43:00');
INSERT INTO `dietary_record` VALUES (10, '2331020130229', 3, '酸辣粉', 100, 350, '10.0', '15.0', '45.0', '3.0', '2025-05-29 23:09:40');
INSERT INTO `dietary_record` VALUES (11, '2331020130229', 1, '酸辣粉', 100, 350, '10.0', '15.0', '45.0', '2.0', '2025-05-30 19:58:50');
INSERT INTO `dietary_record` VALUES (12, '2331020130229', 0, '全麦面包', 50, 125, '4.5', '1.5', NULL, '3.0', '2025-06-05 07:39:00');

-- ----------------------------
-- Table structure for drinking_water_record
-- ----------------------------
DROP TABLE IF EXISTS `drinking_water_record`;
CREATE TABLE `drinking_water_record`  (
  `id` int UNSIGNED NOT NULL AUTO_INCREMENT,
  `student_number` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '学号',
  `capacity` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '喝水容量(毫升)',
  `drinking_time` datetime NULL DEFAULT NULL COMMENT '喝水时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 3 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户喝水记录表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of drinking_water_record
-- ----------------------------
INSERT INTO `drinking_water_record` VALUES (1, '2331020130229', '50ml', '2025-05-31 19:31:27');
INSERT INTO `drinking_water_record` VALUES (2, '2331020130229', '60ml', '2025-05-31 19:31:00');

-- ----------------------------
-- Table structure for gen_table
-- ----------------------------
DROP TABLE IF EXISTS `gen_table`;
CREATE TABLE `gen_table`  (
  `table_id` bigint NOT NULL AUTO_INCREMENT COMMENT '编号',
  `table_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '表名称',
  `table_comment` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '表描述',
  `sub_table_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '关联子表的表名',
  `sub_table_fk_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '子表关联的外键名',
  `class_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '实体类名称',
  `tpl_category` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT 'crud' COMMENT '使用的模板（crud单表操作 tree树表操作）',
  `tpl_web_type` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '前端模板类型（element-ui模版 element-plus模版）',
  `package_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '生成包路径',
  `module_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '生成模块名',
  `business_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '生成业务名',
  `function_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '生成功能名',
  `function_author` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '生成功能作者',
  `gen_type` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '生成代码方式（0zip压缩包 1自定义路径）',
  `gen_path` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '/' COMMENT '生成路径（不填默认项目路径）',
  `options` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '其它生成选项',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`table_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 3 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '代码生成业务表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of gen_table
-- ----------------------------
INSERT INTO `gen_table` VALUES (1, 'allergen', '过敏原', NULL, NULL, 'Allergen', 'crud', 'element-plus', 'top.codeflux.system', 'system', 'allergen', '过敏原', 'ruoyi', '0', '/', '{\"parentMenuId\":0}', 'admin', '2025-05-16 17:18:03', '', '2025-05-16 17:18:54', NULL);
INSERT INTO `gen_table` VALUES (2, 'app_user', 'app注册用户', 'allergen', 'student_id', 'AppUser', 'sub', 'element-plus', 'top.codeflux.appUser', 'intelligentNutrition-appUser', 'appUser', 'app注册用户', 'qht', '0', '/', '{\"parentMenuId\":2000}', 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:21:52', NULL);

-- ----------------------------
-- Table structure for gen_table_column
-- ----------------------------
DROP TABLE IF EXISTS `gen_table_column`;
CREATE TABLE `gen_table_column`  (
  `column_id` bigint NOT NULL AUTO_INCREMENT COMMENT '编号',
  `table_id` bigint NULL DEFAULT NULL COMMENT '归属表编号',
  `column_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '列名称',
  `column_comment` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '列描述',
  `column_type` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '列类型',
  `java_type` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'JAVA类型',
  `java_field` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT 'JAVA字段名',
  `is_pk` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否主键（1是）',
  `is_increment` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否自增（1是）',
  `is_required` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否必填（1是）',
  `is_insert` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否为插入字段（1是）',
  `is_edit` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否编辑字段（1是）',
  `is_list` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否列表字段（1是）',
  `is_query` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '是否查询字段（1是）',
  `query_type` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT 'EQ' COMMENT '查询方式（等于、不等于、大于、小于、范围）',
  `html_type` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '显示类型（文本框、文本域、下拉框、复选框、单选框、日期控件）',
  `dict_type` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典类型',
  `sort` int NULL DEFAULT NULL COMMENT '排序',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`column_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 14 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '代码生成业务表字段' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of gen_table_column
-- ----------------------------
INSERT INTO `gen_table_column` VALUES (1, 1, 'id', NULL, 'int unsigned', 'String', 'id', '1', '1', '0', '0', NULL, NULL, NULL, 'EQ', NULL, '', 1, 'admin', '2025-05-16 17:18:03', '', '2025-05-16 17:18:54');
INSERT INTO `gen_table_column` VALUES (2, 1, 'student_id', '学号', 'varchar(255)', 'String', 'studentId', '0', '0', '1', '0', '0', '0', '0', 'EQ', 'input', '', 2, 'admin', '2025-05-16 17:18:03', '', '2025-05-16 17:18:54');
INSERT INTO `gen_table_column` VALUES (3, 1, 'allergen', NULL, 'varchar(255)', 'String', 'allergen', '0', '0', '1', '1', '1', '1', '1', 'EQ', 'input', '', 3, 'admin', '2025-05-16 17:18:03', '', '2025-05-16 17:18:54');
INSERT INTO `gen_table_column` VALUES (4, 1, 'create_time', NULL, 'datetime', 'Date', 'createTime', '0', '0', '0', '0', NULL, NULL, NULL, 'EQ', 'datetime', '', 4, 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:18:54');
INSERT INTO `gen_table_column` VALUES (5, 2, 'id', NULL, 'int unsigned', 'String', 'id', '1', '1', '0', '1', NULL, NULL, NULL, 'EQ', NULL, '', 1, 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:21:52');
INSERT INTO `gen_table_column` VALUES (6, 2, 'student_number', '学号', 'varchar(255)', 'String', 'studentNumber', '0', '0', '1', '1', '1', '1', '1', 'EQ', 'input', '', 2, 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:21:52');
INSERT INTO `gen_table_column` VALUES (7, 2, 'name', '姓名', 'varchar(255)', 'String', 'name', '0', '0', '1', '1', '1', '1', '1', 'LIKE', 'input', '', 3, 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:21:52');
INSERT INTO `gen_table_column` VALUES (8, 2, 'password', '登录密码', 'varchar(255)', 'String', 'password', '0', '0', '0', '1', '1', '0', '0', 'EQ', 'input', '', 4, 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:21:52');
INSERT INTO `gen_table_column` VALUES (9, 2, 'avatar', '头像', 'varchar(255)', 'String', 'avatar', '0', '0', '1', '1', '1', '1', '1', 'EQ', 'imageUpload', '', 5, 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:21:52');
INSERT INTO `gen_table_column` VALUES (10, 2, 'height', '身高', 'double', 'Long', 'height', '0', '0', '0', '1', '1', '1', '1', 'EQ', 'input', '', 6, 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:21:52');
INSERT INTO `gen_table_column` VALUES (11, 2, 'weight', '体重', 'double', 'Long', 'weight', '0', '0', '0', '1', '1', '1', '1', 'EQ', 'input', '', 7, 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:21:52');
INSERT INTO `gen_table_column` VALUES (12, 2, 'create_time', NULL, 'datetime', 'Date', 'createTime', '0', '0', '0', '1', NULL, NULL, NULL, 'EQ', 'datetime', '', 8, 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:21:52');
INSERT INTO `gen_table_column` VALUES (13, 2, 'update_time', NULL, 'datetime', 'Date', 'updateTime', '0', '0', '0', '1', '0', NULL, NULL, 'EQ', 'datetime', '', 9, 'admin', '2025-05-16 17:18:04', '', '2025-05-16 17:21:52');

-- ----------------------------
-- Table structure for health_check_in
-- ----------------------------
DROP TABLE IF EXISTS `health_check_in`;
CREATE TABLE `health_check_in`  (
  `id` int UNSIGNED NOT NULL AUTO_INCREMENT,
  `student_number` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `create_time` datetime NULL DEFAULT NULL COMMENT '打卡时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户健康打卡表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of health_check_in
-- ----------------------------

-- ----------------------------
-- Table structure for health_score
-- ----------------------------
DROP TABLE IF EXISTS `health_score`;
CREATE TABLE `health_score`  (
  `id` int UNSIGNED NOT NULL AUTO_INCREMENT,
  `student_number` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '学号',
  `score` decimal(5, 2) NULL DEFAULT NULL COMMENT '分数',
  `create_time` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 12 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '健康评分表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of health_score
-- ----------------------------
INSERT INTO `health_score` VALUES (1, '2331020130229', 45.00, '2025-06-04 20:41:54');
INSERT INTO `health_score` VALUES (2, '2331020130229', 58.00, '2025-06-04 21:03:27');
INSERT INTO `health_score` VALUES (3, '2331020130229', 58.00, '2025-06-04 21:06:51');
INSERT INTO `health_score` VALUES (4, '2331020130229', 62.00, '2025-06-04 21:06:59');
INSERT INTO `health_score` VALUES (5, '2331020130229', 58.00, '2025-06-04 21:07:32');
INSERT INTO `health_score` VALUES (6, '2331020130229', 42.00, '2025-06-04 21:07:36');
INSERT INTO `health_score` VALUES (7, '2331020130229', 65.00, '2025-06-04 21:08:36');
INSERT INTO `health_score` VALUES (8, '2331020130229', 58.00, '2025-06-04 21:08:54');
INSERT INTO `health_score` VALUES (9, '2331020130229', 47.00, '2025-06-04 21:15:25');
INSERT INTO `health_score` VALUES (10, '2331020130229', 42.00, '2025-06-04 21:15:43');
INSERT INTO `health_score` VALUES (11, '2331020130229', 68.00, '2025-06-04 21:38:19');

-- ----------------------------
-- Table structure for history_health_data
-- ----------------------------
DROP TABLE IF EXISTS `history_health_data`;
CREATE TABLE `history_health_data`  (
  `id` int UNSIGNED NOT NULL AUTO_INCREMENT,
  `student_number` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '学号',
  `weight` double NOT NULL COMMENT '体重(kg)',
  `height` double NOT NULL COMMENT '身高(cm)',
  `create_time` datetime NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '历史健康数据记录' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of history_health_data
-- ----------------------------
INSERT INTO `history_health_data` VALUES (1, '2331020130229', 50, 200, '2025-05-01 09:27:02');
INSERT INTO `history_health_data` VALUES (2, '2331020130229', 52, 198, '2025-05-14 09:27:49');
INSERT INTO `history_health_data` VALUES (3, '2331020130229', 50, 190, '2025-05-27 09:28:25');

-- ----------------------------
-- Table structure for physical_examination_plan
-- ----------------------------
DROP TABLE IF EXISTS `physical_examination_plan`;
CREATE TABLE `physical_examination_plan`  (
  `id` int UNSIGNED NOT NULL AUTO_INCREMENT,
  `place` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '体检地点',
  `physical_examination_time` datetime NOT NULL,
  `create_time` datetime NULL DEFAULT NULL,
  `update_time` datetime NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '体检计划表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of physical_examination_plan
-- ----------------------------
INSERT INTO `physical_examination_plan` VALUES (1, '滴水城乐疗广场', '2025-06-11 20:34:12', '2025-05-26 20:34:27', '2025-05-26 20:34:30');

-- ----------------------------
-- Table structure for sport_record
-- ----------------------------
DROP TABLE IF EXISTS `sport_record`;
CREATE TABLE `sport_record`  (
  `id` int UNSIGNED NOT NULL AUTO_INCREMENT,
  `student_number` varbinary(255) NOT NULL COMMENT '学号',
  `sport_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '运动名/类型',
  `duration` double NULL DEFAULT NULL COMMENT '运动时长/分钟',
  `consume_calorie` decimal(8, 2) NULL DEFAULT NULL COMMENT '消耗卡路里',
  `exercise_time` datetime NULL DEFAULT NULL COMMENT '运动时间',
  `create_time` datetime NULL DEFAULT NULL COMMENT '录入时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 5 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户运动记录表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sport_record
-- ----------------------------
INSERT INTO `sport_record` VALUES (1, 0x32333331303230313330323239, '跑步', 39, 325.00, '2025-06-02 17:25:00', '2025-06-02 17:32:37');
INSERT INTO `sport_record` VALUES (2, 0x32333331303230313330323239, '快走', 1, 5.00, '2025-06-02 17:38:00', '2025-06-02 17:38:19');
INSERT INTO `sport_record` VALUES (3, 0x32333331303230313330323239, '快走', 1, 6.00, '2025-06-02 17:38:00', '2025-06-02 17:38:45');
INSERT INTO `sport_record` VALUES (4, 0x32333331303230313330323239, '慢跑', 120, 600.00, '2025-06-02 17:43:00', '2025-06-02 17:43:44');

-- ----------------------------
-- Table structure for sys_config
-- ----------------------------
DROP TABLE IF EXISTS `sys_config`;
CREATE TABLE `sys_config`  (
  `config_id` int NOT NULL AUTO_INCREMENT COMMENT '参数主键',
  `config_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '参数名称',
  `config_key` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '参数键名',
  `config_value` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '参数键值',
  `config_type` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT 'N' COMMENT '系统内置（Y是 N否）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`config_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 100 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '参数配置表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_config
-- ----------------------------
INSERT INTO `sys_config` VALUES (1, '主框架页-默认皮肤样式名称', 'sys.index.skinName', 'skin-blue', 'Y', 'admin', '2025-05-15 15:11:20', '', NULL, '蓝色 skin-blue、绿色 skin-green、紫色 skin-purple、红色 skin-red、黄色 skin-yellow');
INSERT INTO `sys_config` VALUES (2, '用户管理-账号初始密码', 'sys.user.initPassword', '123456', 'Y', 'admin', '2025-05-15 15:11:20', '', NULL, '初始化密码 123456');
INSERT INTO `sys_config` VALUES (3, '主框架页-侧边栏主题', 'sys.index.sideTheme', 'theme-dark', 'Y', 'admin', '2025-05-15 15:11:20', '', NULL, '深色主题theme-dark，浅色主题theme-light');
INSERT INTO `sys_config` VALUES (4, '账号自助-验证码开关', 'sys.account.captchaEnabled', 'true', 'Y', 'admin', '2025-05-15 15:11:20', '', NULL, '是否开启验证码功能（true开启，false关闭）');
INSERT INTO `sys_config` VALUES (5, '账号自助-是否开启用户注册功能', 'sys.account.registerUser', 'false', 'Y', 'admin', '2025-05-15 15:11:20', '', NULL, '是否开启注册用户功能（true开启，false关闭）');
INSERT INTO `sys_config` VALUES (6, '用户登录-黑名单列表', 'sys.login.blackIPList', '', 'Y', 'admin', '2025-05-15 15:11:20', '', NULL, '设置登录IP黑名单限制，多个匹配项以;分隔，支持匹配（*通配、网段）');

-- ----------------------------
-- Table structure for sys_dept
-- ----------------------------
DROP TABLE IF EXISTS `sys_dept`;
CREATE TABLE `sys_dept`  (
  `dept_id` bigint NOT NULL AUTO_INCREMENT COMMENT '部门id',
  `parent_id` bigint NULL DEFAULT 0 COMMENT '父部门id',
  `ancestors` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '祖级列表',
  `dept_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '部门名称',
  `order_num` int NULL DEFAULT 0 COMMENT '显示顺序',
  `leader` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '负责人',
  `phone` varchar(11) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '联系电话',
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '邮箱',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '部门状态（0正常 1停用）',
  `del_flag` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '删除标志（0代表存在 2代表删除）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`dept_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 200 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '部门表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_dept
-- ----------------------------
INSERT INTO `sys_dept` VALUES (100, 0, '0', '若依科技', 0, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL);
INSERT INTO `sys_dept` VALUES (101, 100, '0,100', '深圳总公司', 1, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL);
INSERT INTO `sys_dept` VALUES (102, 100, '0,100', '长沙分公司', 2, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL);
INSERT INTO `sys_dept` VALUES (103, 101, '0,100,101', '研发部门', 1, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL);
INSERT INTO `sys_dept` VALUES (104, 101, '0,100,101', '市场部门', 2, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL);
INSERT INTO `sys_dept` VALUES (105, 101, '0,100,101', '测试部门', 3, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL);
INSERT INTO `sys_dept` VALUES (106, 101, '0,100,101', '财务部门', 4, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL);
INSERT INTO `sys_dept` VALUES (107, 101, '0,100,101', '运维部门', 5, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL);
INSERT INTO `sys_dept` VALUES (108, 102, '0,100,102', '市场部门', 1, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL);
INSERT INTO `sys_dept` VALUES (109, 102, '0,100,102', '财务部门', 2, '若依', '15888888888', 'ry@qq.com', '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL);

-- ----------------------------
-- Table structure for sys_dict_data
-- ----------------------------
DROP TABLE IF EXISTS `sys_dict_data`;
CREATE TABLE `sys_dict_data`  (
  `dict_code` bigint NOT NULL AUTO_INCREMENT COMMENT '字典编码',
  `dict_sort` int NULL DEFAULT 0 COMMENT '字典排序',
  `dict_label` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典标签',
  `dict_value` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典键值',
  `dict_type` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典类型',
  `css_class` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '样式属性（其他样式扩展）',
  `list_class` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '表格回显样式',
  `is_default` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT 'N' COMMENT '是否默认（Y是 N否）',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '状态（0正常 1停用）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`dict_code`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 100 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '字典数据表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_dict_data
-- ----------------------------
INSERT INTO `sys_dict_data` VALUES (1, 1, '男', '0', 'sys_user_sex', '', '', 'Y', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '性别男');
INSERT INTO `sys_dict_data` VALUES (2, 2, '女', '1', 'sys_user_sex', '', '', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '性别女');
INSERT INTO `sys_dict_data` VALUES (3, 3, '未知', '2', 'sys_user_sex', '', '', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '性别未知');
INSERT INTO `sys_dict_data` VALUES (4, 1, '显示', '0', 'sys_show_hide', '', 'primary', 'Y', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '显示菜单');
INSERT INTO `sys_dict_data` VALUES (5, 2, '隐藏', '1', 'sys_show_hide', '', 'danger', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '隐藏菜单');
INSERT INTO `sys_dict_data` VALUES (6, 1, '正常', '0', 'sys_normal_disable', '', 'primary', 'Y', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '正常状态');
INSERT INTO `sys_dict_data` VALUES (7, 2, '停用', '1', 'sys_normal_disable', '', 'danger', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '停用状态');
INSERT INTO `sys_dict_data` VALUES (8, 1, '正常', '0', 'sys_job_status', '', 'primary', 'Y', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '正常状态');
INSERT INTO `sys_dict_data` VALUES (9, 2, '暂停', '1', 'sys_job_status', '', 'danger', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '停用状态');
INSERT INTO `sys_dict_data` VALUES (10, 1, '默认', 'DEFAULT', 'sys_job_group', '', '', 'Y', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '默认分组');
INSERT INTO `sys_dict_data` VALUES (11, 2, '系统', 'SYSTEM', 'sys_job_group', '', '', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '系统分组');
INSERT INTO `sys_dict_data` VALUES (12, 1, '是', 'Y', 'sys_yes_no', '', 'primary', 'Y', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '系统默认是');
INSERT INTO `sys_dict_data` VALUES (13, 2, '否', 'N', 'sys_yes_no', '', 'danger', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '系统默认否');
INSERT INTO `sys_dict_data` VALUES (14, 1, '通知', '1', 'sys_notice_type', '', 'warning', 'Y', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '通知');
INSERT INTO `sys_dict_data` VALUES (15, 2, '公告', '2', 'sys_notice_type', '', 'success', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '公告');
INSERT INTO `sys_dict_data` VALUES (16, 1, '正常', '0', 'sys_notice_status', '', 'primary', 'Y', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '正常状态');
INSERT INTO `sys_dict_data` VALUES (17, 2, '关闭', '1', 'sys_notice_status', '', 'danger', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '关闭状态');
INSERT INTO `sys_dict_data` VALUES (18, 99, '其他', '0', 'sys_oper_type', '', 'info', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '其他操作');
INSERT INTO `sys_dict_data` VALUES (19, 1, '新增', '1', 'sys_oper_type', '', 'info', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '新增操作');
INSERT INTO `sys_dict_data` VALUES (20, 2, '修改', '2', 'sys_oper_type', '', 'info', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '修改操作');
INSERT INTO `sys_dict_data` VALUES (21, 3, '删除', '3', 'sys_oper_type', '', 'danger', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '删除操作');
INSERT INTO `sys_dict_data` VALUES (22, 4, '授权', '4', 'sys_oper_type', '', 'primary', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '授权操作');
INSERT INTO `sys_dict_data` VALUES (23, 5, '导出', '5', 'sys_oper_type', '', 'warning', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '导出操作');
INSERT INTO `sys_dict_data` VALUES (24, 6, '导入', '6', 'sys_oper_type', '', 'warning', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '导入操作');
INSERT INTO `sys_dict_data` VALUES (25, 7, '强退', '7', 'sys_oper_type', '', 'danger', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '强退操作');
INSERT INTO `sys_dict_data` VALUES (26, 8, '生成代码', '8', 'sys_oper_type', '', 'warning', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '生成操作');
INSERT INTO `sys_dict_data` VALUES (27, 9, '清空数据', '9', 'sys_oper_type', '', 'danger', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '清空操作');
INSERT INTO `sys_dict_data` VALUES (28, 1, '成功', '0', 'sys_common_status', '', 'primary', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '正常状态');
INSERT INTO `sys_dict_data` VALUES (29, 2, '失败', '1', 'sys_common_status', '', 'danger', 'N', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '停用状态');

-- ----------------------------
-- Table structure for sys_dict_type
-- ----------------------------
DROP TABLE IF EXISTS `sys_dict_type`;
CREATE TABLE `sys_dict_type`  (
  `dict_id` bigint NOT NULL AUTO_INCREMENT COMMENT '字典主键',
  `dict_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典名称',
  `dict_type` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '字典类型',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '状态（0正常 1停用）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`dict_id`) USING BTREE,
  UNIQUE INDEX `dict_type`(`dict_type` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 100 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '字典类型表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_dict_type
-- ----------------------------
INSERT INTO `sys_dict_type` VALUES (1, '用户性别', 'sys_user_sex', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '用户性别列表');
INSERT INTO `sys_dict_type` VALUES (2, '菜单状态', 'sys_show_hide', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '菜单状态列表');
INSERT INTO `sys_dict_type` VALUES (3, '系统开关', 'sys_normal_disable', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '系统开关列表');
INSERT INTO `sys_dict_type` VALUES (4, '任务状态', 'sys_job_status', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '任务状态列表');
INSERT INTO `sys_dict_type` VALUES (5, '任务分组', 'sys_job_group', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '任务分组列表');
INSERT INTO `sys_dict_type` VALUES (6, '系统是否', 'sys_yes_no', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '系统是否列表');
INSERT INTO `sys_dict_type` VALUES (7, '通知类型', 'sys_notice_type', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '通知类型列表');
INSERT INTO `sys_dict_type` VALUES (8, '通知状态', 'sys_notice_status', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '通知状态列表');
INSERT INTO `sys_dict_type` VALUES (9, '操作类型', 'sys_oper_type', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '操作类型列表');
INSERT INTO `sys_dict_type` VALUES (10, '系统状态', 'sys_common_status', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '登录状态列表');

-- ----------------------------
-- Table structure for sys_job
-- ----------------------------
DROP TABLE IF EXISTS `sys_job`;
CREATE TABLE `sys_job`  (
  `job_id` bigint NOT NULL AUTO_INCREMENT COMMENT '任务ID',
  `job_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT '' COMMENT '任务名称',
  `job_group` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL DEFAULT 'DEFAULT' COMMENT '任务组名',
  `invoke_target` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调用目标字符串',
  `cron_expression` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT 'cron执行表达式',
  `misfire_policy` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '3' COMMENT '计划执行错误策略（1立即执行 2执行一次 3放弃执行）',
  `concurrent` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '1' COMMENT '是否并发执行（0允许 1禁止）',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '状态（0正常 1暂停）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '备注信息',
  PRIMARY KEY (`job_id`, `job_name`, `job_group`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 100 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '定时任务调度表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_job
-- ----------------------------
INSERT INTO `sys_job` VALUES (1, '系统默认（无参）', 'DEFAULT', 'ryTask.ryNoParams', '0/10 * * * * ?', '3', '1', '1', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_job` VALUES (2, '系统默认（有参）', 'DEFAULT', 'ryTask.ryParams(\'ry\')', '0/15 * * * * ?', '3', '1', '1', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_job` VALUES (3, '系统默认（多参）', 'DEFAULT', 'ryTask.ryMultipleParams(\'ry\', true, 2000L, 316.50D, 100)', '0/20 * * * * ?', '3', '1', '1', 'admin', '2025-05-15 15:11:20', '', NULL, '');

-- ----------------------------
-- Table structure for sys_job_log
-- ----------------------------
DROP TABLE IF EXISTS `sys_job_log`;
CREATE TABLE `sys_job_log`  (
  `job_log_id` bigint NOT NULL AUTO_INCREMENT COMMENT '任务日志ID',
  `job_name` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务名称',
  `job_group` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '任务组名',
  `invoke_target` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '调用目标字符串',
  `job_message` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '日志信息',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '执行状态（0正常 1失败）',
  `exception_info` varchar(2000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '异常信息',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`job_log_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '定时任务调度日志表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_job_log
-- ----------------------------

-- ----------------------------
-- Table structure for sys_logininfor
-- ----------------------------
DROP TABLE IF EXISTS `sys_logininfor`;
CREATE TABLE `sys_logininfor`  (
  `info_id` bigint NOT NULL AUTO_INCREMENT COMMENT '访问ID',
  `user_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '用户账号',
  `ipaddr` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '登录IP地址',
  `login_location` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '登录地点',
  `browser` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '浏览器类型',
  `os` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '操作系统',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '登录状态（0成功 1失败）',
  `msg` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '提示消息',
  `login_time` datetime NULL DEFAULT NULL COMMENT '访问时间',
  PRIMARY KEY (`info_id`) USING BTREE,
  INDEX `idx_sys_logininfor_s`(`status` ASC) USING BTREE,
  INDEX `idx_sys_logininfor_lt`(`login_time` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 155 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '系统访问记录' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_logininfor
-- ----------------------------
INSERT INTO `sys_logininfor` VALUES (100, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-15 15:17:22');
INSERT INTO `sys_logininfor` VALUES (101, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-16 17:06:36');
INSERT INTO `sys_logininfor` VALUES (102, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-16 20:56:06');
INSERT INTO `sys_logininfor` VALUES (103, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-20 08:25:38');
INSERT INTO `sys_logininfor` VALUES (104, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-20 10:17:02');
INSERT INTO `sys_logininfor` VALUES (105, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码错误', '2025-05-20 11:57:51');
INSERT INTO `sys_logininfor` VALUES (106, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-20 11:57:55');
INSERT INTO `sys_logininfor` VALUES (107, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码错误', '2025-05-21 14:07:24');
INSERT INTO `sys_logininfor` VALUES (108, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-21 14:07:28');
INSERT INTO `sys_logininfor` VALUES (109, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-26 10:35:51');
INSERT INTO `sys_logininfor` VALUES (110, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-26 16:39:09');
INSERT INTO `sys_logininfor` VALUES (111, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码已失效', '2025-05-27 08:12:57');
INSERT INTO `sys_logininfor` VALUES (112, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-27 08:12:59');
INSERT INTO `sys_logininfor` VALUES (113, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码已失效', '2025-05-27 11:09:57');
INSERT INTO `sys_logininfor` VALUES (114, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-27 11:10:03');
INSERT INTO `sys_logininfor` VALUES (115, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码已失效', '2025-05-27 20:02:01');
INSERT INTO `sys_logininfor` VALUES (116, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-27 20:02:04');
INSERT INTO `sys_logininfor` VALUES (117, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-27 20:33:39');
INSERT INTO `sys_logininfor` VALUES (118, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码已失效', '2025-05-27 21:34:08');
INSERT INTO `sys_logininfor` VALUES (119, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-05-27 21:34:58');
INSERT INTO `sys_logininfor` VALUES (120, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-01 11:54:48');
INSERT INTO `sys_logininfor` VALUES (121, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-01 16:26:59');
INSERT INTO `sys_logininfor` VALUES (122, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-01 17:55:28');
INSERT INTO `sys_logininfor` VALUES (123, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-01 21:34:04');
INSERT INTO `sys_logininfor` VALUES (124, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-03 19:35:19');
INSERT INTO `sys_logininfor` VALUES (125, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-04 08:18:23');
INSERT INTO `sys_logininfor` VALUES (126, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-04 09:22:11');
INSERT INTO `sys_logininfor` VALUES (127, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码错误', '2025-06-04 11:44:09');
INSERT INTO `sys_logininfor` VALUES (128, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-04 11:44:12');
INSERT INTO `sys_logininfor` VALUES (129, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码已失效', '2025-06-04 15:51:47');
INSERT INTO `sys_logininfor` VALUES (130, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-04 15:51:52');
INSERT INTO `sys_logininfor` VALUES (131, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码已失效', '2025-06-04 20:21:06');
INSERT INTO `sys_logininfor` VALUES (132, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-04 20:21:09');
INSERT INTO `sys_logininfor` VALUES (133, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-05 09:48:26');
INSERT INTO `sys_logininfor` VALUES (134, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码已失效', '2025-06-05 16:03:33');
INSERT INTO `sys_logininfor` VALUES (135, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-05 16:03:37');
INSERT INTO `sys_logininfor` VALUES (136, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-05 19:35:55');
INSERT INTO `sys_logininfor` VALUES (137, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码已失效', '2025-06-05 20:19:05');
INSERT INTO `sys_logininfor` VALUES (138, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码错误', '2025-06-05 20:19:08');
INSERT INTO `sys_logininfor` VALUES (139, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-05 20:19:11');
INSERT INTO `sys_logininfor` VALUES (140, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码已失效', '2025-06-05 21:20:19');
INSERT INTO `sys_logininfor` VALUES (141, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码错误', '2025-06-05 21:20:24');
INSERT INTO `sys_logininfor` VALUES (142, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-05 21:20:28');
INSERT INTO `sys_logininfor` VALUES (143, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-05 22:19:46');
INSERT INTO `sys_logininfor` VALUES (144, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-06 08:16:02');
INSERT INTO `sys_logininfor` VALUES (145, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '退出成功', '2025-06-06 08:29:45');
INSERT INTO `sys_logininfor` VALUES (146, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-06 08:29:50');
INSERT INTO `sys_logininfor` VALUES (147, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-06 13:52:09');
INSERT INTO `sys_logininfor` VALUES (148, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '1', '验证码错误', '2025-06-06 21:31:31');
INSERT INTO `sys_logininfor` VALUES (149, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-06 21:31:35');
INSERT INTO `sys_logininfor` VALUES (150, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-06 22:13:33');
INSERT INTO `sys_logininfor` VALUES (151, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-06 23:14:44');
INSERT INTO `sys_logininfor` VALUES (152, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-07 09:00:08');
INSERT INTO `sys_logininfor` VALUES (153, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-07 10:30:30');
INSERT INTO `sys_logininfor` VALUES (154, 'admin', '127.0.0.1', '内网IP', 'Chrome 13', 'Windows 10', '0', '登录成功', '2025-06-07 15:30:01');

-- ----------------------------
-- Table structure for sys_menu
-- ----------------------------
DROP TABLE IF EXISTS `sys_menu`;
CREATE TABLE `sys_menu`  (
  `menu_id` bigint NOT NULL AUTO_INCREMENT COMMENT '菜单ID',
  `menu_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '菜单名称',
  `parent_id` bigint NULL DEFAULT 0 COMMENT '父菜单ID',
  `order_num` int NULL DEFAULT 0 COMMENT '显示顺序',
  `path` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '路由地址',
  `component` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '组件路径',
  `query` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '路由参数',
  `route_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '路由名称',
  `is_frame` int NULL DEFAULT 1 COMMENT '是否为外链（0是 1否）',
  `is_cache` int NULL DEFAULT 0 COMMENT '是否缓存（0缓存 1不缓存）',
  `menu_type` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '菜单类型（M目录 C菜单 F按钮）',
  `visible` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '菜单状态（0显示 1隐藏）',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '菜单状态（0正常 1停用）',
  `perms` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '权限标识',
  `icon` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '#' COMMENT '菜单图标',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '备注',
  PRIMARY KEY (`menu_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2007 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '菜单权限表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_menu
-- ----------------------------
INSERT INTO `sys_menu` VALUES (1, '系统管理', 0, 1, 'system', NULL, '', '', 1, 0, 'M', '0', '0', '', 'system', 'admin', '2025-05-15 15:11:20', '', NULL, '系统管理目录');
INSERT INTO `sys_menu` VALUES (2, '系统监控', 0, 2, 'monitor', NULL, '', '', 1, 0, 'M', '0', '0', '', 'monitor', 'admin', '2025-05-15 15:11:20', '', NULL, '系统监控目录');
INSERT INTO `sys_menu` VALUES (3, '系统工具', 0, 3, 'tool', NULL, '', '', 1, 0, 'M', '0', '0', '', 'tool', 'admin', '2025-05-15 15:11:20', '', NULL, '系统工具目录');
INSERT INTO `sys_menu` VALUES (4, '官网', 0, 4, 'http://codeflux.top', NULL, '', '', 0, 0, 'M', '1', '1', '', 'guide', 'admin', '2025-05-15 15:11:20', 'admin', '2025-05-15 15:34:45', '若依官网地址');
INSERT INTO `sys_menu` VALUES (100, '用户管理', 1, 1, 'user', 'system/user/index', '', '', 1, 0, 'C', '0', '0', 'system:user:list', 'user', 'admin', '2025-05-15 15:11:20', '', NULL, '用户管理菜单');
INSERT INTO `sys_menu` VALUES (101, '角色管理', 1, 2, 'role', 'system/role/index', '', '', 1, 0, 'C', '0', '0', 'system:role:list', 'peoples', 'admin', '2025-05-15 15:11:20', '', NULL, '角色管理菜单');
INSERT INTO `sys_menu` VALUES (102, '菜单管理', 1, 3, 'menu', 'system/menu/index', '', '', 1, 0, 'C', '0', '0', 'system:menu:list', 'tree-table', 'admin', '2025-05-15 15:11:20', '', NULL, '菜单管理菜单');
INSERT INTO `sys_menu` VALUES (103, '部门管理', 1, 4, 'dept', 'system/dept/index', '', '', 1, 0, 'C', '0', '0', 'system:dept:list', 'tree', 'admin', '2025-05-15 15:11:20', '', NULL, '部门管理菜单');
INSERT INTO `sys_menu` VALUES (104, '岗位管理', 1, 5, 'post', 'system/post/index', '', '', 1, 0, 'C', '0', '0', 'system:post:list', 'post', 'admin', '2025-05-15 15:11:20', '', NULL, '岗位管理菜单');
INSERT INTO `sys_menu` VALUES (105, '字典管理', 1, 6, 'dict', 'system/dict/index', '', '', 1, 0, 'C', '0', '0', 'system:dict:list', 'dict', 'admin', '2025-05-15 15:11:20', '', NULL, '字典管理菜单');
INSERT INTO `sys_menu` VALUES (106, '参数设置', 1, 7, 'config', 'system/config/index', '', '', 1, 0, 'C', '0', '0', 'system:config:list', 'edit', 'admin', '2025-05-15 15:11:20', '', NULL, '参数设置菜单');
INSERT INTO `sys_menu` VALUES (107, '通知公告', 1, 8, 'notice', 'system/notice/index', '', '', 1, 0, 'C', '0', '0', 'system:notice:list', 'message', 'admin', '2025-05-15 15:11:20', '', NULL, '通知公告菜单');
INSERT INTO `sys_menu` VALUES (108, '日志管理', 1, 9, 'log', '', '', '', 1, 0, 'M', '0', '0', '', 'log', 'admin', '2025-05-15 15:11:20', '', NULL, '日志管理菜单');
INSERT INTO `sys_menu` VALUES (109, '在线用户', 2, 1, 'online', 'monitor/online/index', '', '', 1, 0, 'C', '0', '0', 'monitor:online:list', 'online', 'admin', '2025-05-15 15:11:20', '', NULL, '在线用户菜单');
INSERT INTO `sys_menu` VALUES (110, '定时任务', 2, 2, 'job', 'monitor/job/index', '', '', 1, 0, 'C', '0', '0', 'monitor:job:list', 'job', 'admin', '2025-05-15 15:11:20', '', NULL, '定时任务菜单');
INSERT INTO `sys_menu` VALUES (111, '数据监控', 2, 3, 'druid', 'monitor/druid/index', '', '', 1, 0, 'C', '0', '0', 'monitor:druid:list', 'druid', 'admin', '2025-05-15 15:11:20', '', NULL, '数据监控菜单');
INSERT INTO `sys_menu` VALUES (112, '服务监控', 2, 4, 'server', 'monitor/server/index', '', '', 1, 0, 'C', '0', '0', 'monitor:server:list', 'server', 'admin', '2025-05-15 15:11:20', '', NULL, '服务监控菜单');
INSERT INTO `sys_menu` VALUES (113, '缓存监控', 2, 5, 'cache', 'monitor/cache/index', '', '', 1, 0, 'C', '0', '0', 'monitor:cache:list', 'redis', 'admin', '2025-05-15 15:11:20', '', NULL, '缓存监控菜单');
INSERT INTO `sys_menu` VALUES (114, '缓存列表', 2, 6, 'cacheList', 'monitor/cache/list', '', '', 1, 0, 'C', '0', '0', 'monitor:cache:list', 'redis-list', 'admin', '2025-05-15 15:11:20', '', NULL, '缓存列表菜单');
INSERT INTO `sys_menu` VALUES (115, '表单构建', 3, 1, 'build', 'tool/build/index', '', '', 1, 0, 'C', '0', '0', 'tool:build:list', 'build', 'admin', '2025-05-15 15:11:20', '', NULL, '表单构建菜单');
INSERT INTO `sys_menu` VALUES (116, '代码生成', 3, 2, 'gen', 'tool/gen/index', '', '', 1, 0, 'C', '0', '0', 'tool:gen:list', 'code', 'admin', '2025-05-15 15:11:20', '', NULL, '代码生成菜单');
INSERT INTO `sys_menu` VALUES (117, '系统接口', 3, 3, 'swagger', 'tool/swagger/index', '', '', 1, 0, 'C', '0', '0', 'tool:swagger:list', 'swagger', 'admin', '2025-05-15 15:11:20', '', NULL, '系统接口菜单');
INSERT INTO `sys_menu` VALUES (500, '操作日志', 108, 1, 'operlog', 'monitor/operlog/index', '', '', 1, 0, 'C', '0', '0', 'monitor:operlog:list', 'form', 'admin', '2025-05-15 15:11:20', '', NULL, '操作日志菜单');
INSERT INTO `sys_menu` VALUES (501, '登录日志', 108, 2, 'logininfor', 'monitor/logininfor/index', '', '', 1, 0, 'C', '0', '0', 'monitor:logininfor:list', 'logininfor', 'admin', '2025-05-15 15:11:20', '', NULL, '登录日志菜单');
INSERT INTO `sys_menu` VALUES (1000, '用户查询', 100, 1, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1001, '用户新增', 100, 2, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:add', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1002, '用户修改', 100, 3, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:edit', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1003, '用户删除', 100, 4, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1004, '用户导出', 100, 5, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:export', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1005, '用户导入', 100, 6, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:import', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1006, '重置密码', 100, 7, '', '', '', '', 1, 0, 'F', '0', '0', 'system:user:resetPwd', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1007, '角色查询', 101, 1, '', '', '', '', 1, 0, 'F', '0', '0', 'system:role:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1008, '角色新增', 101, 2, '', '', '', '', 1, 0, 'F', '0', '0', 'system:role:add', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1009, '角色修改', 101, 3, '', '', '', '', 1, 0, 'F', '0', '0', 'system:role:edit', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1010, '角色删除', 101, 4, '', '', '', '', 1, 0, 'F', '0', '0', 'system:role:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1011, '角色导出', 101, 5, '', '', '', '', 1, 0, 'F', '0', '0', 'system:role:export', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1012, '菜单查询', 102, 1, '', '', '', '', 1, 0, 'F', '0', '0', 'system:menu:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1013, '菜单新增', 102, 2, '', '', '', '', 1, 0, 'F', '0', '0', 'system:menu:add', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1014, '菜单修改', 102, 3, '', '', '', '', 1, 0, 'F', '0', '0', 'system:menu:edit', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1015, '菜单删除', 102, 4, '', '', '', '', 1, 0, 'F', '0', '0', 'system:menu:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1016, '部门查询', 103, 1, '', '', '', '', 1, 0, 'F', '0', '0', 'system:dept:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1017, '部门新增', 103, 2, '', '', '', '', 1, 0, 'F', '0', '0', 'system:dept:add', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1018, '部门修改', 103, 3, '', '', '', '', 1, 0, 'F', '0', '0', 'system:dept:edit', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1019, '部门删除', 103, 4, '', '', '', '', 1, 0, 'F', '0', '0', 'system:dept:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1020, '岗位查询', 104, 1, '', '', '', '', 1, 0, 'F', '0', '0', 'system:post:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1021, '岗位新增', 104, 2, '', '', '', '', 1, 0, 'F', '0', '0', 'system:post:add', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1022, '岗位修改', 104, 3, '', '', '', '', 1, 0, 'F', '0', '0', 'system:post:edit', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1023, '岗位删除', 104, 4, '', '', '', '', 1, 0, 'F', '0', '0', 'system:post:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1024, '岗位导出', 104, 5, '', '', '', '', 1, 0, 'F', '0', '0', 'system:post:export', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1025, '字典查询', 105, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:dict:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1026, '字典新增', 105, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:dict:add', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1027, '字典修改', 105, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:dict:edit', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1028, '字典删除', 105, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:dict:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1029, '字典导出', 105, 5, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:dict:export', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1030, '参数查询', 106, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:config:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1031, '参数新增', 106, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:config:add', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1032, '参数修改', 106, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:config:edit', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1033, '参数删除', 106, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:config:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1034, '参数导出', 106, 5, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:config:export', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1035, '公告查询', 107, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:notice:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1036, '公告新增', 107, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:notice:add', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1037, '公告修改', 107, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:notice:edit', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1038, '公告删除', 107, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'system:notice:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1039, '操作查询', 500, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:operlog:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1040, '操作删除', 500, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:operlog:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1041, '日志导出', 500, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:operlog:export', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1042, '登录查询', 501, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:logininfor:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1043, '登录删除', 501, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:logininfor:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1044, '日志导出', 501, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:logininfor:export', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1045, '账户解锁', 501, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:logininfor:unlock', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1046, '在线查询', 109, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:online:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1047, '批量强退', 109, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:online:batchLogout', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1048, '单条强退', 109, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:online:forceLogout', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1049, '任务查询', 110, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1050, '任务新增', 110, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:add', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1051, '任务修改', 110, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:edit', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1052, '任务删除', 110, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1053, '状态修改', 110, 5, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:changeStatus', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1054, '任务导出', 110, 6, '#', '', '', '', 1, 0, 'F', '0', '0', 'monitor:job:export', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1055, '生成查询', 116, 1, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:query', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1056, '生成修改', 116, 2, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:edit', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1057, '生成删除', 116, 3, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:remove', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1058, '导入代码', 116, 4, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:import', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1059, '预览代码', 116, 5, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:preview', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (1060, '生成代码', 116, 6, '#', '', '', '', 1, 0, 'F', '0', '0', 'tool:gen:code', '#', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2000, 'app用户', 0, 0, '/appUser', NULL, NULL, '', 1, 0, 'M', '0', '0', NULL, 'user', 'admin', '2025-05-16 17:07:42', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2001, 'app注册用户', 2000, 1, 'appUser', 'intelligentNutrition-appUser/appUser/index', NULL, '', 1, 0, 'C', '0', '0', 'intelligentNutrition-appUser:appUser:list', 'peoples', 'admin', '2025-05-16 17:22:44', 'admin', '2025-05-26 10:37:41', 'app注册用户菜单');
INSERT INTO `sys_menu` VALUES (2002, 'app注册用户查询', 2001, 1, '#', '', NULL, '', 1, 0, 'F', '0', '0', 'intelligentNutrition-appUser:appUser:query', '#', 'admin', '2025-05-16 17:22:44', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2003, 'app注册用户新增', 2001, 2, '#', '', NULL, '', 1, 0, 'F', '0', '0', 'intelligentNutrition-appUser:appUser:add', '#', 'admin', '2025-05-16 17:22:44', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2004, 'app注册用户修改', 2001, 3, '#', '', NULL, '', 1, 0, 'F', '0', '0', 'intelligentNutrition-appUser:appUser:edit', '#', 'admin', '2025-05-16 17:22:44', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2005, 'app注册用户删除', 2001, 4, '#', '', NULL, '', 1, 0, 'F', '0', '0', 'intelligentNutrition-appUser:appUser:remove', '#', 'admin', '2025-05-16 17:22:44', '', NULL, '');
INSERT INTO `sys_menu` VALUES (2006, 'app注册用户导出', 2001, 5, '#', '', NULL, '', 1, 0, 'F', '0', '0', 'intelligentNutrition-appUser:appUser:export', '#', 'admin', '2025-05-16 17:22:44', '', NULL, '');

-- ----------------------------
-- Table structure for sys_notice
-- ----------------------------
DROP TABLE IF EXISTS `sys_notice`;
CREATE TABLE `sys_notice`  (
  `notice_id` int NOT NULL AUTO_INCREMENT COMMENT '公告ID',
  `notice_title` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '公告标题',
  `notice_type` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '公告类型（1通知 2公告）',
  `notice_content` longblob NULL COMMENT '公告内容',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '公告状态（0正常 1关闭）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`notice_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 10 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '通知公告表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_notice
-- ----------------------------

-- ----------------------------
-- Table structure for sys_oper_log
-- ----------------------------
DROP TABLE IF EXISTS `sys_oper_log`;
CREATE TABLE `sys_oper_log`  (
  `oper_id` bigint NOT NULL AUTO_INCREMENT COMMENT '日志主键',
  `title` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '模块标题',
  `business_type` int NULL DEFAULT 0 COMMENT '业务类型（0其它 1新增 2修改 3删除）',
  `method` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '方法名称',
  `request_method` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '请求方式',
  `operator_type` int NULL DEFAULT 0 COMMENT '操作类别（0其它 1后台用户 2手机端用户）',
  `oper_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '操作人员',
  `dept_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '部门名称',
  `oper_url` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '请求URL',
  `oper_ip` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '主机地址',
  `oper_location` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '操作地点',
  `oper_param` varchar(2000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '请求参数',
  `json_result` varchar(2000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '返回参数',
  `status` int NULL DEFAULT 0 COMMENT '操作状态（0正常 1异常）',
  `error_msg` varchar(2000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '错误消息',
  `oper_time` datetime NULL DEFAULT NULL COMMENT '操作时间',
  `cost_time` bigint NULL DEFAULT 0 COMMENT '消耗时间',
  PRIMARY KEY (`oper_id`) USING BTREE,
  INDEX `idx_sys_oper_log_bt`(`business_type` ASC) USING BTREE,
  INDEX `idx_sys_oper_log_s`(`status` ASC) USING BTREE,
  INDEX `idx_sys_oper_log_ot`(`oper_time` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 149 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '操作日志记录' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_oper_log
-- ----------------------------
INSERT INTO `sys_oper_log` VALUES (100, '个人信息', 2, 'top.codeflux.web.controller.system.SysProfileController.updateProfile()', 'PUT', 1, 'admin', '研发部门', '/system/user/profile', '127.0.0.1', '内网IP', '{\"admin\":false,\"email\":\"59605904@qq.com\",\"nickName\":\"管理员\",\"params\":{},\"phonenumber\":\"19999999999\",\"sex\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-15 15:19:43', 36);
INSERT INTO `sys_oper_log` VALUES (101, '菜单管理', 3, 'top.codeflux.web.controller.system.SysMenuController.remove()', 'DELETE', 1, 'admin', '研发部门', '/system/menu/4', '127.0.0.1', '内网IP', '4', '{\"msg\":\"菜单已分配,不允许删除\",\"code\":601}', 0, NULL, '2025-05-15 15:33:48', 37);
INSERT INTO `sys_oper_log` VALUES (102, '菜单管理', 2, 'top.codeflux.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"createTime\":\"2025-05-15 15:11:20\",\"icon\":\"guide\",\"isCache\":\"0\",\"isFrame\":\"0\",\"menuId\":4,\"menuName\":\"若依官网\",\"menuType\":\"M\",\"orderNum\":4,\"params\":{},\"parentId\":0,\"path\":\"http://ruoyi.vip\",\"perms\":\"\",\"query\":\"\",\"routeName\":\"\",\"status\":\"1\",\"updateBy\":\"admin\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-15 15:34:01', 48);
INSERT INTO `sys_oper_log` VALUES (103, '菜单管理', 3, 'top.codeflux.web.controller.system.SysMenuController.remove()', 'DELETE', 1, 'admin', '研发部门', '/system/menu/4', '127.0.0.1', '内网IP', '4', '{\"msg\":\"菜单已分配,不允许删除\",\"code\":601}', 0, NULL, '2025-05-15 15:34:03', 8);
INSERT INTO `sys_oper_log` VALUES (104, '菜单管理', 3, 'top.codeflux.web.controller.system.SysMenuController.remove()', 'DELETE', 1, 'admin', '研发部门', '/system/menu/4', '127.0.0.1', '内网IP', '4', '{\"msg\":\"菜单已分配,不允许删除\",\"code\":601}', 0, NULL, '2025-05-15 15:34:07', 12);
INSERT INTO `sys_oper_log` VALUES (105, '菜单管理', 2, 'top.codeflux.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"createTime\":\"2025-05-15 15:11:20\",\"icon\":\"guide\",\"isCache\":\"0\",\"isFrame\":\"0\",\"menuId\":4,\"menuName\":\"若依官网\",\"menuType\":\"M\",\"orderNum\":4,\"params\":{},\"parentId\":0,\"path\":\"http://ruoyi.vip\",\"perms\":\"\",\"query\":\"\",\"routeName\":\"\",\"status\":\"1\",\"updateBy\":\"admin\",\"visible\":\"1\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-15 15:34:13', 18);
INSERT INTO `sys_oper_log` VALUES (106, '菜单管理', 3, 'top.codeflux.web.controller.system.SysMenuController.remove()', 'DELETE', 1, 'admin', '研发部门', '/system/menu/4', '127.0.0.1', '内网IP', '4', '{\"msg\":\"菜单已分配,不允许删除\",\"code\":601}', 0, NULL, '2025-05-15 15:34:15', 19);
INSERT INTO `sys_oper_log` VALUES (107, '菜单管理', 2, 'top.codeflux.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"createTime\":\"2025-05-15 15:11:20\",\"icon\":\"guide\",\"isCache\":\"0\",\"isFrame\":\"0\",\"menuId\":4,\"menuName\":\"官网\",\"menuType\":\"M\",\"orderNum\":4,\"params\":{},\"parentId\":0,\"path\":\"codeflux.top\",\"perms\":\"\",\"query\":\"\",\"routeName\":\"\",\"status\":\"1\",\"visible\":\"1\"}', '{\"msg\":\"修改菜单\'官网\'失败，地址必须以http(s)://开头\",\"code\":500}', 0, NULL, '2025-05-15 15:34:38', 5);
INSERT INTO `sys_oper_log` VALUES (108, '菜单管理', 2, 'top.codeflux.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"createTime\":\"2025-05-15 15:11:20\",\"icon\":\"guide\",\"isCache\":\"0\",\"isFrame\":\"0\",\"menuId\":4,\"menuName\":\"官网\",\"menuType\":\"M\",\"orderNum\":4,\"params\":{},\"parentId\":0,\"path\":\"http://codeflux.top\",\"perms\":\"\",\"query\":\"\",\"routeName\":\"\",\"status\":\"1\",\"updateBy\":\"admin\",\"visible\":\"1\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-15 15:34:45', 19);
INSERT INTO `sys_oper_log` VALUES (109, '通知公告', 3, 'top.codeflux.web.controller.system.SysNoticeController.remove()', 'DELETE', 1, 'admin', '研发部门', '/system/notice/1', '127.0.0.1', '内网IP', '[1]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-15 15:36:06', 25);
INSERT INTO `sys_oper_log` VALUES (110, '通知公告', 3, 'top.codeflux.web.controller.system.SysNoticeController.remove()', 'DELETE', 1, 'admin', '研发部门', '/system/notice/2', '127.0.0.1', '内网IP', '[2]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-15 15:36:08', 10);
INSERT INTO `sys_oper_log` VALUES (111, '菜单管理', 1, 'top.codeflux.web.controller.system.SysMenuController.add()', 'POST', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"createBy\":\"admin\",\"icon\":\"user\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuName\":\"app用户\",\"menuType\":\"M\",\"orderNum\":0,\"params\":{},\"parentId\":0,\"path\":\"/appUser\",\"status\":\"0\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-16 17:07:42', 29);
INSERT INTO `sys_oper_log` VALUES (112, '代码生成', 6, 'top.codeflux.generator.controller.GenController.importTableSave()', 'POST', 1, 'admin', '研发部门', '/tool/gen/importTable', '127.0.0.1', '内网IP', '{\"tables\":\"app_user,allergen\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-16 17:18:04', 253);
INSERT INTO `sys_oper_log` VALUES (113, '代码生成', 2, 'top.codeflux.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"allergen\",\"className\":\"Allergen\",\"columns\":[{\"capJavaField\":\"Id\",\"columnId\":1,\"columnName\":\"id\",\"columnType\":\"int unsigned\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:03\",\"dictType\":\"\",\"edit\":false,\"increment\":true,\"insert\":false,\"isIncrement\":\"1\",\"isInsert\":\"0\",\"isPk\":\"1\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"String\",\"list\":false,\"params\":{},\"pk\":true,\"query\":false,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"usableColumn\":false},{\"capJavaField\":\"StudentId\",\"columnComment\":\"学号\",\"columnId\":2,\"columnName\":\"student_id\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:03\",\"dictType\":\"\",\"edit\":false,\"htmlType\":\"input\",\"increment\":false,\"insert\":false,\"isEdit\":\"0\",\"isIncrement\":\"0\",\"isInsert\":\"0\",\"isList\":\"0\",\"isPk\":\"0\",\"isQuery\":\"0\",\"isRequired\":\"1\",\"javaField\":\"studentId\",\"javaType\":\"String\",\"list\":false,\"params\":{},\"pk\":false,\"query\":false,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"usableColumn\":false},{\"capJavaField\":\"Allergen\",\"columnId\":3,\"columnName\":\"allergen\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:03\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"0\",\"javaField\":\"allergen\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":false,\"sort\":3,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"usableColumn\":false},{\"capJavaField\":\"CreateTime\",\"columnId\":4,\"columnName\":\"create_time\",\"columnType\":\"datetime\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":false,\"htmlType\":\"datetime\",\"increment\":false,\"insert\":false,\"isIncrement\":\"0\",\"isInsert\":\"0\",\"isPk\":\"0\",\"isRequired\":\"0\",\"javaField\":\"createTime\",\"javaType\":\"Date\",\"list\":false,\"params\":{},\"pk\":false,\"query\":false,\"queryType\":\"EQ\",\"require', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-16 17:18:42', 47);
INSERT INTO `sys_oper_log` VALUES (114, '代码生成', 2, 'top.codeflux.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"allergen\",\"className\":\"Allergen\",\"columns\":[{\"capJavaField\":\"Id\",\"columnId\":1,\"columnName\":\"id\",\"columnType\":\"int unsigned\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:03\",\"dictType\":\"\",\"edit\":false,\"increment\":true,\"insert\":false,\"isIncrement\":\"1\",\"isInsert\":\"0\",\"isPk\":\"1\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"String\",\"list\":false,\"params\":{},\"pk\":true,\"query\":false,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2025-05-16 17:18:42\",\"usableColumn\":false},{\"capJavaField\":\"StudentId\",\"columnComment\":\"学号\",\"columnId\":2,\"columnName\":\"student_id\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:03\",\"dictType\":\"\",\"edit\":false,\"htmlType\":\"input\",\"increment\":false,\"insert\":false,\"isEdit\":\"0\",\"isIncrement\":\"0\",\"isInsert\":\"0\",\"isList\":\"0\",\"isPk\":\"0\",\"isQuery\":\"0\",\"isRequired\":\"1\",\"javaField\":\"studentId\",\"javaType\":\"String\",\"list\":false,\"params\":{},\"pk\":false,\"query\":false,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2025-05-16 17:18:42\",\"usableColumn\":false},{\"capJavaField\":\"Allergen\",\"columnId\":3,\"columnName\":\"allergen\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:03\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"allergen\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":3,\"superColumn\":false,\"tableId\":1,\"updateBy\":\"\",\"updateTime\":\"2025-05-16 17:18:42\",\"usableColumn\":false},{\"capJavaField\":\"CreateTime\",\"columnId\":4,\"columnName\":\"create_time\",\"columnType\":\"datetime\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":false,\"htmlType\":\"datetime\",\"increment\":false,\"insert\":false,\"isIncrement\":\"0\",\"isInsert\":\"0\",\"isPk\":\"0\",\"isRequired\":\"0\",\"javaField\":\"c', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-16 17:18:54', 47);
INSERT INTO `sys_oper_log` VALUES (115, '代码生成', 2, 'top.codeflux.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"user\",\"className\":\"AppUser\",\"columns\":[{\"capJavaField\":\"Id\",\"columnId\":5,\"columnName\":\"id\",\"columnType\":\"int unsigned\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":false,\"increment\":true,\"insert\":true,\"isIncrement\":\"1\",\"isInsert\":\"1\",\"isPk\":\"1\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"String\",\"list\":false,\"params\":{},\"pk\":true,\"query\":false,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":2,\"updateBy\":\"\",\"usableColumn\":false},{\"capJavaField\":\"StudentNumber\",\"columnComment\":\"学号\",\"columnId\":6,\"columnName\":\"student_number\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"studentNumber\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":2,\"updateBy\":\"\",\"usableColumn\":false},{\"capJavaField\":\"Name\",\"columnComment\":\"姓名\",\"columnId\":7,\"columnName\":\"name\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"name\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"LIKE\",\"required\":true,\"sort\":3,\"superColumn\":false,\"tableId\":2,\"updateBy\":\"\",\"usableColumn\":false},{\"capJavaField\":\"Password\",\"columnComment\":\"登录密码\",\"columnId\":8,\"columnName\":\"password\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"0\",\"isPk\":\"0\",\"isQuery\":\"0\",\"isRequired\":\"0\",\"javaField\":\"password\",\"javaType\":\"String\",\"list\"', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-16 17:20:09', 77);
INSERT INTO `sys_oper_log` VALUES (116, '代码生成', 2, 'top.codeflux.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"appUser\",\"className\":\"AppUser\",\"columns\":[{\"capJavaField\":\"Id\",\"columnId\":5,\"columnName\":\"id\",\"columnType\":\"int unsigned\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":false,\"increment\":true,\"insert\":true,\"isIncrement\":\"1\",\"isInsert\":\"1\",\"isPk\":\"1\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"String\",\"list\":false,\"params\":{},\"pk\":true,\"query\":false,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":2,\"updateBy\":\"\",\"updateTime\":\"2025-05-16 17:20:09\",\"usableColumn\":false},{\"capJavaField\":\"StudentNumber\",\"columnComment\":\"学号\",\"columnId\":6,\"columnName\":\"student_number\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"studentNumber\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":2,\"updateBy\":\"\",\"updateTime\":\"2025-05-16 17:20:09\",\"usableColumn\":false},{\"capJavaField\":\"Name\",\"columnComment\":\"姓名\",\"columnId\":7,\"columnName\":\"name\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"name\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"LIKE\",\"required\":true,\"sort\":3,\"superColumn\":false,\"tableId\":2,\"updateBy\":\"\",\"updateTime\":\"2025-05-16 17:20:09\",\"usableColumn\":false},{\"capJavaField\":\"Password\",\"columnComment\":\"登录密码\",\"columnId\":8,\"columnName\":\"password\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-16 17:21:12', 48);
INSERT INTO `sys_oper_log` VALUES (117, '代码生成', 2, 'top.codeflux.generator.controller.GenController.editSave()', 'PUT', 1, 'admin', '研发部门', '/tool/gen', '127.0.0.1', '内网IP', '{\"businessName\":\"appUser\",\"className\":\"AppUser\",\"columns\":[{\"capJavaField\":\"Id\",\"columnId\":5,\"columnName\":\"id\",\"columnType\":\"int unsigned\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":false,\"increment\":true,\"insert\":true,\"isIncrement\":\"1\",\"isInsert\":\"1\",\"isPk\":\"1\",\"isRequired\":\"0\",\"javaField\":\"id\",\"javaType\":\"String\",\"list\":false,\"params\":{},\"pk\":true,\"query\":false,\"queryType\":\"EQ\",\"required\":false,\"sort\":1,\"superColumn\":false,\"tableId\":2,\"updateBy\":\"\",\"updateTime\":\"2025-05-16 17:21:12\",\"usableColumn\":false},{\"capJavaField\":\"StudentNumber\",\"columnComment\":\"学号\",\"columnId\":6,\"columnName\":\"student_number\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"studentNumber\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"EQ\",\"required\":true,\"sort\":2,\"superColumn\":false,\"tableId\":2,\"updateBy\":\"\",\"updateTime\":\"2025-05-16 17:21:12\",\"usableColumn\":false},{\"capJavaField\":\"Name\",\"columnComment\":\"姓名\",\"columnId\":7,\"columnName\":\"name\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":\"1\",\"isList\":\"1\",\"isPk\":\"0\",\"isQuery\":\"1\",\"isRequired\":\"1\",\"javaField\":\"name\",\"javaType\":\"String\",\"list\":true,\"params\":{},\"pk\":false,\"query\":true,\"queryType\":\"LIKE\",\"required\":true,\"sort\":3,\"superColumn\":false,\"tableId\":2,\"updateBy\":\"\",\"updateTime\":\"2025-05-16 17:21:12\",\"usableColumn\":false},{\"capJavaField\":\"Password\",\"columnComment\":\"登录密码\",\"columnId\":8,\"columnName\":\"password\",\"columnType\":\"varchar(255)\",\"createBy\":\"admin\",\"createTime\":\"2025-05-16 17:18:04\",\"dictType\":\"\",\"edit\":true,\"htmlType\":\"input\",\"increment\":false,\"insert\":true,\"isEdit\":\"1\",\"isIncrement\":\"0\",\"isInsert\":', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-16 17:21:52', 60);
INSERT INTO `sys_oper_log` VALUES (118, '代码生成', 8, 'top.codeflux.generator.controller.GenController.batchGenCode()', 'GET', 1, 'admin', '研发部门', '/tool/gen/batchGenCode', '127.0.0.1', '内网IP', '{\"tables\":\"app_user\"}', NULL, 0, NULL, '2025-05-16 17:21:56', 559);
INSERT INTO `sys_oper_log` VALUES (119, 'app注册用户', 5, 'top.codeflux.appUser.controller.AppUserController.export()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2025-05-16 21:07:42', 634);
INSERT INTO `sys_oper_log` VALUES (120, 'app注册用户', 5, 'top.codeflux.appUser.controller.AppUserController.export()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2025-05-16 21:08:21', 53);
INSERT INTO `sys_oper_log` VALUES (121, 'app注册用户', 5, 'top.codeflux.appUser.controller.AppUserController.export()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2025-05-20 08:26:26', 606);
INSERT INTO `sys_oper_log` VALUES (122, '菜单管理', 2, 'top.codeflux.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"component\":\"intelligentNutrition-appUser/appUser/index\",\"createTime\":\"2025-05-16 17:22:44\",\"icon\":\"user\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuId\":2001,\"menuName\":\"app注册用户\",\"menuType\":\"C\",\"orderNum\":1,\"params\":{},\"parentId\":2000,\"path\":\"appUser\",\"perms\":\"intelligentNutrition-appUser:appUser:list\",\"routeName\":\"\",\"status\":\"0\",\"updateBy\":\"admin\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-26 10:36:39', 102);
INSERT INTO `sys_oper_log` VALUES (123, '菜单管理', 2, 'top.codeflux.web.controller.system.SysMenuController.edit()', 'PUT', 1, 'admin', '研发部门', '/system/menu', '127.0.0.1', '内网IP', '{\"children\":[],\"component\":\"intelligentNutrition-appUser/appUser/index\",\"createTime\":\"2025-05-16 17:22:44\",\"icon\":\"peoples\",\"isCache\":\"0\",\"isFrame\":\"1\",\"menuId\":2001,\"menuName\":\"app注册用户\",\"menuType\":\"C\",\"orderNum\":1,\"params\":{},\"parentId\":2000,\"path\":\"appUser\",\"perms\":\"intelligentNutrition-appUser:appUser:list\",\"routeName\":\"\",\"status\":\"0\",\"updateBy\":\"admin\",\"visible\":\"0\"}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-26 10:37:41', 34);
INSERT INTO `sys_oper_log` VALUES (124, 'app注册用户', 2, 'top.codeflux.appUser.controller.AppUserController.edit()', 'PUT', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"avatar\":\"https://ts3.tc.mm.bing.net/th/id/OIP-C.g5M-iZUiocFCi9YAzojtRAAAAA\",\"height\":190.0,\"id\":\"1\",\"name\":\"覃惠通\",\"params\":{},\"studentNumber\":\"2331020130229\",\"updateTime\":\"2025-05-26 11:29:39\",\"weight\":50.0}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-26 11:29:39', 238);
INSERT INTO `sys_oper_log` VALUES (125, 'app注册用户', 2, 'top.codeflux.appUser.controller.AppUserController.edit()', 'PUT', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"avatar\":\"https://ts3.tc.mm.bing.net/th/id/OIP-C.g5M-iZUiocFCi9YAzojtRAAAAA\",\"height\":190.0,\"id\":\"1\",\"name\":\"覃惠通\",\"params\":{},\"studentNumber\":\"2331020130229\",\"updateTime\":\"2025-05-26 11:32:29\",\"weight\":50.0}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-26 11:32:29', 16);
INSERT INTO `sys_oper_log` VALUES (126, 'app注册用户', 2, 'top.codeflux.appUser.controller.AppUserController.edit()', 'PUT', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"avatar\":\"https://ts3.tc.mm.bing.net/th/id/OIP-C.g5M-iZUiocFCi9YAzojtRAAAAA\",\"height\":190.0,\"id\":\"1\",\"name\":\"覃惠通\",\"params\":{},\"studentNumber\":\"2331020130229\",\"updateTime\":\"2025-05-26 12:06:18\",\"weight\":50.0}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-26 12:06:18', 48);
INSERT INTO `sys_oper_log` VALUES (127, 'app注册用户', 2, 'top.codeflux.appUser.controller.AppUserController.edit()', 'PUT', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"allergenList\":[{\"allergen\":\"伤心\",\"createTime\":\"2025-05-26 12:07:37.513522200\",\"studentNumber\":\"2331020130229\"},{\"allergen\":\"炸药\",\"createTime\":\"2025-05-26 12:07:37.513522200\",\"studentNumber\":\"2331020130229\"},{\"allergen\":\"子弹\",\"createTime\":\"2025-05-26 12:07:37.513522200\",\"studentNumber\":\"2331020130229\"}],\"avatar\":\"https://ts3.tc.mm.bing.net/th/id/OIP-C.g5M-iZUiocFCi9YAzojtRAAAAA\",\"height\":190.0,\"name\":\"覃惠通\",\"studentNumber\":\"2331020130229\",\"weight\":50.0}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-26 12:07:37', 358);
INSERT INTO `sys_oper_log` VALUES (128, 'app注册用户', 2, 'top.codeflux.appUser.controller.AppUserController.edit()', 'PUT', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"allergenList\":[{\"allergen\":\"伤心\",\"createTime\":\"2025-05-26 12:08:38.089373200\",\"studentNumber\":\"2331020130229\"},{\"allergen\":\"炸药\",\"createTime\":\"2025-05-26 12:08:38.089373200\",\"studentNumber\":\"2331020130229\"},{\"allergen\":\"子弹\",\"createTime\":\"2025-05-26 12:08:38.089373200\",\"studentNumber\":\"2331020130229\"}],\"avatar\":\"https://ts3.tc.mm.bing.net/th/id/OIP-C.g5M-iZUiocFCi9YAzojtRAAAAA\",\"height\":190.0,\"name\":\"覃惠通\",\"studentNumber\":\"2331020130229\",\"weight\":50.0}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-26 12:08:38', 170);
INSERT INTO `sys_oper_log` VALUES (129, 'app注册用户', 1, 'top.codeflux.appUser.controller.AppUserController.add()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"allergenList\":[{\"allergen\":\"杜甫\"}],\"avatar\":\"/profile/upload/2025/05/26/red_oil_20250526163950A001.jpg\",\"height\":190.0,\"name\":\"李白\",\"studentNumber\":\"2333311220111\",\"weight\":50.0}', NULL, 1, '\r\n### Error updating database.  Cause: java.sql.SQLException: Field \'password\' doesn\'t have a default value\r\n### The error may exist in file [D:\\Program Codes\\intelligentNutrition\\intelligentNutrition-server\\intelligentNutrition-appUser\\target\\classes\\mapper\\intelligentNutrition-appUser\\AppUserMapper.xml]\r\n### The error may involve top.codeflux.appUser.mapper.AppUserMapper.insertAppUser-Inline\r\n### The error occurred while setting parameters\r\n### SQL: insert into app_user ( student_number, name,  avatar, height, weight,create_time, update_time )   values ( ?, ?,  ?, ?, ?,now(), now() )\r\n### Cause: java.sql.SQLException: Field \'password\' doesn\'t have a default value\n; Field \'password\' doesn\'t have a default value', '2025-05-26 16:40:30', 143);
INSERT INTO `sys_oper_log` VALUES (130, 'app注册用户', 1, 'top.codeflux.appUser.controller.AppUserController.add()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"allergenList\":[{\"allergen\":\"杜甫\"}],\"avatar\":\"/profile/upload/2025/05/26/red_oil_20250526163950A001.jpg\",\"height\":190.0,\"name\":\"李白\",\"studentNumber\":\"2333311220111\",\"weight\":50.0}', NULL, 1, '\r\n### Error updating database.  Cause: java.sql.SQLException: Field \'password\' doesn\'t have a default value\r\n### The error may exist in file [D:\\Program Codes\\intelligentNutrition\\intelligentNutrition-server\\intelligentNutrition-appUser\\target\\classes\\mapper\\intelligentNutrition-appUser\\AppUserMapper.xml]\r\n### The error may involve top.codeflux.appUser.mapper.AppUserMapper.insertAppUser-Inline\r\n### The error occurred while setting parameters\r\n### SQL: insert into app_user ( student_number, name,  avatar, height, weight,create_time, update_time )   values ( ?, ?,  ?, ?, ?,now(), now() )\r\n### Cause: java.sql.SQLException: Field \'password\' doesn\'t have a default value\n; Field \'password\' doesn\'t have a default value', '2025-05-26 16:40:49', 9);
INSERT INTO `sys_oper_log` VALUES (131, 'app注册用户', 1, 'top.codeflux.appUser.controller.AppUserController.add()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"allergenList\":[{\"allergen\":\"杜甫\",\"createTime\":\"2025-05-26 16:43:30.543672900\",\"studentNumber\":\"2333311220111\"}],\"avatar\":\"/profile/upload/2025/05/26/red_oil_20250526163950A001.jpg\",\"height\":190.0,\"name\":\"李白\",\"studentNumber\":\"2333311220111\",\"weight\":50.0}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-05-26 16:43:30', 93);
INSERT INTO `sys_oper_log` VALUES (132, 'app注册用户', 5, 'top.codeflux.appUser.controller.AppUserController.export()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2025-05-26 16:45:51', 1330);
INSERT INTO `sys_oper_log` VALUES (133, 'app注册用户', 5, 'top.codeflux.appUser.controller.AppUserController.export()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2025-05-26 16:45:53', 191);
INSERT INTO `sys_oper_log` VALUES (134, 'app注册用户', 1, 'top.codeflux.appUser.controller.AppUserController.add()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"allergenList\":[{\"allergen\":\"苹果\",\"createTime\":\"2025-06-01 18:02:01.787325\",\"studentNumber\":\"2331111111112\"},{\"allergen\":\"李白\",\"createTime\":\"2025-06-01 18:02:01.787325\",\"studentNumber\":\"2331111111112\"}],\"height\":190.0,\"name\":\"杜甫\",\"studentNumber\":\"2331111111112\",\"weight\":120.0}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 18:02:01', 102);
INSERT INTO `sys_oper_log` VALUES (135, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/3', '127.0.0.1', '内网IP', '[\"3\"]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 18:25:03', 126);
INSERT INTO `sys_oper_log` VALUES (136, 'app注册用户', 1, 'top.codeflux.appUser.controller.AppUserController.add()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"allergenList\":[{\"allergen\":\"\",\"createTime\":\"2025-06-01 18:49:39.345442800\",\"studentNumber\":\"2331111111111\"}],\"height\":120.0,\"name\":\"李白\",\"studentNumber\":\"2331111111111\",\"weight\":150.0}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 18:49:39', 51);
INSERT INTO `sys_oper_log` VALUES (137, 'app注册用户', 1, 'top.codeflux.appUser.controller.AppUserController.add()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser', '127.0.0.1', '内网IP', '{\"allergenList\":[{\"allergen\":\"苹果\",\"createTime\":\"2025-06-01 18:49:39.327317600\",\"studentNumber\":\"2331111111112\"},{\"allergen\":\"李白\",\"createTime\":\"2025-06-01 18:49:39.327317600\",\"studentNumber\":\"2331111111112\"}],\"height\":190.0,\"name\":\"杜甫\",\"studentNumber\":\"2331111111112\",\"weight\":120.0}', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 18:49:39', 49);
INSERT INTO `sys_oper_log` VALUES (138, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/4,5', '127.0.0.1', '内网IP', '[\"4\",\"5\"]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 18:54:38', 78);
INSERT INTO `sys_oper_log` VALUES (139, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/6,7', '127.0.0.1', '内网IP', '[\"6\",\"7\"]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 19:09:53', 52);
INSERT INTO `sys_oper_log` VALUES (140, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/8,9', '127.0.0.1', '内网IP', '[\"8\",\"9\"]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 19:22:28', 143);
INSERT INTO `sys_oper_log` VALUES (141, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/10,11', '127.0.0.1', '内网IP', '[\"10\",\"11\"]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 19:23:04', 24);
INSERT INTO `sys_oper_log` VALUES (142, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/13,12', '127.0.0.1', '内网IP', '[\"13\",\"12\"]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 19:23:36', 26);
INSERT INTO `sys_oper_log` VALUES (143, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/15,14', '127.0.0.1', '内网IP', '[\"15\",\"14\"]', NULL, 1, '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near \'[Ljava.lang.String;@1a770fa1)\' at line 1\r\n### The error may exist in top/codeflux/appUser/mapper/AppUserMapper.java (best guess)\r\n### The error may involve top.codeflux.appUser.mapper.AppUserMapper.selectStudentNumberByIds-Inline\r\n### The error occurred while setting parameters\r\n### SQL: select student_number from app_user where id in ([Ljava.lang.String;@1a770fa1)\r\n### Cause: java.sql.SQLSyntaxErrorException: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near \'[Ljava.lang.String;@1a770fa1)\' at line 1\n; bad SQL grammar []', '2025-06-01 19:31:06', 276);
INSERT INTO `sys_oper_log` VALUES (144, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/15,14', '127.0.0.1', '内网IP', '[\"15\",\"14\"]', NULL, 1, '\r\n### Error querying database.  Cause: java.sql.SQLSyntaxErrorException: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near \'[Ljava.lang.String;@257501e5)\' at line 1\r\n### The error may exist in top/codeflux/appUser/mapper/AppUserMapper.java (best guess)\r\n### The error may involve top.codeflux.appUser.mapper.AppUserMapper.selectStudentNumberByIds-Inline\r\n### The error occurred while setting parameters\r\n### SQL: select student_number from app_user where id in ([Ljava.lang.String;@257501e5)\r\n### Cause: java.sql.SQLSyntaxErrorException: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near \'[Ljava.lang.String;@257501e5)\' at line 1\n; bad SQL grammar []', '2025-06-01 19:33:01', 121);
INSERT INTO `sys_oper_log` VALUES (145, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/15,14', '127.0.0.1', '内网IP', '[\"15\",\"14\"]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 19:36:41', 90);
INSERT INTO `sys_oper_log` VALUES (146, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/16,17', '127.0.0.1', '内网IP', '[\"16\",\"17\"]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-01 19:37:01', 38);
INSERT INTO `sys_oper_log` VALUES (147, 'app注册用户', 5, 'top.codeflux.appUser.controller.AppUserController.export()', 'POST', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/export', '127.0.0.1', '内网IP', '{\"pageSize\":\"10\",\"pageNum\":\"1\"}', NULL, 0, NULL, '2025-06-01 21:34:17', 441);
INSERT INTO `sys_oper_log` VALUES (148, 'app注册用户', 3, 'top.codeflux.appUser.controller.AppUserController.remove()', 'DELETE', 1, 'admin', '研发部门', '/intelligentNutrition-appUser/appUser/19,18', '127.0.0.1', '内网IP', '[\"19\",\"18\"]', '{\"msg\":\"操作成功\",\"code\":200}', 0, NULL, '2025-06-04 09:23:33', 76);

-- ----------------------------
-- Table structure for sys_post
-- ----------------------------
DROP TABLE IF EXISTS `sys_post`;
CREATE TABLE `sys_post`  (
  `post_id` bigint NOT NULL AUTO_INCREMENT COMMENT '岗位ID',
  `post_code` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '岗位编码',
  `post_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '岗位名称',
  `post_sort` int NOT NULL COMMENT '显示顺序',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '状态（0正常 1停用）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`post_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 5 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '岗位信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_post
-- ----------------------------
INSERT INTO `sys_post` VALUES (1, 'ceo', '董事长', 1, '0', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_post` VALUES (2, 'se', '项目经理', 2, '0', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_post` VALUES (3, 'hr', '人力资源', 3, '0', 'admin', '2025-05-15 15:11:20', '', NULL, '');
INSERT INTO `sys_post` VALUES (4, 'user', '普通员工', 4, '0', 'admin', '2025-05-15 15:11:20', '', NULL, '');

-- ----------------------------
-- Table structure for sys_role
-- ----------------------------
DROP TABLE IF EXISTS `sys_role`;
CREATE TABLE `sys_role`  (
  `role_id` bigint NOT NULL AUTO_INCREMENT COMMENT '角色ID',
  `role_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色名称',
  `role_key` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色权限字符串',
  `role_sort` int NOT NULL COMMENT '显示顺序',
  `data_scope` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '1' COMMENT '数据范围（1：全部数据权限 2：自定数据权限 3：本部门数据权限 4：本部门及以下数据权限）',
  `menu_check_strictly` tinyint(1) NULL DEFAULT 1 COMMENT '菜单树选择项是否关联显示',
  `dept_check_strictly` tinyint(1) NULL DEFAULT 1 COMMENT '部门树选择项是否关联显示',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '角色状态（0正常 1停用）',
  `del_flag` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '删除标志（0代表存在 2代表删除）',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`role_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 100 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '角色信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_role
-- ----------------------------
INSERT INTO `sys_role` VALUES (1, '超级管理员', 'admin', 1, '1', 1, 1, '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '超级管理员');
INSERT INTO `sys_role` VALUES (2, '普通角色', 'common', 2, '2', 1, 1, '0', '0', 'admin', '2025-05-15 15:11:20', '', NULL, '普通角色');

-- ----------------------------
-- Table structure for sys_role_dept
-- ----------------------------
DROP TABLE IF EXISTS `sys_role_dept`;
CREATE TABLE `sys_role_dept`  (
  `role_id` bigint NOT NULL COMMENT '角色ID',
  `dept_id` bigint NOT NULL COMMENT '部门ID',
  PRIMARY KEY (`role_id`, `dept_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '角色和部门关联表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_role_dept
-- ----------------------------
INSERT INTO `sys_role_dept` VALUES (2, 100);
INSERT INTO `sys_role_dept` VALUES (2, 101);
INSERT INTO `sys_role_dept` VALUES (2, 105);

-- ----------------------------
-- Table structure for sys_role_menu
-- ----------------------------
DROP TABLE IF EXISTS `sys_role_menu`;
CREATE TABLE `sys_role_menu`  (
  `role_id` bigint NOT NULL COMMENT '角色ID',
  `menu_id` bigint NOT NULL COMMENT '菜单ID',
  PRIMARY KEY (`role_id`, `menu_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '角色和菜单关联表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_role_menu
-- ----------------------------
INSERT INTO `sys_role_menu` VALUES (2, 1);
INSERT INTO `sys_role_menu` VALUES (2, 2);
INSERT INTO `sys_role_menu` VALUES (2, 3);
INSERT INTO `sys_role_menu` VALUES (2, 4);
INSERT INTO `sys_role_menu` VALUES (2, 100);
INSERT INTO `sys_role_menu` VALUES (2, 101);
INSERT INTO `sys_role_menu` VALUES (2, 102);
INSERT INTO `sys_role_menu` VALUES (2, 103);
INSERT INTO `sys_role_menu` VALUES (2, 104);
INSERT INTO `sys_role_menu` VALUES (2, 105);
INSERT INTO `sys_role_menu` VALUES (2, 106);
INSERT INTO `sys_role_menu` VALUES (2, 107);
INSERT INTO `sys_role_menu` VALUES (2, 108);
INSERT INTO `sys_role_menu` VALUES (2, 109);
INSERT INTO `sys_role_menu` VALUES (2, 110);
INSERT INTO `sys_role_menu` VALUES (2, 111);
INSERT INTO `sys_role_menu` VALUES (2, 112);
INSERT INTO `sys_role_menu` VALUES (2, 113);
INSERT INTO `sys_role_menu` VALUES (2, 114);
INSERT INTO `sys_role_menu` VALUES (2, 115);
INSERT INTO `sys_role_menu` VALUES (2, 116);
INSERT INTO `sys_role_menu` VALUES (2, 117);
INSERT INTO `sys_role_menu` VALUES (2, 500);
INSERT INTO `sys_role_menu` VALUES (2, 501);
INSERT INTO `sys_role_menu` VALUES (2, 1000);
INSERT INTO `sys_role_menu` VALUES (2, 1001);
INSERT INTO `sys_role_menu` VALUES (2, 1002);
INSERT INTO `sys_role_menu` VALUES (2, 1003);
INSERT INTO `sys_role_menu` VALUES (2, 1004);
INSERT INTO `sys_role_menu` VALUES (2, 1005);
INSERT INTO `sys_role_menu` VALUES (2, 1006);
INSERT INTO `sys_role_menu` VALUES (2, 1007);
INSERT INTO `sys_role_menu` VALUES (2, 1008);
INSERT INTO `sys_role_menu` VALUES (2, 1009);
INSERT INTO `sys_role_menu` VALUES (2, 1010);
INSERT INTO `sys_role_menu` VALUES (2, 1011);
INSERT INTO `sys_role_menu` VALUES (2, 1012);
INSERT INTO `sys_role_menu` VALUES (2, 1013);
INSERT INTO `sys_role_menu` VALUES (2, 1014);
INSERT INTO `sys_role_menu` VALUES (2, 1015);
INSERT INTO `sys_role_menu` VALUES (2, 1016);
INSERT INTO `sys_role_menu` VALUES (2, 1017);
INSERT INTO `sys_role_menu` VALUES (2, 1018);
INSERT INTO `sys_role_menu` VALUES (2, 1019);
INSERT INTO `sys_role_menu` VALUES (2, 1020);
INSERT INTO `sys_role_menu` VALUES (2, 1021);
INSERT INTO `sys_role_menu` VALUES (2, 1022);
INSERT INTO `sys_role_menu` VALUES (2, 1023);
INSERT INTO `sys_role_menu` VALUES (2, 1024);
INSERT INTO `sys_role_menu` VALUES (2, 1025);
INSERT INTO `sys_role_menu` VALUES (2, 1026);
INSERT INTO `sys_role_menu` VALUES (2, 1027);
INSERT INTO `sys_role_menu` VALUES (2, 1028);
INSERT INTO `sys_role_menu` VALUES (2, 1029);
INSERT INTO `sys_role_menu` VALUES (2, 1030);
INSERT INTO `sys_role_menu` VALUES (2, 1031);
INSERT INTO `sys_role_menu` VALUES (2, 1032);
INSERT INTO `sys_role_menu` VALUES (2, 1033);
INSERT INTO `sys_role_menu` VALUES (2, 1034);
INSERT INTO `sys_role_menu` VALUES (2, 1035);
INSERT INTO `sys_role_menu` VALUES (2, 1036);
INSERT INTO `sys_role_menu` VALUES (2, 1037);
INSERT INTO `sys_role_menu` VALUES (2, 1038);
INSERT INTO `sys_role_menu` VALUES (2, 1039);
INSERT INTO `sys_role_menu` VALUES (2, 1040);
INSERT INTO `sys_role_menu` VALUES (2, 1041);
INSERT INTO `sys_role_menu` VALUES (2, 1042);
INSERT INTO `sys_role_menu` VALUES (2, 1043);
INSERT INTO `sys_role_menu` VALUES (2, 1044);
INSERT INTO `sys_role_menu` VALUES (2, 1045);
INSERT INTO `sys_role_menu` VALUES (2, 1046);
INSERT INTO `sys_role_menu` VALUES (2, 1047);
INSERT INTO `sys_role_menu` VALUES (2, 1048);
INSERT INTO `sys_role_menu` VALUES (2, 1049);
INSERT INTO `sys_role_menu` VALUES (2, 1050);
INSERT INTO `sys_role_menu` VALUES (2, 1051);
INSERT INTO `sys_role_menu` VALUES (2, 1052);
INSERT INTO `sys_role_menu` VALUES (2, 1053);
INSERT INTO `sys_role_menu` VALUES (2, 1054);
INSERT INTO `sys_role_menu` VALUES (2, 1055);
INSERT INTO `sys_role_menu` VALUES (2, 1056);
INSERT INTO `sys_role_menu` VALUES (2, 1057);
INSERT INTO `sys_role_menu` VALUES (2, 1058);
INSERT INTO `sys_role_menu` VALUES (2, 1059);
INSERT INTO `sys_role_menu` VALUES (2, 1060);

-- ----------------------------
-- Table structure for sys_user
-- ----------------------------
DROP TABLE IF EXISTS `sys_user`;
CREATE TABLE `sys_user`  (
  `user_id` bigint NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `dept_id` bigint NULL DEFAULT NULL COMMENT '部门ID',
  `user_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户账号',
  `nick_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户昵称',
  `user_type` varchar(2) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '00' COMMENT '用户类型（00系统用户）',
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '用户邮箱',
  `phonenumber` varchar(11) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '手机号码',
  `sex` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '用户性别（0男 1女 2未知）',
  `avatar` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '头像地址',
  `password` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '密码',
  `status` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '账号状态（0正常 1停用）',
  `del_flag` char(1) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '0' COMMENT '删除标志（0代表存在 2代表删除）',
  `login_ip` varchar(128) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '最后登录IP',
  `login_date` datetime NULL DEFAULT NULL COMMENT '最后登录时间',
  `create_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '创建者',
  `create_time` datetime NULL DEFAULT NULL COMMENT '创建时间',
  `update_by` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT '' COMMENT '更新者',
  `update_time` datetime NULL DEFAULT NULL COMMENT '更新时间',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`user_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 100 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户信息表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_user
-- ----------------------------
INSERT INTO `sys_user` VALUES (1, 103, 'admin', '管理员', '00', '59605904@qq.com', '19999999999', '0', '', '$2a$10$7JB720yubVSZvUI0rEqK/.VqGOZTH.ulu33dHOiBE8ByOhJIrdAu2', '0', '0', '127.0.0.1', '2025-06-07 15:30:01', 'admin', '2025-05-15 15:11:20', '', '2025-06-07 15:30:01', '管理员');
INSERT INTO `sys_user` VALUES (2, 105, 'ry', '若依', '00', 'ry@qq.com', '15666666666', '1', '', '$2a$10$7JB720yubVSZvUI0rEqK/.VqGOZTH.ulu33dHOiBE8ByOhJIrdAu2', '0', '0', '127.0.0.1', '2025-05-15 15:11:20', 'admin', '2025-05-15 15:11:20', '', NULL, '测试员');

-- ----------------------------
-- Table structure for sys_user_post
-- ----------------------------
DROP TABLE IF EXISTS `sys_user_post`;
CREATE TABLE `sys_user_post`  (
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `post_id` bigint NOT NULL COMMENT '岗位ID',
  PRIMARY KEY (`user_id`, `post_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户与岗位关联表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_user_post
-- ----------------------------
INSERT INTO `sys_user_post` VALUES (1, 1);
INSERT INTO `sys_user_post` VALUES (2, 2);

-- ----------------------------
-- Table structure for sys_user_role
-- ----------------------------
DROP TABLE IF EXISTS `sys_user_role`;
CREATE TABLE `sys_user_role`  (
  `user_id` bigint NOT NULL COMMENT '用户ID',
  `role_id` bigint NOT NULL COMMENT '角色ID',
  PRIMARY KEY (`user_id`, `role_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci COMMENT = '用户和角色关联表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of sys_user_role
-- ----------------------------
INSERT INTO `sys_user_role` VALUES (1, 1);
INSERT INTO `sys_user_role` VALUES (2, 2);

-- ----------------------------
-- Triggers structure for table app_user
-- ----------------------------
DROP TRIGGER IF EXISTS `after_user_insert`;
delimiter ;;
CREATE TRIGGER `after_user_insert` AFTER INSERT ON `app_user` FOR EACH ROW BEGIN
    -- 插入用户初始记录到日志表
    INSERT INTO bmi_change_log (
        student_number,
        old_height,
        old_weight,
        new_height,
        new_weight,
        change_time
    )
    VALUES (
        NEW.student_number, 
        NULL,                -- 插入时没有旧值
        NULL,
        NEW.height,
        NEW.weight,
        NOW()
    );
END
;;
delimiter ;

-- ----------------------------
-- Triggers structure for table app_user
-- ----------------------------
DROP TRIGGER IF EXISTS `after_user_update`;
delimiter ;;
CREATE TRIGGER `after_user_update` AFTER UPDATE ON `app_user` FOR EACH ROW BEGIN
    -- 检查height或weight是否发生变化
    IF OLD.height != NEW.height OR OLD.weight != NEW.weight THEN
        -- 插入变更记录到日志表
        INSERT INTO bmi_change_log (
            student_number,
            old_height,
            old_weight,
            new_height,
            new_weight,
            change_time
        )
        VALUES (
            OLD.student_number,
            OLD.height,
            OLD.weight,
            NEW.height,
            NEW.weight,
            NOW()
        );
    END IF;
END
;;
delimiter ;

SET FOREIGN_KEY_CHECKS = 1;
